let text = `单选题
1. 党的十八大以来取得的最重要的政治成果是( )。
A. 习近平新时代中国特色社会主义思想
B.“两个确立”
C. 找到跳出历史周期律的第二个答案
D. 反腐败斗争取得压倒性胜利
答案：B

2. 习近平总书记指出：“经过长期努力，中国特色社会主义进入了新时代”，我国进入新时代的时间节点是( )。
A. 2012年
B. 2017年
C. 2022年
D. 2000年
答案：A

3.“四个意识”是习近平新时代中国特色社会主义思想的重要组成部分， “四个意识”中最关键的( )。
A. 大局意识
B. 核心意识
C. 政治意识
D. 看齐意识
答案：C

4. 经过不懈努力，党找到跳出治乱兴衰周期律的第二个答案，第二个答案的内容是( )。
A. 党要管党，从严治党
B. 强化理想信念
C. 取得反腐败斗争的压倒性胜利
D. 党的自我革命
答案：D

5. 习近平总书记在建党一百年讲话中指出：“经过全党全国各族人民持续奋斗，我们实现了第一个百年奋斗目标”，第一个百年奋斗目标指的是( )。
A. 完成脱贫攻坚、全面建成小康社会的历史任务
B. 中国特色社会主义进入新时代
C. 我国迎来了站起来、富起来到强起来的伟大飞跃
D. 反腐败斗争取得压倒性的胜利
答案：A

6. 下面选项不属于“四个自信”的是( )。
A. 道路自信
B. 历史自信
C. 文化自信
D. 制度自信
答案：B

7. 我国发展新的历史方位是( )。
A. 中国特色社会主义进行新时代
B. 经济发展的新常态
C. 新发展阶段
D. 进入到第二个百年奋斗目标
答案：A

8. 我国社会主要矛盾是人民日益增长的美好生活需要和不平衡不充分的发展之间的矛盾，下列不属于我国社会主要矛盾的表述是( )。
A. 人民对环境的要求日益增长
B. 人民对法治的要求日益增长
C. 人民对温饱的要求日益增长
D. 人民对安全的要求日益增长
答案：C

9. 下列不属于中国梦本质的是( )。
A. 国家富强
B. 人民幸福
C. 民族振兴
D. 共同富裕
答案：D

10. 下列不属于“五位一体”总体布局的是( )。
A. 政治
B. 经济
C. 安全
D. 文化
答案：C

11. 下列哪项是党的最高政治原则( )。
A. 坚持党的集中统一领导
B. 坚持宗旨意识
C. 坚持新发展理念
D. 坚持总体国家安全观
答案:A

12. 全面从严治党永远在路上，党的自我革命永远在路上，决不能有松劲歇脚、疲劳厌战的情绪，必须持之以恒推进全面从严治党，深入推进新时代党的建设新的伟大工程.以党的自我革命引领社会革命。最彻底的自我革命是( )。
A. 反腐败
B. 作风建设常态化长效化
C. 党风廉政建设
D. 让人民来监督政府
答案：A

13. 习近平经济思想指出，我国经济发展的根本立场是( )。
A. 坚持和完善社会主义基本经济制度
B. 坚持新发展理念
C. 坚持以人民为中心的发展思想
D. 加强党对经济工作的全面领导
答案：C

14. 党的二十大报告指出，新时代新征程中国共产党的使命任务是( )。
A. 以中国式现代化推进中华民族伟大复兴
B. 以伟大自我革命引领伟大社会革命
C. 以团结奋斗创造历史伟业
D. 以新发展理念引领我国发展壮大
答案：A

15. 全面建设社会主义现代化国家的首要任务是( )。
A. 构建新发展格局
B. 高质量发展
C. 建设现代化经济体系
D. 推进新型工业化
答案：B

16．2012年11月29日，习近平在参观《复兴之路》展览时首次提出中国梦，并引用三句诗诠释了近代以来中国人民寻梦、追梦、圆梦的历史进程。中华民族的明天，“（ ）”。
A. 人间正道是沧桑
B. 雄关漫道真如铁
C. 敢叫日月换新天
D. 长风破浪会有时
答案：D

17. 中国梦归根到底是（ ），必须紧紧依靠人民来实现，必须不断为人民造福。
A. 国家的梦
B. 人民的梦
C. 民族的梦
D. 世界的梦
答案：B

18. 中华民族伟大复兴的中国梦是（ ）相统一的梦。
A. 国家情怀、民族情怀、人民情怀
B. 国家情怀、民族情怀、社会情怀
C. 民族情怀、世界情怀、人民情怀
D. 国家情怀、家庭情怀、人民情怀
答案：A

19. “得其大者可以兼其小。”说的是（ ）。
A. 中国梦是世界梦
B. 每个人都有追逐梦想的机会
C. 个人前途命运与国家和民族前途命运紧密相连
D. 梦想成真必须实干
答案：C

20. 实现中国梦必须走中国道路，这就是（ ）。
A. 中华民族大团结之路
B. 社会发展之路
C. 人民民主专政之路
D. 中国特色社会主义道路
答案：D

21. 实现中国梦必须凝聚中国力量，这就是（ ）。
A. 各族人民大团结的力量
B. 中国共产党的领导力量
C. 中高速增长的经济力量。
D. 保障有力的军事力量
答案：A

22. （ ）维系着华夏大地上各个民族的团结统一，激励着一代代中华儿女为祖国发展繁荣不懈奋斗。
A. 伟大精神
B. 爱国主义
C. 民族团结
D. 改革创新
答案：B

23. “两个一百年”的奋斗目标中第一个百年目标是（ ）。
A. 建立一个独立的完整的工业体系和国民经济体系
B. 基本实现社会主义现代化
C. 建成更高水平的小康社会
D. 建成社会主义现代化国家
答案：C


24. 综合分析国际国内形势和我国发展条件，党的十九大提出我们要全面建成小康社会，实现第一个百年奋斗目标，然后再乘势而上开启（ ）新征程。
A. 全面建成小康社会
B. 全面建设社会主义现代化国家
C. 基本实现社会主义现代化
D. 中国特色社会主义事业
答案:B

25. 全面建设社会主义现代化国家进程中的第一个阶段，从2020年到2035年，（ ）。
A. 把我国建设成富强民主文明和谐美丽的社会主义现代化强国
B. 实现中华民族伟大复兴的中国梦
C. 全面建成小康社会
D. 基本实现社会主义现代化
答案：D

26. 改革开放之后，我们党提出的“三步走”战略的第三步，即基本实现现代化，将提前（ ）年完成。
A. 12年
B. 15年
C. 18年
D. 30年
答案：B

27. 从全面建设社会主义现代化国家进程的阶段安排看来，到2035年，我国将（ ）。
A. 全面建成小康社会
B. 实现中华民族伟大复兴的中国梦
C. 把我国建设成为富强美丽文明和谐的社会现代化强国。
D. 基本实现社会主义现代化
答案：D

28. 实现社会主义现代化和中华民族伟大复兴，在全面建成小康社会的基础上，分两步走在本世纪中叶建成富强民主文明和谐美丽的社会主义现代化强国。这是（ ）。
A. 坚持和发展中国特色社会主义的总依据
B. 坚持和发展中国特色社会主义的总布局
C. 坚持和发展中国特色社会主义的总任务
D. 坚持和发展中国特色社会主义的总安排
答案：C

29. 把握历史新方位，顺应时代新特点，党的十九大提出分（ ）实现全面建成社会主义现代化强国的战略安排。

A. 两个阶段
B. 三个阶段
C. 四个阶段
D. 五个阶段
答案：A

30. （ ）首次把“小康”作为经济建设总的奋斗目标
A. 党的十七大
B. 党的十五大
C. 党的十二大
D. 党的十一届三中全会
答案：C

31. 党的十九大提出，到（ ）“各方面制度更加完善，国家治理体系和治理能力现代化基本实现”。

A. 2035年
B. 2030年
C. 2025年
D. 2020年
答案：A

32. 习近平指出：“全面建设社会主义现代化国家、基本实现社会主义现代化，既是（ ）我国发展的要求，也是我国社会主义从初级阶段向更高阶段迈进的要求。

A. 社会主义初级阶段
B. 社会主义历史时期
C. 社会主义新时代
D. 社会主义实践探索
答案：A

33. （ ）作出“全面建成小康社会胜利在望”的重要判断，将“全面建成小康社会”目标提升为“全面建设社会主义现代化国家”，确立全面建设社会主义现代化国家在“四个全面”战略布局中的引领地位。

A. 党的十九届三中全会
B. 党的十九届四中全会
C. 党的十九届五中全会
D. 党的十九届六中全会
答案：C

34. 2021年7月1日，习近平在天安门城楼上庄严宣告，经过全党全国各族人民持续奋斗，我们实现了（ ）。

A. 第一个百年奋斗目标
B. 社会主义现代化国家
C. 社会主义现代化强国
D. 中华民族伟大复兴
答案：A

35. （ ），是全面建成小康社会的底线任务。

A. 增加城乡居民收入
B. 打赢脱贫攻坚战
C. 提升国内生产总值
D. 增加城乡居民人均收入
答案：B

36. 中国共产党的领导是中国特色社会主义最本质的特征，这是( )以来习近平提出的一个重要论断。
A. 十八大
B. 十五大
C. 十九大
D. 十七大
答案：A

37. 面对新时代新挑战新要求，( )就是战胜艰难险阻，不断取得胜利的制胜法宝。
A. 改进完善党的领导
B. 坚持和加强党的领导
C. 全面推进党的改革
D. 增加党员人数
答案：B

38. ( )是中国特色社会主义最本质的特征。
A. 以经济建设为中心
B. 以人为本
C. “五位一体总体布局”
D. 中国共产党的领导
答案：D

39. 《中国共产党党章》明确规定，中国共产党是中国工人阶级的先锋队，同时是( )。
A. 中国人民的先锋队
B. 中华民族的先锋队
C. 中国人民和中华民族的先锋队
D. 中国新阶层的先锋队
答案：C

40. ( )会议将党的领导制度明确为我国根本领导制度。
A. 十九大
B. 十九届三中全会
C. 十九届四中全会
D. 十九届五中全会
答案：C

41. 中国共产党坚持全心全意为人民服务的宗旨，是坚持( )的根本要求。
A. 立党为公、执政为民
B. 保持先进性、纯洁性
C. 中国特色社会主义道路
D. 马克思主义唯物史观
答案：D

42. 政党是有阶级性的，中国共产党是( )的政党。
A. 中国工人阶级
B. 中国农民阶级
C. 广大人民群众
D. 中国社会新兴阶层
答案：A

43. 历史和现实证明，( )就没有中国特色社会主义的产生与发展。
A. 没有中国共产党的指导
B. 没有中国共产党的组织
C. 没有中国共产党的领导
D. 没有中国共产党的监督
答案：C

44. ( )是我国的根本领导制度，居于统领地位。
A. 党的组织原则
B. 党的政治原则
C. 党的领导制度
D. 党的性质宗旨
答案:C

45. 中国共产党的性质决定了党的宗旨是( )。
A. 立党为公、执政为民
B. 以人为本、执政为民
C. 全心全意为人民服务
D. 为实现共产主义而奋斗
答案：C

46. 坚持党总揽全局、协调各方的领导核心地位，( )形象地说，这就像“众星捧月”，这个“月”就是中国共产党。
A. 习近平
B. 邓小平
C. 毛泽东
D. 江泽民
答案：A

47. 中国共产党作为马克思主义政党，其最大的政治优势是( )。
A. 一切从实际出发
B. 理论联系实际
C. 密切联系群众
D. 批评与自我批评
答案:C

48. 党的任何组织和成员必须以实际行动维护党中央的权威，必须服从党中央集中统一领导，这是党的领导的( )。
A. 前提基础
B. 必然选择
C. 最高原则
D. 最终目标
答案：C

49. ( )就是要始终坚持、切实加强党的领导，特别是党中央的集中统一领导
A. 政治意识
B. 大局意识
C. 核心意识
D. 看齐意识
答案：C

50. 我们既不走封闭僵化的老路，也不走改旗易帜的邪路，要坚定不移走( )。
A. 中国特色社会主义道路
B. 经济社会发展道路
C. 人民民主专政的道路
D. 文化强国之路
答案：A

51. ( ) 是历史的创造者。
A. 中国共产党
B. 人民
C. 英雄人物
D. 先进分子
答案：B

52. ( ) 是创造历史的动力。
A. 人民
B. 中国共产党党
C. 英雄人物
D. 先进分子
答案：A

53. ( ) 是历史的主体。
A. 英雄人物
B. 先进分子
C. 人民
D. 中国共产党
答案：C

54. ( ) 是决定党和国家前途命运的根本力量。
A. 人民
B. 资产阶级
C. 无产阶级
D. 先进分子
答案：A

55. 中国共产党的根本政治立场是 ( ) 。
A. 执政为民
B. 立党为公
C. 人民立场
D. 群众路线
答案：C

56. 党的生命线和根本工作路线是 ( ) 。
A. 实事求是
B. 群众路线
C. 执政为民
D. 一切为了群众
答案：B

57. ( ) 是我们党的生命之根、执政之基、力量之源。
A. 文化
B. 实践
C. 人民
D. 群众
答案：C

58. ( ) 是最好的教科书。
A. 实践
B. 人民
C. 矛盾
D. 历史
答案：D

59. 党的根本宗旨是 ( ) 。
A. 全心全意为人民服务
B. 实现人民幸福
C. 实现社会稳定
D. 实现国家富强
答案：A

60. 中国共产党的初心是 ( ) 。
A. 全心全意为人民服务
B. 为中国人民谋幸福
C. 实现国家富强
D. 实现民族独立
答案：B

61．党自成立之日起，就把“人民”二字铭刻在心，把坚持 ( ) 高于一切鲜明地写在自己的旗帜上。
A. 人民性
B. 人民利益
C. 群众路线
D. 党的性质
答案：B

62. 中国特色社会主义的价值目标是 ( ) 。
A. 人的全面发展
B. 文化繁荣
C. 社会和谐发展
D. 构建人类命运共同体
答案：A

63. 社会主义最大的优越性是 ( ) 。
A. 生产力充分发展
B. 生产关系极大改善
C. 共同富裕
D. 人与自然和谐共处
答案：C

64. 中国特色社会主义的本质要求是 ( ) 。
A. 共同富裕
B. 解放生产力
C. 发展生产力
D. 消灭剥削
答案：A

65. 为人民谋幸福的着力点是 ( ) 。
A. 实现人民美好生活
B. 促进全体人民共同富裕
C. 提高居民收入
D. 实现高质量发展
答案：B

66. 要坚持在发展中保障和改善民生，把 ( ) 放在首位。
A. 改革开放
B. 推动高质量发展
C. 实现共同富裕
D. 稳定就业
答案：B

67. 促进共同富裕的重点帮扶保障人群是 ( ) 。
A. 残障人士
B. 失业群体
C. 贫困群体
D. 低收入群体
答案：D

68. 党依靠 ( ) 创造历史伟业。
A. 无产阶级
B. 资产阶级
C. 人民
D. 小资产阶级
答案：C

69. ( ) 是真正的英雄。

A. 中国共产党
B. 革命人士
C. 军人
D. 人民
答案：D

70. 我们乘势而上开启全面建设社会主义现代化国家新征程、向第二个百年奋斗目标进军，这标志着我国进入了一个 ( ) 。
A. 新发展时期
B. 新发展方位
C. 新发展阶段
D. 新发展格局
答案：C

71. 要发挥分配的功能和作用。要处理好 ( ) 关系，构建初次分配、再分配、三次分配协调配套的基础性制度安排。
A. 效率和公平
B. 发展和稳定
C. 自由和平等
D. 多数和少数
答案：A

72. ( ) 是发展行动的先导。
A. 发展理念
B. 发展格局
C. 发展方向
D. 发展策略
答案：A

73. ( ) 的发展理念，相互贯通、相互促进，是具有内在联系的集合体，要统一贯彻，不能顾此失彼，也不能相互替代。
A. 改革、和谐、绿色、开放、共享
B. 创新、协调、和谐、开放、共赢
C. 创新、和谐、绿色、开放、发展
D. 创新、协调、绿色、开放、共享
答案：D

74. 加快构建……的 ( ) ……这是把握未来发展主动权的战略性布局和先手棋，是新发展阶段要着力推动完成的重大历史任务，也是贯彻新发展理念的重大举措。
A. 新发展理念
B. 新发展格局
C. 新发展阶段
D. 新发展时期
答案：B

75. ( ) 是党治国理政的中心工作。
A. 文化工作
B. 政治工作
C. 外交工作
D. 经济工作
答案：D

76. 推进供给侧结构性改革，关键在于理解 ( ) 。
A. 供给性
B. 倾向性
C. 结构性
D. 周期性
答案：C

77. 现代化经济体系必须坚持质量第一、 ( ) 优先。
A. 利益
B. 速度
C. 人才
D. 效益
答案：D

78. ( ) 是化解我国经济发展面临困难和矛盾的重大举措。
A. 供给侧结构性改革
B. 健全民主法制
C. 社会公平正义
D. 人民主体地位
答案：A

79. 建设充分发挥 ( ) ，更好发挥政府作用的经济体制。
A. 市场作用
B. 服务业动能
C. 社会作用
D. 社会福利补给
答案：A

80. 经济改革的方向是要让 ( ) 在资源配置中发挥决定性作用。
A. 科技
B. 创新
C. 政府
D. 市场
答案：D

81. 经济进入新常态后，伴随着经济增长速度的下降，推动 ( ) 成为经济生活中的主旋律。
A. 供给侧改革
B. 产业结构升级
C. 建设社会主义市场经济体制
D. 建设现代化经济体系
答案：A

82. 建设彰显优势、协调联动的 ( ) 发展体系。
A. 实体经济
B. 社会进步
C. 城乡区域
D. 社会服务
答案：C

83. 我国经济已由高速增长阶段转向 ( ) ，正处在转变发展方式、优化经济结构、转换增长动力的攻关期。
A. 高质量发展阶段
B. 中高速阶段
C. 低速阶段
D. 高水平发展阶段
答案：A

84. 国有企业是中国特色社会主义的重要物质基础和政治基础，关系 ( ) 地位的巩固，关系我们党的执政地位和执政能力，关系我国社会主义制度。
A. 人民主体
B. 公有制主体
C. 经济体制主体
D. 社会发展主体
答案：B

85. 经过 ( ) 个五年规划(计划)，我们已经为实现建设社会主义现代化国家的目标奠定了坚实基础。
A. 12
B. 13
C. 14
D. 15
答案：B

86. 十八大以来，我们党对经济社会发展提出了许多重大理论和理念，其中 ( ) 是最重要、最主要的。
A. 以人民为中心思想
B. 人类命运共同体理念
C. 新发展理念
D. 总体国家安全观
答案：C

87. ( ) 年前二氧化碳排放达到峰值，()年前实现碳中和.
A. 2025 2050
B. 2025 2060
C. 2030 2050
D. 2030 2060
答案：D

88. 加快构建以 ( ) 为主体、国内国际双循环相互促进的新发展格局……这是把握未来发展主动权的战略性布局和先手棋，是新发展阶段要着力推动完成的重大历史任务，也是贯彻新发展理念的重大举措。
A. 国内大循环
B. 国际大循环
C. 市场大循环
D. 资本大循环
答案：A

89. 巩固“ ( ) ”成果，推动更多产能过剩行业加快出清，降低全社会各类营商成本，加大基础设施等领域补短板力度。
A. 三去一降一补
B. 三降一去一补
C. 三补一去一降
D. 一去一降一补
答案：A

90. 党的 ( ) 开启了改革开放和社会主义现代化建设历史新时期。
A. 十二大
B. 十一届三中全会
C. 十一届四中全会
D. 十二届三中全会
答案：B

91. 党的 ( ) 开启了全面深化改革、系统整体设计推进改革的新时代。
A. 十八届三中全会
B. 党的十八大
C. 党的十九大
D. 党的十九届三中全会
答案：A

92. 决定当代中国前途命运的关键一招是 ( ) 。
A. 改革
B. 全面改革
C. 开放
D. 改革开放
答案：D

93( ) 是当代中国发展进步的活力之源。
A. 改革
B. 全面改革
C. 开放
D. 改革开放
答案：D
94. ( ) 是坚持和发展中国特色社会主义的必由之路。
A. 改革
B. 全面改革
C. 开放
D. 改革开放
答案：D

95. 改革开放是我们党的一次 ( ) 。
A. 伟大变革
B. 伟大觉醒
C. 伟大进步
D. 伟大创造
答案：B

96. ( ) 走出了中华民族伟大复兴的正确道路。
A. 改革开放
B. 全面深化改革
C. 全面依法治国
D. 改革
答案：A

97. ( ) 是实现“两个一百年”奋斗目标、实现中华民族伟大复兴的关键一招。
A. 改革开放
B. 建立新中国
C. 全面依法治国
D. 社会主义改造
答案：A

98. 我国经济总量跃居世界第 ( ) 。
A. 一
B. 二
C. 三
D. 四
答案：B

99. 近年来，我国对世界经济增长贡献率超过 ( ) 。
A. 10%
B. 20%
C. 30%
D. 40%
答案：C

100. ( ) 是当代中国最壮丽的气象。
A. 改革开放
B. 脱贫攻坚
C. 共同富裕
D. 乡村振兴
答案：A

101. 市场在资源配置中起 ( ) 作用。
A. 基础性
B. 决定性
C. 主导性
D. 控制性
答案：B

102. 新时代坚持和发展中国特色社会主义，根本动力仍然是 ( ) 。
A. 改革
B. 开放
C. 改革开放
D. 全面深化改革
答案：D

103. 我国的治理体系和治理能力现代化以 ( ) 为中心。
A. 资本
B. 人民
C. 市场
D. 政府
答案：B

104. 我国的治理体系和治理能力现代化是建立在 ( ) 基础之上的。
A. 中国特色社会主义制度
B. 资本主义制度
C. 科学社会主义
D. 社会主义制度
答案：A

105．全面深化改革的根本方向就是走 ( ) 。
A. 共产主义道路
B. 中国特色社会主义道路
C. 社会主义道路
D. 资本主义道路
答案：B

106. 全面深化改革取得成功的关键是 ( ) 。
A. 国家治理体系的完善
B. 国家治理能力的提高
C. 党的集中统一领导
D. 法律制度的完善
答案：C

107. 我们党的一个伟大创举，就是在社会主义条件下发展 ( ) 。
A. 计划经济
B. 资本
C. 资本经济
D. 市场经济
答案：D

108. 深化生态文明体制改革，要紧紧围绕建设 ( ) 中国。
A. 富强
B. 民主
C. 和谐
D. 美丽
答案：D

109. ( ) 对坚持和完善中国特色社会主义制度、推进国家治理体系和治理能力现代化作出总体擘画。
A. 十八届三中全会
B. 十八届四中全会
C. 十九届三中全会
D. 十九届四中全会
答案：D

110. 社会主义民主的实质是( )。
A. 民主集中制
B. 人民当家作主
C. 人民代表大会制度
D. 中华民族大团结
答案：D

111. 一个国家是不是民主，应该由这个国家的()来评判，而不应该由外部少数人指手画脚来评判。
A. 人民
B. 执政党
C. 社会团体
D. 国家性质
答案：A

112. ()是社会主义的生命，没有民主就没有社会主义，就没有社会主义的现代化，就没有中华民族伟大复兴。
A. 人民民主
B. 人民当家作主
C. 以人民为中心
D. 坚持人民的主体地位
答案：A

113. 全过程人民民主首次提出是在()
A. 2019年7月
B. 2019年11月
C. 2021年3月
D. 2021年7月
答案：B

114. ()是中国发展全过程人民民主的根本保证。
A. 人民当家作主
B. 中国特色社会主义制度
C. 人民民主专政
D. 中国共产党的领导
答案：C

115．()是统治阶级用来实现其阶级利益的政治形式和手段。
A. 民主
B. 制度
C. 体制
D. 监督
答案：A

116. 中华民族要实现伟大复兴中国梦，不仅要创造高度的物质文明、精神文明、社会文明、生态文明，而且要建设高度的()。
A. 制度文明
B. 政治文明
C. 工业文明
D. 历史文明
答案：B

117. 全面阐释深刻全过程人民民主内涵的时间是()
A. 2021年10月
B. 2021年11月
C. 2022年1月
D. 2022年3月
答案：A

118. ()是指民主的制度安排，实质民主是指民主始终追求的价值目标，二者有机结合。
A. 程序民主
B. 协商民主
C. 人民民主
D. 全过程人民民主
答案：A

119. 国家治理高效在于，始终把()利益放在第一位。
A. 中国共产党
B. 社会团体
C. 人民民主
D. 中国人民
答案：D

120. 坚持走中国特色社会主义政治发展道路，全面发展( )，社会主义民主政治制度化、规范化、程序化全面推进。
A. 全过程人民民主
B. 人民民主
C. 民主
D. 大众民主
答案：A

121. 要健全( )制度体系，扩大人民有序政治参与，保证人民依法实行民主选举、民主协商、民主决策、民主管理、民主监督。
A. 依法治国
B. 人民当家作主
C. 社会治理
D. 深化改革
答案：B

122. 坚持和完善中国共产党领导的多党合作和政治协商制度，完善( )和委员联系界别群众制度机制。
A. 依法治国
B. 人民当家作主
C. 人民政协民主监督
D. 人民代表
答案：C

123. 我国根本的政治制度是( )。
A. 人民代表大会制度
B. 中国共产党领导的多党合作和政治协商制度
C. 民族区域自治制度
D. 基层群众自治制度
答案：A

124. 社会主义民主政治的本质特征是( )。
A. 党的领导
B. 人民当家作主
C. 依法治国
D. 政治体制改革
答案：B

125. ( )是中国社会主义民主政治的特有形式和独特优势，是实现党的领导的重要方式，丰富了民主的形式，拓展了民主的渠道，丰富了民主的内涵。
A. 基层群众自治制度
B. 协商民主
C. 人民民主
D. 民族区域自治
答案：B

126. 社会主义协商民主有利于发挥我国政治制度的优越性，增强中国特色社会主义( )。
A. 道路自信
B. 理论自信
C. 制度自信
D. 文化自信
答案：C

127. 发展社会主义民主政治，最根本的是要( )。
A. 坚持党的领导、人民当家作主和依法治国的统一
B. 实现民主政治的制度化
C. 充分发挥人民群众的监督作用
D. 有领导、有步骤地进行政治体制改革
答案：A

128. ( )是社会主义民主政治中独特的、独有的、独到的民主形式。
A. 协商民主
B. 人民民主
C. 基层民主
D. 统一战线
答案：A

129. 要坚持用( )管权管事管人，抓紧形成不想腐、不能腐、不敢腐的有效机制，让人民监督权力，让权力在阳光下运行，把权力关进制度的笼子里。
A. 制度
B. 法律
C. 机关
D. 政治
答案：A

130. 党领导人民治理国家的基本方式是( )。
A. 党的领导
B. 人民当家作主
C. 依法治国
D. 政治体制改革
答案：C

131. 提高社会治理社会化、法治化、智能化、专业化水平，推进社会治理精细化，打造( )的社会治理格局。
A. 共建共治
B. 共治共享
C. 共建共享
D. 共建共治共享
答案：D

132. 党的十八大以来,党中央提出并形成了全面建成小康社会、全面深化改革、全面依法治国、全面从严治党的目标任务。其中,十八届四中全会提出全面推进( )的总目标和重大任务。
A. 全面依法治国
B. 全面深化改革
C. 全面建成小康社会
D. 全面从严治党
答案：A

133. 十八届四中全会提出，全面推进依法治国，这就是，在中国共产党领导下，坚持中国特色社会主义制度，贯彻中国特色社会主义法治理论，形成完备的法律规范体系、高效的法治实施体系、严密的法治监督体系、有力的法治保障体系，形成完善的党内法规体系，要( )
A. 坚持依法治国、依法执政、依法行政共同推进
B. 坚持依法治国、依法执政、依法治理共同推进
C. 坚持法治国家、法治政府、法治社会一体建设
D. 坚持法制国家、法制政府、法制社会一体建设
答案：C

134. 习近平总书记在党的十八届四中全会第二次全体会议上强调：“历史是最好的老师。经验和教训使我们党深刻认识到，( )是治国理政不可或缺的重要手段。法治兴则国家兴，法治衰则国家乱。”
A. 法治
B. 人治
C. 法治政府
D. 从严治党
答案：A

135. ( )年9月，第一届全国人民代表大会第一次会议在北京召开。大会通过的《中华人民共和国宪法》，以根本大法的形式把中国共产党在过渡时期的总路线作为国家在过渡时期的总任务确定下来，同时也为全国人民指明了今后的前进道路——社会主义道路。
A. 1949
B. 1954
C. 1978
D. 2012
答案：B

136. ( )是经验的总结、规律的反映、社会的共识，是制度之治最基本最稳定最可靠的保障。
A. 德治
B. 人治
C. 法治
D. 治党
答案：C

137. 在历时5年的编纂过程中，( )共完成总则编、物权编、合同编、人格权编、婚姻家庭编、继承编、侵权责任编以及附则共1260条，创下新中国立法史的新纪录。编纂这部法典也是全面推进依法治国、实现国家治理体系和治理能力现代化新征程中的重大举措，解决了党和国家事业发展中的重大民生问题，为实现人民美好生活提供了坚实的法治保障。
A. 《汉谟拉比法典》
B. 《民法典》
C. 《唐律疏议》
D. 《贞观律》
答案：B

138. ( )是坚持和发展中国特色社会主义的本质要求和重要保障，是实现国家治理体系和治理能力现代化的必然要求。我们要实现经济发展、政治清明、文化昌盛、社会公正、生态良好，必须更好发挥法治引领和规范作用。
A. 以德治国
B. 从严治党
C. 法治政府
D. 依法治国
答案：D

139. 保证( )的主体地位，保证人民在依法治国中的主体地位，是中国特色社会主义法治区别于资本主义法治的根本所在。
A. 小团体
B. 精英集团
C. 个别利益集团
D. 人民当家作主
答案：D

140. 全面依法治国，是国家治理领域一场广泛而深刻的( )，是实现国家治理体系和治理能力现代化的必然要求，事关我们党执政兴国，事关人民幸福安康，事关党和国家事业发展。
A. 变化
B. 改革
C. 革命
D. 变革
答案：C

141. 以习近平同志为核心的党中央创造性提出一系列全面依法治国新理念新思想新战略，形成( )，深刻回答了新时代为什么实行全面依法治国、怎样实行全面依法治国等一系列重大问题，指导推动我国社会主义法治建设发生历史性变革、取得历史性成就。
A. 习近平法治思想
B. 习近平军事思想
C. 习近平宣传思想
D. 习近平经济思想
答案：A

142. 全面依法治国重在( )二字。全面依法治国是一个系统工程，要求通过固根基、扬优势、补短板、强弱项，推动各方面制度更加成熟、更加定型，逐步实现国家治理制度化、程序化、规范化、法治化。
A. 全面
B. 依法
C. 以法
D. 治国
答案：A

143. 从“依法治国”到“全面依法治国”的历史发展脉络中，在党的( )提出全面推进依法治国。
A. 十五大
B. 十六大
C. 十七大
D. 十八大
答案：D

144. 建设中国特色社会主义法治体系，要以规范和约束公权力为重点，构建党统一指挥、全面覆盖、权威高效的监督体系，把( )同国家机关监督、民主监督、司法监督、群众监督、舆论监督贯通起来，增强监督合力，强化监督责任，提高监督实效，做到有权必有责、有责要担当、失责必追究。
A. 党内监督
B. 党外监督
C. 全民监督
D. 执法监督
答案：A

145. ( )年3月，成立中央全面依法治国委员会。这是我们党历史上第一次设立这样的机构，极大加强了党对全面依法治国的集中统一领导，有效统筹推进了全面依法治国工作。
A. 2018
B. 2012
C. 2019
D. 2020
答案：A

146. 坚持依法治国首先要坚持( )，坚持依法执政首先要坚持依宪执政。
A. 以宪执政
B. 依宪治国
C. 以德治国
D. 从严治党
答案：B

147. ( )是国家根本法，是党和人民意志的集中体现，是国家各种制度和法律法规的总依据，具有最高的法律地位、法律权威、法律效力，在国家和社会生活中具有总括性、原则性、纲领性、方向性。
A. 法律
B. 宪法
C. 法规
D. 纪律
答案：B

148. ( )是国家根本法，是党和人民意志的集中体现，是国家各种制度和法律法规的总依据，具有最高的法律地位、法律权威、法律效力，在国家和社会生活中具有总括性、原则性、纲领性、方向性。
A. 法律
B. 宪法
C. 法规
D. 纪律
答案：B

149. 全面建设社会主义现代化国家，必须坚持中国特色社会主义文化发展道路，增强文化自信，围绕 ( ) 、聚民心、育新人、兴文化、展形象建设社会主义文化强国。
A. 举旗帜
B. 把方向
C. 定战略
D. 谋长远
答案：A
150. 我们要坚持 ( ) 在意识形态领域指导地位的根本制度。
A. 党的领导
B. 中国特色社会主义制度
C. 马克思主义
D. 以人为本
答案：C

151. 牢牢掌握党对意识形态工作 ( ) ，全面落实意识形态工作责任制，巩固壮大奋进新时代的主流思想舆论。
A. 指导权
B. 领导权
C. 统领权
D. 引领力
答案：B

152. 弘扬以伟大建党精神为源头的中国共产党人精神谱系，用好红色资源，深入开展社会主义核心价值观宣传教育，深化 ( ) 、集体主义、社会主义教育，着力培养担当民族复兴大任的时代新人。
A. 国家主义
B. 民主主义
C. 个体主义
D. 爱国主义
答案：D

153. 坚持以 ( ) 为中心的创作导向，推出更多增强人民精神力量的优秀作品，培育造就大批德艺双馨的文学艺术家和规模宏大的文化文艺人才队伍。
A. 人民
B. 公民
C. 群众
D. 人民群众
答案：A

154. 坚守中华文化立场，提炼展示中华文明的精神标识和文化精髓，加快构建中国话语和中国叙事体系，讲好中国故事、传播好中国声音，展现 ( ) 的中国形象。
A. 可爱、可信、可敬
B. 可信、可爱、可敬
C. 可爱、可敬、可信
D. 可信、可敬、可爱
答案：B

155. 建设社会主义精神文明，发展中国特色社会主义文化，是社会主义现代化建设的重要内容和重要保证。那么我国社会主义精神文明建设的根本任务是 ( ) 。
A. 加强思想道德建设
B. 培育“四有”公民
C. 加强民主法制建设
D. 加强教育科学文化建设
答案：B

156. 奉行全盘西化的观点之所以不能产生中国先进文化，是因为 ( ) 。
A. 没有把握西方文化的思想内核
B. 全面否定了中华传统文化的精髓
C. 割裂了传统和现代的关系
D. 颠倒了中西文化的关系
答案：B

157. 推动社会主义文化大发展大繁荣的根本要求和根本保证是 ( ) 。
A. 坚持先进文化的前进方向
B. 提倡文化多样化
C. 建设社会主义核心价值体系
D. 坚持马克思主义的指导
答案：A

158. 历史和现实告诉我们:坚持什么样的文化方向，推动什么样的文化建设，是一个政党在思想上精神上的一面旗帜。在当代中国，中国共产党引领文化前进方向的旗帜，就是 ( ) 。
A. 中国特色社会主义伟大旗帜
B. 中国特色社会主义理论体系
C. 建设社会主义核心价值体系
D. 坚持马克思主义的指导
答案：A

159. 文化资源是一种特殊的 ( ) 。
A. 战略资源
B. 重要资源
C. 传承资源
D. 保护资源
答案：A

160. 习近平总书记指出，为坚定文化自信，彰显中华优秀传统文化的持久影响力、革命文化的感召力，要结合国土空间规划，坚持 ( ) ，对各类文物本体及环境实施严格保护和管控。
A. 传承第一、保护优先
B. 保护第一、传承优先
C. 开发第一、治理优先
D. 管理第一、开发优先
答案：B
161. 中国特色社会主义文化建设的根本目标是培育“四有”公民。“四有”作为一个有机统一的整体，它的目标是( )，条件是 ( ) 。
A. 道德　纪律
B. 理想　道德
C. 文化　纪律
D. 理想　文化
答案：D

162. 社会主义精神文明建设的主要内容是 ( ) 。
A. 培育有理想、有道德、有文化、有纪律的新人
B. 坚持为人民服务、为社会主义服务的方向和百花齐放、百家争鸣的方针
C. 进行思想道德建设和教育科学文化建设
D. 继承和发扬优秀民族文化传统和吸收各国优秀的思想文化成果
答案：C

163. 依法治国和以德治国有什么不同 ( ) 。
A. 在国家治理中的地位不一样
B. 社会意识的形式不同
C. .治理国家的效果不一样
D. 国家治理的方式不同
答案：D

164. 在5000多年文明发展中孕育的中华优秀传统文化，在党和人民伟大斗争中孕育的 ( ) 和社会主义先进文化，积淀着中华民族最深层的精神追求，代表着中华民族独特的精神标识。
A. 革命文化
B. 岭南文化
C. 潮流文化
D. 民族文化
答案：A

165. 社会主义道德的集中体现是 ( ) 。
A. 诚实守信
B. 为人民服务　　
C. 拾金不昧
D. 爱国主义
答案：B

166. 发展社会主义文化必须坚持的方向是 ( ) 。
A. 为人民服务，为社会主义服务
B. 为精神文明建设服务，为物质文明建设服务
C. 为党的工作服务，为经济发展服务
D. 为政治稳定服务，为经济发展服务
答案：A

167. 促进人的全面发展是 ( ) 。
A. .社会主义的本质要求
B. .中国特色社会主义的本质要求
C. .社会主义初级阶段建设与发展的根本要求
D. .建设社会主义精神文明的根本要求
答案：B

168. 推进人的全面发展同推进经济、文化的发展之间的关系是 ( ) 。
A. 二者相互矛盾不可兼得　
B. 二者互为前提和基础
C. 前者取决于后者
D. 后者取决于前者
答案：B

169. 党和政府应加强和创新对建设社会主义和谐社会各项工作的领导，把( )作为社会建设的根本任务，让全体人民在共建共治共享发展中有更多获得感、幸福感和安全感。
A. 改善民生
B. 创新社会治理
C. 坚持总体国家安全观
D. 推进平安中国建设
答案：A

170. 提高社会治理社会化、法治化、智能化、专业化水平，推进社会治理精细化，打造( )的社会治理格局。
A. 共建共治
B. 共治共享
C. 共建共享
D. 共建共治共享
答案：A

171. 人民群众对于日益增长的“物质文化需要”层次更高、内容范围更广，出现了阶段性的新特征，主要体现在( )。
A. 人民健康状况显著改善，居民平均预期寿命高于世界平均水平
B. 人民在民主、法治、公平、正义、安全、环境等方面的要求日益增长
C. 不同地区发展水平仍然差距较大，收入分配差距仍然较大，还有几千万人口尚未脱贫
D. 人民生活水平不断迈上了新台阶，达到了中等偏上收入国家水平
答案：B

172. 我国社会主要矛盾已经转化为人民日益增长的美好生活需要和不平衡不充分的发展之间的矛盾，其转变的主要依据不包括( )。
A. 人民生活水平显著提高，对美好生活的向往更加强烈
B. 经过改革开放40多年的发展，我国社会生产力水平总体上显著提高，很多方面进入世界前列
C. 我国处于社会主义初级阶段的基本国情没有变
D. 影响满足人们美好生活需要的因素很多，但主要是发展的不平衡不充分问题
答案：C

173. 做好经济社会发展工作，( )是“指南针”， 抓民生也是抓发展，既能有效解决群众后顾之忧，调动人们发展生产的积极性，又可以增进社会消费预期，扩大内需，催生新的经济增长点，为经济发展、转型升级提供强大内生动力。
A. 民生
B. 法治
C. 政治
D. 制度
答案：A

174. ( )是发展的根本目的。中国共产党自成立之日起，就始终把为中国人民谋幸福、为中华民族谋复兴作为自己的初心使命。从中国共产党的百年奋斗历史来看，让老百姓过上好日子是党一切工作的出发点和落脚点。
A. 增进民生福祉
B. GDP的增长
C. 政治制度完善
D. 社会进步发展
答案：A

175. 习近平在博鳌亚洲论坛2022年年会开幕式上的主旨演讲：“要坚持以人民为中心，把促进发展、保障民生置于突出位置，实施政策、采取措施、开展行动都要把是否( )放在第一位。”
A. GDP的增长
B. 有利于民生福祉
C. 政治制度完善
D. 社会进步发展
答案：B

176. 国家自( )年起建立城乡居民大病保险制度，从城乡居民基本医保基金中划出一定比例或额度作为大病保险资金，对经城镇居民医保、新农合补偿后需个人负担的高额医疗费用给予保障，至2015年底，城乡居民大病保险会覆盖所有参加城镇居民基本医疗保险和新型农村合作医疗的参保人员。
A. 2012
B. 2013
C. 2014
D. 2015
答案：A

177. 党的( )以来，9899万农村贫困人口全部脱贫，832个贫困县全部摘帽，12.8万个贫困村全部出列，区域性整体贫困得到解决，完成了消除绝对贫困的艰巨任务。
A. 十七大
B. 十八大
C. 十九大
D. 二十大
答案：B

178. 党的十八大以来，以习近平同志为核心的党中央深入研究社会管理面临的新形势新任务新特点，着力推进社会管理理念创新、实践创新、制度创新，明确提出( )这一重大命题。这是党的执政理念和政策思路在社会领域的一次全面提升，反映的是党对社会运行规律和治理规律认识的深化。
A. 社会治理
B. 从严治党
C. 基层治理
D. 重视民生
答案：A

179. ( )是国家治理的基石，统筹推进乡镇(街道)和城乡社区治理，是实现国家治理体系和治理能力现代化的基础工程。
A. 社会治理
B. 从严治党
C. 基层治理
D. 重视民生
答案：C

180. 坚持党组织领导基层群众性自治组织的制度，把抓基层、打基础作为长远之计和固本之举，把基层党组织建设成为领导基层治理的坚强战斗堡垒，坚持( )带群建，更好履行组织、宣传、凝聚、服务群众职责。
A. 党建
B. 治理
C. 法治
D. 德治
答案：C

181. 加强以民生为重点的社会建设，完善( )，大力开展邻里互助服务和互动交流活动，更好满足群众需求。
A. 基层社区治理制度
B. 基层志愿服务制度
C. 法律体系
D. 思想道德体系
答案：B

182. 大自然是人类赖以生存发展的基本条件。尊重自然、顺应自然、保护自然，是全面建设社会主义现代化国家的 ( ) 。
A. 内在要求
B. 外在要求
C. 客观要求
D. 主观要求
答案：A

183. 实施 ( ) ，推进各类资源节约集约利用，加快构建废弃物循环利用体系。
A. 全面发展战略
B. 全面节约战略
C. 全面优化战略
D. 全面创新战略
答案：B

184. 推行草原森林河流湖泊湿地休养生息，实施好长江 ( ) 禁渔，健全耕地休耕轮作制度。
A. 10年
B. 5年
C. 3年
D. 2年
答案：A

185. 立足我国能源资源禀赋，坚持先立后破，有计划分步骤实施 ( ) 。
A. 节能计划
B. 发展计划
C. 碳达峰行动
D. 资源分类计划
答案：C

186. 我国植树节是从哪一年开始的? ( )
A. 1979年
B. 1980年
C. 1981年
D. 1982年
答案：A

187. 中国是负责任的发展中大国，是全球气候治理的积极参与者。中国已经向世界承诺将于 ( ) 年左右使二氧化碳排放达到峰值，并争取尽早实现。
A. 2030年
B. 2035年
C. 2040年
D. 2045年
答案：A

188. ( ) 是习近平生态文明思想“八八战略”践行地，“绿水青山就是金山银山”科学论断发源地。
A. 江苏
B. 广东
C. 浙江
D. 福建
答案：C

189. 生态文明建设事关中华民族永续发展和 ( ) 奋斗目标的实现。
A. 一百年
B. 两个一百年
C. 三个一百年
D. 四个一百年
答案：B

190. 良好生态环境是雄安新区的重要价值体现， ( ) 是雄安新区建设的一个新理念。
A. 先植绿、后建城
B. 先规划、后建城
C. 先设计、后实施
D. 先植绿、后实施
答案：A

191. 2019年4月8日，习近平参加首都义务植树活动时强调，中华民族自古就有 ( ) 的好传统。
A. 种花、种草、种树
B. 爱树、植树、护树
C. 爱花、种草、植树
D. 添绿、添色、添景
答案：B

192. 生态兴则文明兴， ( ) 。
A. 生态亡则文明亡
B. 生态衰则文明衰
C. 生态旺则文明旺
D. 生态昌则文明昌
答案：B

193. “绿水青山”既是自然财富、生态财富又是 ( ) 。
A. 社会财富、经济财富
B. 人类财富、经济财富
C. 社会财富、世界财富
D. 全民财富、共享财富
答案：A

194. 建设生态文明是中华民族永续发展的千年大计，其核心是正确处理 ( ) 的关系来协调当代人的发展与后代人的发展之间关系。
A. 人与生态
B. 人与自然
C. 人与环境
D. 人与文明
答案：B

195. 习近平生态文明思想实现了生态文明建设与坚持中国特色社会主义的 ( ) 。
A. 完美融合
B. 有机统一
C. 统一
D. 持续发展
答案：B

196. 生态文明建设是一场涉及生产方式、生活方式和 ( ) 的革命，关系到人民的福祉和民族的未来。
A. 生活质量
B. 生存形态
C. 价值体现
D. 价值观念
答案：D

197. ( ) 的核心是正确处理经济发展与环境保护的关系。
A. 低碳发展
B. 绿色发展
C. 循环发展
D. 生态发展
答案：B

198. 纵观世界发展史，保护生态环境就是保护 ( ) ，改善生态环境就是发展生产力。
A. 人类
B. 地球
C. 生产力
D. 自己
答案：C

199. ( ) 是最公平的公共产品，是最普惠的民生福祉。
A. 良好生态环境
B. 最低工资标准
C. 绿色生态环境
D. 优美生态环境
答案：A

200. 可持续发展的内容不包括 ( ) 。
A. 经济与文化可持续发展
B. 资源与环境可持续发展
C. 资源与经济可持续发展
D. 资源与社会可持续发展
答案：A

201. 建设生态文明的核心是 ( ) 。
A. 人与自然和谐相处
B. 发展
C. 改变消费模式
D. 经济增长
答案：A

202. 建设一支听党指挥、能打胜仗、作风优良的人民军队，是党在新时代的 ( ) 。
A. 强军目标
B. 强军规划
C. 强军之要
D. 强军之策
答案：A

203. 人民军队的建军之本、强军之魂是 ( ) 。
A. 政治建军、改革强军、科技兴军、依法治军
B. 全民提高军队革命化现代化正规化水平
C. 坚持党对军队的绝对领导
D. 推进军民深度融合
答案：C

204. ( ) 是建设世界一流军队的力量基础。
A. 军民融合
B. 提高军队战斗力
C. 推进练兵备战
D. 构建中国特色现代化军事力量体系
答案：D

205. 我国力争到 ( ) 基本实现国防和军队现代化。
A. 2020年
B. 2035年
C. 本世纪中叶
D. 建党一百周年
答案：B

206. 党对军队的绝对领导是中国特色社会主义的 ( ) 。
A. 本质特征
B. 根本要求
C. 绝对属性
D. 鲜明优势
答案：A

207. 党对军队的绝对领导是中国特色社会主义的 ( ) 。
A. 本质特征
B. 根本要求
C. 绝对属性
D. 鲜明优势
答案：C

208. 党对军队的绝对领导发端于 ( ) 。
A. 秋收起义
B. 广州起义
C. 云南起义
D. 南昌起义
答案：D

209. 中央军委实行 ( ) 制。
A. 政治委员
B. 分工负责
C. 集体负责
D. 主席负责
答案：D

210. 习近平强军思想深刻回答的时代课题是 ( ) 。
A. 建设一支什么样的军队，怎样建设军队
B. 建设一支多么强大的军队，怎样强大军队
C. 新时代建设一支什么样的强大军队、怎样强大军队
D. 新时代建设一支什么样的强大人民军队、怎样建设强大人民军队
答案：D

211. 2022年3月29日，经中央军委主席习近平批准，在中国人民解放军建军95周年之际，中央军委将评选颁授 ( ) 。这是军队最高荣誉，授予在维护国家主权、安全、发展利益，推进国防和军队现代化建设中，作出巨大贡献，建立卓越功勋，在全国、全军有深远影响的军队人员。
A. “八一勋章”
B. “最美军人勋章”
C. “时代楷模勋章”
D. “共和国勋章"
答案：A

212. 国家安全委员会是在 ( ) 提出设立的？
A. 十八大
B. 十八届二中全会
C. 十八届三中全会
D. 十八届四中全会
答案：C

213. 全民国家安全教育日是 ( ) 。
A. 4月15日
B. 4月16日
C. 5月5日
D. 7月1日
答案：A

214. 下列选项中不属于总体国家安全观核心要义中五对关系的是 ( ) 。
A. 既重视发展问题，又重视安全问题
B. 既重视传统安全，又重视非传统安全
C. 既重视自身安全，又重视共同安全
D. 既重视军事安全，又重视社会安全
答案：D

215. 国家安全是安邦定国的重要基石， ( ) 是全国各族人民根本利益所在。
A. 加快经济发展           
B. 维护国家统一
C. 促进国际合作           
D. 维护国家安全
答案：D

216. 国家安全的宗旨是 ( ) 。
A. 人民安全
B. 经济安全
C. 社会安全
D. 文化安全
答案：A

217. 国家安全机关受理公民和组织举报电话为 ( ) 。
A. 12335
B. 12339
C. 12345
D. 12399
答案：B

218. ( ) 政治安全攸关党和国家生死存亡，是国家安全的根本
A. 政治安全
B. 文化安全
C. 经济安全
D. 海外利益安全
答案：A

219. 国家安全的基础是 ( ) 。
A. 人民安全
B. 经济安全
C. 社会安全
D. 文化安全
答案：B

220. 国家政治安全第一个标志性要素是 ( ) 。
A. 领土完整
B. 主权独立
C. 政权稳固
D. 意识形态彰显
答案：B

221. 在防控新冠肺炎疫情中，新纳入国家安全体系的是 ( ) 。
A. 应急体系安全
B. 卫生安全
C. 城市安全
D. 生物安全
答案：D

222. “一国两制”是国家的一项()。
A. 重要政策
B. 重大创新
C. 基本制度
D. 基本国策
答案：D

223．“一国两制”是在统一的国家之内，国家主体实行()制度，个别地区依法实行()制度。
A. 社会主义，资本主义
B. 共产主义，资本主义
C. 民主主义，资本主义
D. 共和，民主
答案：A
224. “一国两制”是为了解决()问题而提出的。
A. 香港
B. 澳门
C. 台湾
D. 统一
答案：C

225．1982年，()首次提出“一国两制”概念。
A. 邓小平
B. 陈云
C. 叶剑英
D. 李先念
答案：A

226. 1997年，我国在“一国两制”原则基础上通过和有关国家协商谈判，成功收回了()。
A. 香港
B. 台湾
C. 澳门
D. 淇澳岛
答案：A

227. 根据“一国两制”原则，特别行政区享有()。
A. 外交权
B. 自主权
C. 驻军权
D. 高度自治权
答案：D

228. 中央政府对特别行政区拥有全面()，这是特别行政区权力源头。
A. 管理权
B. 治理权
C. 管辖权
D. 管治权
答案：D

229. 为维护国家安全稳定，保持香港繁荣稳定，2020年7月3日，香港特别行政区()正式成立，并与7月6日召开首次会议。
A. 国家发展委员会
B. 国防动员委员会
C. 国家安全委员会
D. 国家改革委员会
答案：C

230. 2022年5月8日，()当选香港特别行政区第六人行政长官。
A. 董建华
B. 李家超
C. 梁振英
D. 林郑月娥
答案：B

231. 中央全力支持香港抓住国家发展带来的历史机遇，主动对接“十四五”规划、()大湾区建设和“一带一路”高质量发展等国家战略。
A. 陆港
B. 粤港澳
C. 港澳粤
D. 港澳陆
答案：B

232. 开发建设()深港现代服务业合作区，是习近平总书记亲自谋划、亲自部署、亲自推动的国家改革开放重大举措，对于支持香港经济社会发展、提升粤港澳合作水平、增强香港同胞对祖国的向心力具有重要意义。
A. 深圳
B. 湾区
C. 珠海
D. 前海
答案：D

233. 解决()问题、实现祖国完全统一，是党矢志不渝的历史任务，是全体中华儿女的共同愿望，是实现中华民族伟大复兴的必然要求
A. 领土
B. 统一
C. 安全
D. 台湾
答案：D

234. 两岸关系的基础是()原则。
A. 国家统一
B. 领土完整
C. 一个中国
D. 民族复兴
答案：C

235. 2015年11月7日习近平与时任台湾方面领导人()在新加坡会面，这是自1949年以来两岸领导人首次会晤。
A. 吴伯雄
B. 朱立伦
C. 马英九
D. 连战
答案：C

236. 2016年以来，台湾当局加紧进行“台独”分裂活动，致使两岸关系和平发展势头受到严重冲击。当前，对两岸关系和平发展的最大现实威胁是()。
A. 美国对“台独”势力的支持
B. “台独”势力及其分裂活动
C. 日本对“台独”势力的支持
D. 海外反华势力
答案：B

237. 台湾地区目前人口有()
A. 5000万
B. 8000万
C. 1000万
D. 2300万
答案：D

238. 中国坚定不移走()道路，同时决不会在任何外来干涉的压力面前退缩，决不会容忍国家主权、安全、发展利益受到任何损害。
A. 和平发展
B. 社会主义
C. 自主探索
D. 积极崛起
答案：A

239. 澳门特别行政区现任行政长官是()
A. 何厚华
B. 董建华
C. 贺一诚
D. 崔世安
答案：C

240. 1993年大陆与台湾方面在新加坡举行会谈，此次会谈为确认两岸()推动交流迈出了历史性一步。
A. 实现统一
B. 和平对话
C. 九二共识
D. 和平共处
答案：C

241. 国民党蒋介石集团在()年败退台湾后，两岸陷入分裂状态。
A. 1948
B. 1949
C. 1950
D. 1951
答案：B

242. 当前，()是近代以来国际力量对比中最具革命性的变化。
A. 美国大选
B. 俄乌冲突
C. 英国脱欧
D. 新兴市场国家和发展中国家快速发展
答案：D

243. 世界政治多极化出现的根源是()。
A. 世界经济力量结构的多极化
B. 第三世界力量的发展壮大
C. 美苏的衰落
D. 世界政治力量结构的多极化
答案：A

244. 2021年6月28日，中国国家主席习近平在北京同俄罗斯总统普京举行视频会晤。两国元首发表联合声明，共同宣布《中俄睦邻友好合作条约》延期。成为此次元首会晤的关键词是()。
A. 睦邻友好
B. 世代友好
C. 长期合作
D. 合作竞争
答案：B

245. 哪一对大国关系是当今最为显著的变量？
A. 中俄关系
B. 中欧关系
C. 中美关系
D. 中日关系
答案：C

246. 中国提出解决世界问题的方案是()。
A. 周边共同体
B. 人与自然共同体
C. 人类命运共同体
D. 发展共同体
答案：C

247. 欧盟非常看重中国在哪个领域的作用？
A. 全球治理
B. 经济改革
C. 国际救援
D. 意识形态
答案：A

248. 中国坚持与发展中国家加强团结合作的观念是？
A. 亲诚惠容的外交理念
B. 正确义利观和真实亲诚理念
C. 对话协商、和平共处
D. 坚持多边主义
答案：B

249．新型国际关系“新”在何处？
A. 合作共赢
B. 公平正义
C. 服务发展
D. 外交为民
答案：A

250. 中国参与全球治理的基本理念是？
A. “共商、共建、共享”
B. 竞争与对抗
C. 和平与发展
D. 协调与领导
答案：A

251. 哪一对大国关系已成为新型大国关系的典范？
A. 中美关系
B. 中俄关系
C. 中欧关系
D. 中国与发展中国家的关系
答案：B

252. 二十大报告中指出，中国始终坚持维护()、促进()的外交政策宗旨，致力于推动构建人类命运共同体。
A. 和而不同、绿色发展
B. 世界和平、共同发展
C. 互利共赢、和平发展
D. 和而不同、合作共赢
答案：B

253. “一带一路”不是一个实体和机制，而是合作发展的理念和倡议，是充分依靠中国与有关国家既有的多边机制。借助既有的、行之有效的()平台。
A. 区域合作
B. 文化交流
C. 区域经济
D. 地缘政治
答案：A

254. 2021年11月16日，中国国家主席习近平同美国总统拜登进行视频会晤，两国领导人达成了“两个原则共识”，即()
A. 支持冷战与开展竞争
B. 全面对抗和冲突
C. 中美关系的极端重要性和反对打“新冷战”
D. 全面脱钩与全面竞争
答案：C

255. 2022年11月14日，中国国家主席习近平同美国总统拜登在巴厘岛举行会晤，两国领导人达成了()是中美两国的最基本的共同利益
A. 不冲突、不对抗、和平共处
B. 不对抗、不合作、和平共处
C. 不冲突、不合作、相互竞争
D. 不冲突、不对话、相互竞争
答案：A

256. ()是构建人类命运共同体的重要思想基础。
A. 西方古典文明
B. 人类共同价值
C. 普世价值
D. 奥林匹克精神
答案：B

257．全面推进中国特色大国外交，以周边和大国为重点，以发展中国家为基础，以()为舞台。
A. 单边；
B. 合作；
C. 竞争；
D. 多边
答案：D

258. 中国始终将()置于外交全局的首要位置？
A. 发展中国家
B. 周边国家
C. 美国
D. 欧盟
答案：B

259. 中国秉承()的周边外交理念，积极打造周边命运共同体？
A. 亲诚惠容的外交理念
B. 正确义利观
C. 坚持多边主义
D. 对话协商
答案：A

260. 截至2022年7月，中国与()个国家建立外交关系，中国的“朋友圈”越来越大。
A. 100
B. 80
C. 181
D. 200
答案：C

261. ()是中美关系的“指南针”和“定盘星”，对两国关系发展发挥着不可替代的战略引领作用。
A. 大国外交
B. 元首外交
C. 经济外交
D. 文化外交
答案：B

262. 把党的( )建设摆在首位。
A. 组织
B. 作风
C. 政治
D. 思想
答案：C

263. 增强党组织政治功能和组织功能，把( )建设成为有效实现党的领导的坚强战斗堡垒。
A. 人大
B. 社区
C. 基层政府
D. 基层党组织
答案：D

264. 党的( )就是党的形象，关系人心向背，关系党的生死存亡。
A. 组织
B. 作风
C. 政治
D. 思想
答案：B


265. 加强( )建设是全面从严治党的治本之策。
A. 组织
B. 作风
C. 纪律
D. 思想
答案：C

266. 我们党坚持纪严于法、纪在法前，严在日常，把纪律和（ ）挺在前面。

A. 政治建设
B. 规矩
C. 党内法规
D. 思想建设
答案：B

267. 把权力关进( )的笼子里。
A. 法律
B. 党内法规
C. 纪律
D. 制度
答案：D

268. 要发挥政治( )利剑作用，落实全面从严治党政治责任。
A. 问责
B. 巡视
C. 纪律
D. 处分
答案：B

269. 当前，我国的反腐败斗争取得( )胜利并全面巩固，但形势依然严峻复杂。
A. 决定性
B. 完全性
C. 压倒性
D. 阶段性
答案：C

270. 深入推进新时代党的建设新的伟大工程，以( )引领社会革命。
A. 全面从严治党
B. 党的自我革命
C. 党的作风建设
D. 党的政治建设
答案：B


271. 经过不懈努力，党找到了这一跳出治乱兴衰历史周期率的第二个答案，确保党永远不变质、不变色、不变味。
A. 全面从严治党
B. 自我革命
C. 坚持党的全面领导
D. 民主监督
答案：B

272. ( )是我们党敢于自我革命的勇气之源、底气所在。
A. 马克思主义政党
B. 敢于斗争
C. 人民至上
D. 没有任何自己特殊的利益
答案：D

273. 全面从严治党，核心是( )，基础在全面，关键在严，要害在治。
A. 加强党的领导
B. 党的自我革命
C. 党的作风建设
D. 党的政治建设
答案：A

274. ( )，就是党能够正视自身存在的问题，敢于刀刃向内、勇于解决自身问题，这是我们党区别于其他政党的显著标志。
A. 民主监督
B. 自我革命
C. 从严治党
D. 党的政治建设
答案：B

275. ( )是危害党的生命力和战斗力的最大毒瘤。
A. 脱离群众
B. 为官不为
C. 腐败
D. 懒政
答案：C

276. ( )是行使国家监察职能的专责机关。
A. 纪委
B. 监察委员会
C. 人民检察院
D. 反贪局
答案：B

277. “打虎”、“拍蝇”、( )多管齐下，反腐败斗争取得压倒性胜利并全面巩固，消除了党、国家、军队内部存在的严重隐患。
A. 反特权
B. 猎狐
C. 抓作风
D. 抓住领导干部这个“关键少数”
答案：B

278. 全面加强( )，加强理想信念教育，引导全党牢记党的宗旨，自觉做共产主义远大理想和中国特色社会主义共同理想的坚定信仰者和忠实实践者。
A. 党的作风建设
B. 党的政治建设
C. 党的组织建设
D. 党的思想建设
答案：D

279. 锲而不舍落实中央八项规定精神，持续深化纠治“四风”，重点纠治、官僚主义，坚决破除特权思想和特权行为。
A. 享乐主义
B. 自由主义
C. 形式主义
D. 拜金主义
答案：C

280. 党的( )建设是党的根本性建设。
A. 政治
B. 组织
C. 作风
D. 思想
答案：A

281. 2012年11月15日，习近平总书记在十八届中央政治局常委同中外记者见面时指出：“，就是我们的奋斗目标”。
A. 实现国家富强
B. 人民对美好生活的向往
C. 实现民族独立
D. 世界和平与发展
答案：B






多选题
282. 下面属于概况习近平新时代中国特色社会主义思想主要内容的是( )。
A. “十个明确”
B. “十四个坚持”
C. “十三个成就”
D. “五位一体”
答案：ABC

283. 下列选项中，属于“四风”的表现的是( )。
A. 形式主义
B. 官僚主义
C. 享乐主义
D. 奢靡之风
答案：ABCD

284. 习近平新时代中国特色社会主义思想聚焦的问题是( )。
A. 新时代坚持和发展什么样的中国特色社会主义、怎样坚持和发展中国特色社会主义
B. 建设什么样的社会主义现代化强国、怎样建设社会主义现代化强国
C. 建设什么样的长期执政的马克思主义政党、怎样建设长期执政的马克思主义政党
D. 在新时代实现什么样的发展，怎样发展
答案：ABC

285. 习近平总书记在会见意大利众议长菲科时说：“我将无我，不负人民”，“我将无我，不负人民”体现了( )。
A. 党的宗旨
B. 伟大建党精神
C. 党的先进性
D. 党的纯洁性
答案：ABCD

286. “两个大局”是习近平总书记在治国理政中的关键词、核心词，两个大局指的是( )。
A. 全面建设社会主义的总体布局
B. 世界百年未有之大变局
C. 中华民族伟大复兴的战略全局
D. “四个全面”战略布局
答案：BC

287. 下面属于“十个明确”的内容是( )。
A. 明确中国特色社会主义最本质的特征是中国共产党领导，中国特色社会主义制度的最大优势是中国共产党领导，中国共产党是最高政治领导力量，全党必须增强“四个意识”、坚定“四个自信”、做到“两个维护”；
B. 明确坚持和发展中国特色社会主义，总任务是实现社会主义现代化和中华民族伟大复兴，在全面建成小康社会的基础上，分两步走在本世纪中叶建成富强民主文明和谐美丽的社会主义现代化强国，以中国式现代化推进中华民族伟大复兴
C. 明确全面深化改革总目标是完善和发展中国特色社会主义制度、推进国家治理体系和治理能力现代化
D. 明确从二〇二〇年到二〇三五年基本实现社会主义现代化；从二〇三五年到本世纪中叶把我国建成富强民主文明和谐美丽的社会主义现代化强国
答案：ABC

288. 下面属于“十个明确”的内容是( )。
A. 明确中国特色社会主义最本质的特征是中国共产党领导，中国特色社会主义制度的最大优势是中国共产党领导，中国共产党是最高政治领导力量，全党必须增强“四个意识”、坚定“四个自信”、做到“两个维护”；
B. 明确坚持和发展中国特色社会主义，总任务是实现社会主义现代化和中华民族伟大复兴，在全面建成小康社会的基础上，分两步走在本世纪中叶建成富强民主文明和谐美丽的社会主义现代化强国，以中国式现代化推进中华民族伟大复兴
C. 明确全面深化改革总目标是完善和发展中国特色社会主义制度、推进国家治理体系和治理能力现代化
D. 明确从二〇二〇年到二〇三五年基本实现社会主义现代化；从二〇三五年到本世纪中叶把我国建成富强民主文明和谐美丽的社会主义现代化强国
答案：ABCD

289. 习近平总书记指出：“学好‘四史’ 永葆初心、永担使命”，下面属于“四史”范畴的是( )。
A. 党史
B. 改革开放史
C. 国史
D. 社会主义发展史
答案：ABCD

290. 下面关于习近平新时代中国特色社会主义思想的论述，科学的是( )。
A. 习近平新时代中国特色社会主义思想是当代中国马克思主义、二十一世纪马克思主义
B. 习近平新时代中国特色社会主义思想是中华文化和中国精神的时代精华
C. 习近平新时代中国特色社会主义思想实现了马克思主义中国化新的飞跃
D. 习近平新时代中国特色社会主义思想是与毛泽东思想、中国特色社会主义理论体系一脉相承的
答案：ABCD

291. “四个伟大”是习近平新时代中国特色社会主义思想的重要组成部分，下面属于“四个伟大”的内容是( )。
A. 伟大斗争
B. 伟大梦想
C. 伟大革命
D. 伟大成就
答案：AB

292. 坚持和发展中国特色社会主义的总任务是( )。
A. 解放和发展社会生产力
B. 实现社会主义现代化和中华民族伟大复兴
C. 在实现全面建成小康社会的基础上，分两步走在本世纪中叶建成富强民主文明和谐美丽的社会主义现代化强国
D. 中国梦是中华民族伟大复兴的形象表达
答案：BCD

293. 《复兴之路》展览，回顾了中华民族的昨天，展示了中华民族的今天，宣示了中华民族的明天，习近平引用三句诗对这段历史进行了生动叙说，他们是( )。
A. “雄关漫道真如铁”
B. “而今迈步从头越”
C. “人间正道是沧桑”
D. “长风破浪会有时”
答案：ACD

294. 中国梦的科学内涵是( )。
A. 国家富强
B. 社会和谐
C. 民族振兴
D. 人民幸福
答案：ACD

295．中国梦的实现途径是( )。
A. 坚持中国道路
B. 维护世界和平
C. 弘扬中国精神
D. 凝聚中国力量
答案：ACD

296. 关于中国梦的内涵理解正确的是( )。
A. 核心内容时国家富强、民族振兴、人民幸福
B. 中国梦是国家的梦、民族的梦、归根到底是人民的梦
C. 国家富强、民族振兴是人民幸福的基础和保障
D. 人民幸福是国家富强、民族振兴的根本出发点和落脚点
答案：ABCD

297. 奋力实现中国梦，需要( )。
A. 实现中国梦必须走中国道路，这就是中国特色社会主义道路
B. 实现中国梦必须弘扬中国精神，这就是以爱国主义为核心的民族精神和以改革创新为核心的时代精神
C. 实现中国梦必须凝聚中国力量，这就是全国各族人民大团结的力量
D. 实现中国梦需要和平，只有和平才能实现梦想
答案：ABCD

298. 党的十九大报告中提出全面建设社会主义现代化国家的进程分两个阶段来安排( )。
A. 第一阶段，从2017年到2037年在全面建成小康社会的基础上，再奋斗15年，基本实现社会主义现代化
B. 第二个阶段，从2037年到本世纪中叶在基本实现现代化的基础上，再奋斗15年，把我国建成富强民主文明和谐美丽的社会主义现代化强国
C. 第一个阶段，从2020年到2035年，在全面建成小康社会的基础上，再奋斗15年，基本实现社会主义现代化
D. 第二个阶段，从2035年到本世纪中叶，在基本实现现代化的基础上，再奋斗15年，把我国建成富强民主文明和谐美丽的社会主义现代化强国
答案：CD

299. 中国梦是( )的梦，与世界各国人民的美好梦想相通。
A. 和平
B. 发展
C. 合作
D. 共赢
答案：ABCD

300. 全面建成小康社会的目标要求是( )。
A. 经济保持中高速增长、创新驱动成效显著
B. 各方面制度更加成熟更加定型
C. 发展协调性明显增强、人民生活水平和质量普遍提高
D. 国民素质和社会文明程度显著提高、生态环境质量总体改善
答案：ABCD

301. 2020年，“十三五”规划目标任务胜利完成，( )，我国经济实力、科技实力、综合国力和人民生活水平跃上新的大台阶。
A. 完成乡村振兴战略
B. 决战脱贫攻坚取得全面胜利
C. 全面建成小康社会取得决定性成就
D. 社会主义现代化开启征程
答案：BC

302. ( )，是我们党的初心和使命，是党领导现代化建设的出发点和落脚点，也是新发展理念的“根”和“魂。
A. 为人民谋幸福
B. 为人民谋复兴
C. 为民族谋复兴
D. 为民族谋幸福
答案：AC

303. 从2020年到2035年，基本实现社会主义现代化的目标要求( )。
A. 在经济建设方面，我国经济实力、科技实力将大幅跃升，跻身创新型国家前列
B. 在政治建设方面，人民平等参与、平等发展权利得到充分保障，法治国家、法治政府、法治社会基本建成，各方面制度更加完善，国家治理体系和治理能力现代化基本实现
C. 在文化建设方面，社会文明程度达到新的高度，国家文化软实力显著增强，中华文化影响更加广泛深入
D. 在生态文明建设方面，生态环境根本好转，美丽中国目标基本实现
答案：ABCD

304. 从2035年到本世纪中叶，建成社会主义现代化强国的目标要求( )。
A. 我国将拥有高度的物质文明，社会生产力水平大幅提高，核心竞争力名列世界前茅，经济总量和市场规模超越其他国家
B. 我国将拥有高度的政治文明，形成又有集中又有民主、又有纪律又有自由、又有统一意志又有个人心情舒畅生动活泼的政治局面，依法治国和以德治国有机结合
C. 我国将拥有高度的精神文明，践行社会主义核心价值观成为全社会自觉行动，国民素质显著提高，中国精神、中国价值、中国力量成为中国发展的重要影响力和推动力
D. 我国将拥有高度的社会文明，城乡居民将普遍拥有较高的收入、富裕的生活、健全的基本公共服务
答案：ABCD

305. 党是最高政治领导力量，这是由我国( )和( )所决定的。
A. 国家性质
B. 国体政体
C. 经济基础
D. 经济制度
答案：AB

306. 国家政治体系是一个大系统，其构成包括( )各方面具体的体制机制。
A. 根本政治制度
B. 基本政治制度
C. 国家治理
D. 社会治理
答案：ABC

307. 社区治理得好不好，关键( )，要把基层党组织这个战斗堡垒建得更强。
A. 在人民监督
B. 在社会监督
C. 在基层党组织
D. 在广大党员
答案：CD

308. 中国特色社会主义是科学社会主义基本原则同( )相结合的产物，是植根于当代中国的科学社会主义。
A. 当代中国实际
B. 时代特征
C. 社会发展
D. 人民生活
答案：AB

309. 坚持和完善党的领导，是( )。
A. 党和国家的根本所在、命脉所在。
B. 全国各族人民的利益所在、幸福所在
C. 中国特色社会主义最本质的特征
D. 中国特色社会主义制度的最大优势、
答案：ABCD

310. 中国共产党是中国特色社会主义事业的( )。
A. 开创者
B. 推动者
C. 引领者
D. 发动者
答案：ABC

311. 党是领导是做好党和国家各项工作的根本保证，是我国( )的根本点，绝对不能有丝毫动摇。
A. 民族团结
B. 社会稳定
C. 政治稳定
D. 经济发展
答案：ABCD

312. 确保党始终总揽全局、协调各方，必须增强政治意识( )，自觉维护党中央权威和集中统一领导，自觉在思想上政治上行动上同党中央保持高度一致。
A. 大局意识
B. 核心意识
C. 中心意识
D. 看齐意识
答案：ABD

313. 要着力提高党( )的能力和定力，善于处理各种复杂矛盾，勇于战胜各种艰难险阻，牢牢把握工作主动权，把党总揽全局、协调各方落到实处。
A. 把方向
B. 谋大局
C. 定政策
D. 促改革
答案：ABCD

314. 党章规定的民主集中制要求( )。
A. 党员个人服从党的组织
B. 少数服从多数
C. 下级组织服从上级组织
D. 全党各个组织和全体党员服从党的全国代表大会和中央委员会
答案：ABCD

315. 群众路线是指 ( ) 。
A. 一切为了群众
B. 一切依靠群众
C. 从群众中来
D. 到群众中去
答案：ABCD 

316. 中国共产党的初心使命是 ( ) 。
A. 为中国人民谋幸福
B. 为中华民族谋复兴
C. 为人类谋大同
D. 全民建成小康社会
答案：AB

317. 中国共产党立于不败之地的根本所在是 ( ) 。
A. 中国共产党是马克思主义政党
B. 中国共产党从来不代表任何利益集团的利益
C. 中国共产党从来不代表任何权势团体的利益
D. 中国共产党从来不代表任何特权阶层的利益
答案：BCD

318. 人的全面发展的基本内涵包括 ( ) 。
A. 人的社会关系的充分发展
B. 人的能力的全面发展
C. 人的需求得到全面满足
D. 人的个性的自由发展
答案：ABD

319. 共同富裕是指 ( )
A. 是一部分人的富裕
B. 物质资料高度发达
C. 全体人民共同富裕
D. 人民群众物质生活和精神生活都富裕
答案：CD

320. 追求共同富裕 ( ) 。
A. 贯穿于中国式现代化道路形成和拓展的历史过程
B. 体现在中国式现代化不断丰富发展的奋斗目标中
C. 明确了走中国式现代化道路的必然要求
D. 彰显中国式现代化道路的深厚文化底蕴
答案：ABCD

321. 在高质量发展中促进共同富裕，就要做到 ( ) 。
A. 发展为了人民
B. 发展依靠人民
C. 发展成果由人民共享
D. 同步发展
答案：ABC

322. 实现共同富裕，要正确处理好 ( ) 之间的关系。
A. 效率与公平
B. 分化与整合
C. 发展与稳定
D. 开放与自主
答案：ABCD

323. 要统筹需要和可能，重点加强 ( ) 民生保障建设。
A. 基础性
B. 普惠性
C. 兜底性
D. 全面性
答案：ABC

324. 我国经济发展处于 ( ) 阶段，我国发展进入新常态。
A. 增长速度换挡期
B. 结构调整阵痛期
C. 质量转型提升期
D. 前期刺激政策消化期
答案：ABD

325. 把处理好 ( ) 的关系作为经济体制改革的关键。
A. 政府
B. 市场
C. 人民
D. 发展
答案：AB

326. 要推进供给侧结构性改革作为经济发展的主线，坚持 ( ) 方针。
A. 巩固
B. 增强
C. 提升
D. 畅通
答案：ABCD

327. 进入( )、贯彻( )、构建( )，是由我国经济社会发展的理论逻辑、历史逻辑、现实逻辑决定的，三者紧密关联。
A. 新发展阶段
B. 新发展理念
C. 新发展格局
D. 新发展时期
答案：ABC

328. ( )，是我们党的初心和使命，是党领导现代化建设的出发点和落脚点，也是新发展理念的“根”和“魂。
A. 为人民谋幸福
B. 为人民谋复兴
C. 为民族谋复兴
D. 为民族谋幸福
答案：AC

329. 贯彻新发展理念是关系我国发展全局的一场深刻变革，不能简单以生产总值增长率论英雄，必须实现创新成为第一动力、协调成为内生特点、绿色成为普遍形态、开放成为必由之路、共享成为根本目的的高质量发展，推动经济发展( )变革、( )变革、( )变革。
A. 质量
B. 整体
C. 效率
D. 动力
答案：ACD

330. 如何理解我国进入新发展阶段的基本依据？ ( )
A. 宪法和法律的最新规定
B. 马克思主义是远大理想和现实目标相结合、历史必然性和发展阶段性相统一的统一论者，坚信人类社会必然走向共产主义，但实现这一崇高目标必然经历若干历史阶段。
C. 新发展阶段是我们党带领人民迎来从站起来、富起来到强起来历史性跨越的新阶段。
D. 我们已经拥有开启新征程、实现新的更高目标的雄厚物质基础。
答案：BCD

331. 如何理解社会主义初级阶段？ ( )
A. 一个静态、一成不变、停滞不前的阶段
B. 一个阶梯式递进、不断发展进步、日益接近质的飞跃的量的积累和发展变化的过程
C. 一个自发、被动、不用费多大气力自然而然就可以跨过的阶段
D. 一个动态、积极有为、始终洋溢着蓬勃生机活力的过程
答案：BD

332. 国际环境日趋复杂，新冠肺炎疫情影响广泛深远，经济全球化遭遇逆流，世界进入新的动荡变革期，大国博弈日趋激烈， ( ) 对世界和平与发展构成威胁。
A. 多边主义
B. 保护主义
C. 霸权主义
D. 单边主义
答案：BCD

333. 新发展理念是一个系统的理论体系：回答了关于发展的 ( ) 等一系列理论和实践问题，阐明了我们党关于发展的政治立场、价值导向、发展模式、发展道路等重大政治问题。
A. 目的
B. 动力
C. 方式
D. 路径
答案：ABCD

334. 社会主义基本经济制度的科学内涵是 ( ) 。
A. 公有制为主体、多种所有制经济共同发展
B. 构建现代化经济体系
C. 按劳分配为主体、多种分配方式并存
D. 社会主义市场经济体制
答案：ACD

335. 五四运动以来我国发生的三大历史性事件是 ( ) 。
A. 建立中国共产党
B. 成立中华人民共和国
C. 推进改革开放和中国特色社会主义事业
D. 全面深化改革
答案：ABC

336. 近代以来实现中华民族伟大复兴的三大里程碑是 ( ) 。
A. 建立中国共产党
B. 成立中华人民共和国
C. 推进改革开放和中国特色社会主义事业
D. 中国特色社会主义进入新时代
答案：ABC

337. 改革开放就是要正确处理好 ( ) 之间的矛盾。
A. 生产力和生产关系
B. 经济基础和上层建筑
C. 生产力和经济基础
D. 生产关系和上层建筑
答案：AB

338. 当前，我国发展进入新阶段，改革进入 ( ) 。
A. 艰难期
B. 顺利期
C. 攻坚期
D. 深水区
答案：CD

339. “全面”深化改革是指 ( ) 。
A. 改革目标的总体性
B. 改革领域的全面性
C. 改革机制的系统性
D. 改革层面的全体性
答案：ABC

340. 中央全面深化改革委员会负责对改革 ( ) 。
A. 总体设计
B. 统筹协调
C. 整体推进
D. 督促落实
答案：ABCD

341. 全面深化改革的总目标是 ( ) 。
A. 完善和发展中国特色社会主义制度
B. 推进国家治理体系和治理能力现代化
C. 解放生产力
D. 发展生产力
答案：AB

342. 一个国家制度和制度执行力的集中体现是 ( ) 。
A. 国家治理体系
B. 国家治理能力
C. 国家制度体系
D. 国家法制体系
答案：AB

343. 教育改革必须以 ( ) 为出发点和落脚点。
A. 促进资源平均分配
B. 提高入学率
C. 促进社会公平正义
D. 增进人民福祉
答案：CD

344. 深化政治体制改革要坚持 ( ) 三者的有机统一。
A. 党的领导
B. 人民当家作主
C. 依法治国
D. 依宪执政
答案：ABC

345. 全过程人民民主是( )的民主，是最广泛、最真实、最管用的社会主义民主。
A. 全方面
B. 全链条
C. 全方位
D. 全覆盖
答案：BCD

346. 全过程人民民主实现了( )。
A. 过程民主和成果民主相统一
B. 程序民主和实质民主相统一
C. 直接民主和间接民主相统一
D. 人民民主和国家意志相统一
答案：ABCD

347. 人民既是民主的( )，也是民主的( )，智慧力量充分激发，既为自己也为国家、民族拼搏奋斗。
A. 参与者
B. 受益者
C. 决策者
D. 执行者
答案：AB

348. 在人民民主的共同旗帜下，中国共产党与各民主党派( )。
A. 长期共存
B. 互相监督
C. 肝胆相照
D. 荣辱与共
答案：ABCD

349. 提高党()水平，保证党领导人民有效治理国家，切实防止出现群龙无首、一盘散沙的现象。
A. 科学执政
B. 民主执政
C. 依法执政
D. 公平执政
答案：ABC

350. 巩固和发展爱国统一战线，应该着手做好以下工作：( )。
A. 坚持长期共存、互相监督、肝胆相照、荣辱与共的中国共产党领导的政治协商制度
B. 深化民族团结进步教育
C. 全面贯彻党的宗教工作基本方针
D. 牢牢把握大团结大联合的主题，做好统战工作
答案：ABCD

351. 走中国特色社会主义政治发展道路，必须坚持( )有机统一。
A. 推进国家治理体系和治理能力现代化
B. 巩固和发展最广泛的爱国统一战线
C. 党的领导
D. 人民当家作主，依法治国
答案：CD

352. 发展社会主义民主政治是中国共产党始终不渝的奋斗目标，是实现中华民族伟大复兴的( )。
A. 必要条件
B. 根本标志
C. 重要标准
D. 显著标识
答案：AD

353. ( )是能够持续推动拥有14亿多人口大国进步和发展、确保拥有5000多年文明史的中华民族实现“两个一百年”奋斗目标进而实现伟大复兴的制度和治理体系。
A. 中国特色社会主义制度
B. 中国特色社会主义国家治理体系
C. 中国特色社会主义道路
D. 国家治理能力
答案：AB

354. 要坚持和完善人民当家作主制度体系，不断推进社会主义民主政治( )，更好把制度优势转化为治理效能。
A. 制度化
B. 规范化
C. 程序化
D. 科学化
答案：ABC

355．依法治国是( )。
A. 发展社会主义市场经济的客观需要
B. 社会文明进步的重要标志
C. 国家长治久安的重要保证
D. 党领导人民治理国家的基本方略
答案：ABCD

356. 下列属于“四个全面”战略布局的是( )。
A. 全面从严治党
B. 全面建成小康社会
C. 全面深化改革
D. 全面依法治国
答案：ABCD

357. 新时代坚持和发展中国特色社会主义的基本方略有( )。
A. 坚持党对一切工作的领导，坚持以人民为中心，坚持全面深化改革
B. 坚持新发展理念，坚持人民当家作主，坚持全面依法治国
C. 坚持社会主义核心价值体系，坚持在发展中保障和改善民生，坚持人与自然和谐共生
D. 坚持总体国家安全观，坚持党对人民军队的绝对领导，坚持“一国两制”和推进祖国统一
E. 坚持推动构建人类命运共同体，坚持全面从严治党
答案：ABCDE

358．十八届四中全会通过的《中共中央关于全面推进依法治国若干重大问题的决定》提出，全面推进依法治国，总目标是建设中国特色社会主义法治体系，建设社会主义法治国家，坚持( )。
A. 依法治国
B. 依法执政
C. 依法行政
D. 依法治理
答案：ABC

359. 十八届四中全会提出，全会提出，法律是治国之重器，良法是善治之前提。建设中国特色社会主义法治体系，必须坚持立法先行，发挥立法的引领和推动作用，抓住提高立法质量这个关键。要( )。
A. 恪守以民为本、立法为民理念
B. 贯彻社会主义核心价值观
C. 尽快学习和借鉴西方发达国家的立法经验
D. 使每一项立法都符合宪法精神、反映人民意志、得到人民拥护
答案：ABD

360. 十八届四中全会指出，加快推进反腐败国家立法，完善惩治和预防腐败体系，形成( )的有效机制，坚决遏制和预防腐败现象。
A. 不敢腐
B. 不能腐
C. 不想腐
D. 不易腐
答案：ABC

361. 全面从严治党是推进党的建设新的伟大工程的必然要求。从严治党的重点是：( )。
A. 正风反腐
B. 严明党纪
C. 自我净化
D. 从严治吏
答案：ABD

362. 十八届四中全会通过的《中共中央关于全面推进依法治国若干重大问题的决定》提出，全面推进依法治国，总目标是建设中国特色社会主义法治体系，建设社会主义法治国家，坚持( )。
A. 依法治国
B. 依法执政
C. 依法行政
D. 依法治理
答案：ABC

363. “国无常治，又无常乱，法令行则国治，法令弛则国乱。”用明确的法律规范来调节社会生活、维护社会秩序，是古今中外的通用手段，应有效发挥法治( )、( )、( )的保障作用。
A. 固根本
B. 稳预期
C. 利长远
D. 教育功能
答案：ABC
364. 法治对于国家制度和治理体系具有“固根本”的保障作用。法治在国家和社会生活中拥有独特地位、权威和影响。运用法治力量“固根本”“强根基”，对于保障国家制度和国家治理体系的( )、( )、( )和( )，对于确保党和国家兴旺发达、长治久安，具有重大而深远的意义。
A. 根本性
B. 全局性
C. 稳定性
D. 长期性
答案：ABCD

365. 从“依法治国”到“全面依法治国”，从“社会主义法律体系”到“社会主义法治体系“，从“有法必依、有法必依、执法必严、违法必究”到( )，法治建设的思路越来越清晰，定位越来越精准，举措越来越到位。可以说，全面依法治国是社会主义法治建设的“全面升级版”，不论在法治理念上还是在战略部署上，都是国家治理的一场深刻革命。
A. 科学立法
B. 严格执法
C. 公正司法
D. 全民守法
答案：ABCD

366．党的十八届四中全会通过的《中共中央关于全面推进依法治国若干重大问题的决定》，提出全面依法治国的总目标是( )、( )。
A. 建设中国特色社会主义法治体系
B. 建设中国特色社会主义法制体系
C. 建设社会主义法治国家
D. 建设社会主义法制国家
答案：AC

367. 中国特色社会主义法治体系包括( )。
A. 完备的法律规范体系
B. 高效的法治实施体系
C. 严密的法治监督体系
D. 有力的法治保障体系
E. 完善的党内法规体系
答案：ABCDE

368. 加强社会治理制度建设，完善党委领导、政府负责、社会协同、公众参与、法治保障的社会治理体制，提高社会治理( )水平。
A. 社会化
B. 法治化
C. 智能化
D. 专业化
答案：ABCD

369. 坚持把马克思主义基本原理同 ( ) 相结合，用马克思主义观察时代、把握时代、引领时代，继续发展当代中国马克思主义、21世纪马克思主义。
A. 中国具体实际相结合
B. 中华优秀传统文化
C. 中国精神
D. 民族特色
答案：AB

370. 中国特色社会主义事业总体布局是“五位一体”、战略布局是“四个全面”，强调坚定 ( ) 。
A. 道路自信
B. 理论自信
C. 制度自信
D. 文化自信
答案：ABCD

371. 2021年3月，习近平总书记对革命文物工作作出重要指示指出：“弘扬革命文化，传承红色基因，是全党全社会的共同责任。”我们所弘扬的革命文化 ( ) 。
A. 始终坚持为人民服务、为社会主义服务，代表着先进文化的前进方向
B. 积淀着中华民族最深层的精神追求，代表着中国革命的精神标识
C. 植根于中国特色社会主义伟大实践，是革命战争年代的先进文化
D. 承载着党和人民对国家独立、民族解放、人民幸福的不懈追求
答案：BD

372. 习近平总书记希望广大文艺工作者坚持守正创新，用跟上时代的精品力作开拓文艺新境界。可见，文化发展需要 ( ) 。
A. 立足时代之基，回答时代之问
B. 坚持不忘本来，吸收外来
C. 坚定信念，坚持以人民为中心
D. 融通不同资源，实现综合创新
答案：ABC

373. 中国特色社会主义文化源自于中华民族五千多年文明历史所孕育的中华优秀传统文化，熔铸于党领导人民在革命、建设、改革中创造的革命文化和社会主义先进文化，植根于中国特色社会主义伟大实践。关于发展中国特色社会主义文化，下列说法正确的是 ( ) 。
A. “文章合为时而著”，要立足时代之基、回答时代之问
B. 要依靠人民，满足人民多样化、多层次、多方面的精神文化需求
C. 要坚守传统习俗，同时融通古今中外文化资源
D. 要把握文化发展规律，用外来文化解决中国的时代问题
答案：AB

374. 展开历史长卷，从赵武灵王胡服骑射，到北魏孝文帝汉化改革；从“洛阳家家学胡乐”到“万里羌人尽汉歌”；从边疆民族习用“上衣下裳”、“雅歌儒服”，到中原盛行“上衣下裤”、胡衣胡帽，以及今天随处可见的舞狮、胡琴、旗袍等，展现了各民族文化的互鉴融通。各族文化交相辉映，中华文化历久弥新，这是今天我们强大文化自信的根源。这表明 ( ) 。
A. 文化自信是对全部中华优秀文化的继承
B. 中华文化注重吸收和借鉴外来文化的有益成果
C. 中华优秀传统文化是我们最深厚的文化软实力
D. 民族文化是一个国家更基本、更深沉、更持久的力量
答案：BCD

375. 党史学习教育中要鼓励创作党史题材的文艺作品，追寻历史细节，从新的视角挖掘故事素材；要抓好青少年学习教育，让红色基因、革命薪火代代传承。这是基于 ( ) 。
A. 弘扬传统道德、践行社会主义核心价值观的需要
B. 触摸历史脉动、推动中华文化创造性转化的需要
C. 讲好中国故事、厚植爱党爱国爱社会主义情怀的需要
D. 阐释初心使命，实现中华民族伟大复兴的需要
答案：ABCD

376. 2021年12月13日是第八个南京大屠杀死难者国家公祭日，这一天，凄厉的警报声将再一次作为整个国家的背景音长鸣。中共中央、国务院于当日上午在江苏南京隆重举行国家公祭仪式。举行该仪式的意义在于 ( ) 。
A. 弘扬民族精神，增强国家认同和民族责任感
B. 推动文化与政治相互交融，彰显国家硬实力
C. 赓续红色血脉，巩固革命文化传统文化的根本指导地位
D. 缅怀人民英雄，激发实现中华民族伟大复兴的精神动力
答案：BD

377. 2020年9月8日，全国抗击新冠肺炎疫情表彰大会在北京人民大会堂隆重举行。表彰在抗击新冠肺炎疫情斗争中作出杰出贡献的功勋模范人物，授予钟南山“共和国勋章”，授予张伯礼、张定宇、陈薇“人民英雄”国家荣誉称号。党中央开展这项活动 ( ) 。

A. 能为人民提供精神引领
B. 有利于我国多元化的意识形态发展
C. 能彰显文化自信的力量
D. 有利于培育社会主义核心价值体系
答案：ACD

378. 哪有什么岁月静好，只不过有人替你负重前行。70多年前有烈火焚身却不动分毫的邱少云；70多年后的今天，有“卫国戍边英雄团长”祁发宝和勇护边疆为国捐躯的陈红军、陈祥榕等烈士！他们用热血捍卫界碑，以生命丈量雪原，用他们的无私奉献换来山河无恙、国泰民安。学习英雄人物的先进事迹启示我们青年人应该 ( ) 。
A. 弘扬传统美德，增强诚信意识
B. 弘扬主旋律、传播正能量
C. 增强社会责任感，激发爱国情怀
D. 坚定理想信念，践行社会主义核心价值观
答案：BCD

379. 《在第十三届全国人民代表大会第一次会议上的讲话》中，习近平总书记84次提到“人民”，这体现了以下哪些理念( )。
A. 坚持以人民为中心
B. 坚持人民当家作主
C. 坚持在发展中保障和改善民生
D. 坚持推动构建人类命运共同体
答案：ABC

380. 习近平总书记在2020年9月17日基层代表座谈会上的讲话中谈到：谋划“十四五”时期发展，要坚持( )、( )，努力在推动高质量发展过程中( )、( )。要更加聚焦人民群众普遍关心关注的民生问题，采取更有针对性的措施，一件一件抓落实，一年接着一年干，让人民群众获得感、幸福感、安全感更加充实、更有保障、更可持续。
A. 坚持发展为了人民
B. 坚持发展成果由人民共享
C. 办好各项民生事业
D. 补齐民生领域短板
答案：ABCD

381. 党的十八大以来，我国社会建设全面加强，人民生活全方位改善，社会治理( )、( )、( )、( )水平大幅度提升，发展了人民安居乐业、社会安定有序的良好局面，续写了社会长期稳定奇迹。
A. 社会化
B. 法治化
C. 智能化
D. 专业化
答案：ABCD

382. 习近平总书记在中国共产党第十九次全国代表大会上的报告指出：“必须多谋民生之利、多解民生之忧，在发展中补齐民生短板、促进社会公平正义，在幼有所育、( )、( )、( )、( )、住有所居、弱有所扶上不断取得新进展。”
A. 学有所教
B. 劳有所得
C. 病有所医
D. 老有所养
答案：ABCD

383. 坚持以人民为中心的发展思想，在高质量发展中促进共同富裕，正确处理效率和公平的关系，构建( )协调配套的基础性制度安排。
A. 初次分配
B. 再分配
C. 三次分配
D. 四次分配
答案：ABC

384. 党的十八大以来，以习近平同志为核心的党中央对残疾人事业格外关注。在国家层面建立起覆盖数千万残疾人口，包含( )、( )、( )等内容的残疾人专项福利制度，残疾人事业整体发展水平迈上新台阶。
A. 生活补贴
B. 护理补贴
C. 儿童康复补贴
D. 大病医疗保险
答案：ABC

385. 保障和改善民生的重要原则，既要( )，又要( )，既不能裹足不前、铢施两较、该花的钱也不花，也不能好高骛远、寅吃卯粮、口惠而实不至。
A. 尽力而为
B. 量力而行
C. 守住底线
D. 完善制度
答案：AB

386. 习近平总书记在参加十二届全国人大三次会议吉林代表团的审议时讲到：“民生工作面广量大，具有( )等特点。要有坚持不懈的韧劲，一件接着一件办，不要贪多嚼不烂，不要狗熊掰棒子，眼大肚子小。要发扬钉钉子精神，不能虎头蛇尾。我们要一诺千金，说到就要做到。”
A. 稳定性
B. 连续性
C. 短暂性
D. 累积性
答案：ABD

387. 脱贫攻坚精神包括：()、攻坚克难、不负人民。
A. 上下同心
B. 尽锐出战
C. 精准务实
D. 开拓创新
答案：ABCD

388. 加强以民生为重点的社会建设，建设立体化、信息化的全方位社会治安防控体系，包括()
A. 加强社会治安防控网建设
B. 提高社会治安防控体系建设科技水平
C. 完善社会治安防控运行机制
D. 运用法治思维和法治方式推进社会治安防控体系建设
E. 建立健全社会治安防控体系建设工作格局
答案：ABCDE

389. 加强以民生为重点的社会建设，扎实开展平安中国建设，维护社会稳定、保障人民安全，坚持()方向，聚焦影响国家安全、社会安定、人民安宁的突出问题，深入推进市域社会治理现代化，深化平安创建活动，加强基层组织、基础工作、基本能力建设，全面提升平安中国建设科学化、社会化、法治化、智能化水平，不断增强人民群众获得感、幸福感、安全感。
A. 共建
B. 共治
C. 共享
D. 共创
答案：ABC

390. 习近平总书记在谈及生态文明建设时指出:“我们既要绿水青山，也要金山银山。宁要绿水青山，不要金山银山，而且绿水青山就是金山银山。”关于生态文明建设，下列理解正确的是 ( ) 。
A. 人与自然的关系是人类社会最基本的关系
B. 良好的生态环境是最公平的公共产品，是最普惠的民生福祉
C. 生态环境问题归根结底是气候变化问题
D. 绿水青山中蕴含着经济价值
答案：ABD

391. 生态文明包括哪些要素 ( ) ？
A. 生态意识文明
B. 生态法治文明
C. 生态行为文明
D. 生态绿色文明
答案：ABC

392. 按污染物的特性划分的污染类型包括以下的 ( ) 。
A. 大气污染
B. 放射污染
C. 生物污染危害
D. 化学污染危害
答案：BCD

393. 以下属于按人类生产方式的变迁来划分的文明是 ( ) 。
A. 游牧文明
B. 生态文明
C. 社会主义文明
D. 工业文明
答案：ABD

394. 人类生态学包括的方向有 ( ) 。
A. 地理学
B. 自然学
C. 社会学
D. 文化学
答案：ACD

395. 被誉为“活化石”的中国树种有什么？ ( )
A. 银杉
B. 银杏
C. 珙桐
D. 香果树
答案：ABCD

396. “美观中国”意味着 ( ) 。
A. 山要绿起来
B. 民要富起来
C. 家要美起来
D. 国要强起来
答案：ABCD

397. 建设中国特色社会主义生态文明，要树立 ( ) 的理念。
A. 崇敬自然
B. 顺应自然
C. 保护自然
D. 征服自然
答案：ABC

398. 固态环境污染按其来源不同，主要分为 ( ) 。
A. 工业废弃物
B. 农业废弃物
C. 矿业废弃物
D. 城市垃圾
答案：ABCD

399. 建设中国特色社会主义生态文明，有助于 ( ) 。
A. 唤醒全民族的生态忧患意识
B. 认清生态环境问题的繁杂性、长期性和艰辛性
C. 持之以恒地重视生态环境养护工作
D. 尽最大可能地俭约能源资源、保护生态环境
答案：ABCD

400. 新时代强军目标是建设一支 ( ) 的人民军队。
A. 听党指挥
B. 能打胜仗
C. 作风优良
D. 为人民服务
答案：ABC

401. 党对军队的绝对领导是人民军队 ( ) 。
A. 建军之本
B. 强军之魂
C. 生命线
D. 本质要求
答案：AB

402. 推进强军事业必须坚持 ( ) 。
A. 政治建军
B. 改革强军
C. 科技兴军
D. 依法治军
答案：ABCD

403. 党对军队的绝对领导包括 ( ) 。
A. 政治领导
B. 思想领导
C. 组织领导
D. 形式领导
答案：ABC

404. 党对军队的绝对领导制度包括 ( ) 。
A. 中央军委主席负责制
B. 党委制
C. 政治委员制
D. 政治机关制
答案：ABCD

405. 建设世界一流军队需要我们 ( ) 。
A. 牢固树立战斗力这个唯一的根本标准
B. 坚持政治建军、改革强军、科技兴军、依法治军
C. 构建中国特色现代军事力量体系
D. 深入推进练兵备战
答案：ABCD

406. 严守政治纪律和政治规矩，加大从严治党、从严治军力度，要强化 ( ) 。
A. 政治意识
B. 大局意识
C. 核心意识
D. 看齐意识
答案：ABCD

407. 要着力培养 ( ) 新时代革命军人。
A. 有灵魂
B. 有本事
C. 有血性
D. 有品德
答案：ABCD

408. 军民融合发展是 ( ) 。
A. 兴国之举
B. 力量源泉
C. 兴军之要
D. 强军之策
答案：AD

409. 国防和军队改革取得重大成效 ( ) 。
A. 体制一新
B. 结构一新
C. 格局一新
D. 面貌一新
答案：ABCD

410. 维护国家安全，要以 ( ) 为保障。
A. 军事安全
B. 科技安全
C. 文化安全
D. 社会安全
答案：ABCD

411. 维护国家安全，要正确处理好 ( ) 之间的关系。
A. 外部安全和内部安全
B. 国土安全和国民安全
C. 传统安全和非传统安全
D. 自身安全和共同安全
答案：ABCD

412. 习近平总书记指出：推动创新发展、协调发展、绿色发展、开放发展、共享发展，前提都是 ( ) 。
A. 国家安全
B. 社会稳定
C. 环境良好
D. 社会和谐
答案：AB

413. 《国家安全法》所界定的“国家安全”包括 ( ) 。
A. 文化安全             
B. 个人隐私安全
C. 生态安全             
D. 核安全
答案：ACD

414. 贯穿总体国家安全观思想方法包括下列哪种思维方式 ( ) 。
A. 系统思维
B. 底线思维
C. 创新思维
D. 问题思维
答案：ABC

415. 根据《国家安全法》的规定，下列关于国家保护公民的说法正确的是 ( ) 。
A. 国家保卫人民安全
B. 国家只保护公民在国内的合法权益
C. 国家要为人民创造良好生存发展条件和安定工作生活环境
D. 国家要保障公民的生命财产安全和其他合法权益
答案：ACD

416. 加强文化安全建设，我们要防范 ( ) 对意识形态领域的威胁。
A. 马克思主义
B. 资本主义
C. 无政府主义
D. 历史虚无主义
答案：BCD

417. 中国特色国家安全道路的重要特征，坚持党的绝对领导，完善集中统一、高效权威的国家安全工作体制，实现 ( ) 相统一。
A. 人民安全
B. 政治安全
C. 国家利益至上
D. 生态安全
答案：ABC

418．总体国家安全观要统筹推进重点领域安全包括 ( ) 。
A. 政治安全、经济安全
B. 网络安全、外部安全
C. 社会安全
D. 国土安全
答案：ABCD

419. 网络安全已经成为我国面临的 ( ) 的非传统安全问题之一。
A. 最复杂
B. 最稳定
C. 最现实
D. 最严峻
答案：ACD

420. （ ）在1949年之后还通过殖民统治占领我国领土。
A. 英国
B. 法国
C. 葡萄牙
D. 美国
答案：AC

421. 我国“一国两制”构想在实践中首次被运用于解决()问题。
A. 香港
B. 台湾
C. 澳门
D. 统一
答案：AC

422. 特别行政区在遵守宪法和基本法的前提下，享有()
A. 行政管理权
B. 立法权
C. 独立的司法权
D. 终审权
答案：ABCD

423. 要全面准确贯彻()方针，落实中央对香港、澳门特别行政区全面管治权，落实特别行政区维护国家安全的法律制度和执行机制，维护国家主权、安全、发展利益。
A. 一国两制
B. 港人治港
C. 澳人治澳
D. 高度自治
答案：ABCD
424. 2014年以来，以()为主要载体的港澳地区与内地金融市场互联互通机制正式建立，并实现了有序发展。
A. 沪港通
B. 深港通
C. 债券通
D. 两岸通
答案：ABC

425. 大湾区建设，是习近平总书记亲自谋划、亲自部署、亲自推动的重大国家战略。()之下的湾区建设，开世界未有之先例。
A. 一个国家
B. 两种制度
C. 三个关税区
D. 三种货币
答案：ABCD

426. 台湾政坛具有重要影响力度政党包括()
A. 国民党
B. 民进党
C. 新党
D. 亲民党
答案：ABCD

427. 曾担任过香港特别行政区行政长官的人有()
A. 董建华
B. 何厚华
C. 林郑月娥
D. 梁振英
答案：ACD

428. 曾担任过澳门特别行政区行政长官的人有()
A. 何厚华
B. 贺一诚
C. 崔世安
D. 曾荫权
答案：ABC

429. 特别行政区坚持实行行政主导体制，()机关依照基本法和相关法律履行职责，行政机关和立法机关既互相制衡又互相配合
A. 选举
B. 行政
C. 立法
D. 司法
答案：BCD

430. 当前()全球性问题需要全人类共同努力？
A. 治理赤字；
B. 和平赤字；
C. 发展赤字；
D. 信任赤字；
答案：ABCD

431. 习近平外交思想包含()。
A. 坚持以维护世界和平、促进共同发展为宗旨推动构建人类命运共同体
B. 坚持以相互尊重、合作共赢为基础走和平发展道路
C. 坚持以公平正义为理念引领全球治理体系改革
D. 坚持以实现中华民族伟大复兴为使命推进中国特色大国外交
答案：ABCD

432. 人类命运共同体的内涵为()
A. 坚持对话协商，建设持久和平的世界
B. 坚持共建共享，建设普遍安全的世界
C. 坚持合作共赢，建设共同繁荣的世界
D. 坚持交流互鉴，建设开放包容的世界
E. 坚持绿色低碳，建设清洁美丽的世界
答案：ABCDE

433. 全人类共同价值与普世价值的本质区别。
A. 形成条件不同；
B. 目标追求不同；
C. 实现方式不同；
D. 内涵不同；
答案：ABC

434. 当前，“人类命运共同体”、新型大国关系、“一带一路”、“共商、共建、共享”的全球治理观等一系列中国理念和倡议获得世界积极回响。由此可见()。
A. 世界多极化深入发展，不可逆转
B. 促进共同发展是中国外交政策的基本目标
C. 和平和发展仍是当今时代的主题
D. 中国坚定走和平发展道路
答案：CD

435. 当前，国际秩序、国际体系在疫情冲击下出现的新趋势()。
A. 国际体系和国际秩序深度调整
B. 世界进入动荡变革期
C. 逆全球化思潮不断蔓延
D. 国际力量对比发生深刻变化
答案：ABCD

436. 十九大以来，我国打造的主场外交亮点突出、成果丰硕，主要价值有()。
A. 增强国际话语权
B. 增强对国际制度演进的影响力
C. 优化国际形象
D. 成为中国增加国际贡献的重要途径
答案：ABCD

437. 十八大以来，中国积极致力于同美国建构以()为核心的新型大国关系。
A. 不冲突、不对抗
B. 对话协商、和平共处
C. 相互尊重、合作共赢
D. 既有竞争也有合作
答案：AC

438. 中国走和平发展道路是从()中得出的结论？
A. 来源于中华文明的深厚渊源
B. 来源于对实现中国发展目标条件的认知
C. 来源于美国的威胁
D. 来源于对世界发展大势的把握
答案：ABD

439. 在新时代，如何继续开创中国特色大国外交的新局面？
A. 推动构建人类命运共同体
B. 始终不渝地坚持和平发展道路
C. 坚持以共商共建共享为原则推动“一带一路”建设
D. 积极推动建设新型国际关系
答案：ABCD

440. 我们党是用和铁的纪律组织起来的马克思主义政党，、纪律严明是党的优良传统和政治优势，也是我们的力量所在。
A. 革命理想
B. 组织严密
C. 马克思主义
D. 作风优良
答案：AB

441. ( )是实现民族复兴的根本保证。
A. 坚持党的领导
B. 坚持党要管党
C. 坚持以人民为中心
D. 全面从严治党
答案：ABD

442. 新形势下，党面临着长期执政考验、( )、|市场经济考验、( )等四大考验。
A. 改革开放考验
B. 国家安全考验
C. 外部环境考验
D. 依法治国考验
答案：AC

443. 新时代好干部标准是( )、( )、勤政务实、( )、清正廉洁。
A. 信念坚定
B. 为民服务
C. 敢于担当
D. 大敢改革
答案：ABC

444. 整治“四风”，具体是指整治( )、官僚主义、( )和( )。
A. 形式主义
B. 拜金主义
C. 享乐主义
D. 奢靡之风
答案：ACD

445. 坚持德才兼备、、、，树立选人用人正确导向，选拔忠诚干净担当的高素质专业化干部。
A. 以德为先
B. 五湖四海
C. 任人唯贤
D. 人事相宜
答案：ABC

446. 完善党的自我革命制度规范体系，坚持制度治党、依规治党，健全、( )、( )的监督体系。
A. 党统一领导
B. 制度完善
C. 全面覆盖
D. 权威高效
答案：ACD

447. 一体推进( )、、，必须三者同时发力、同向发力、综合发力。
A. 不敢腐
B. 不能腐
C. 不会腐
D. 不想腐
答案：ABD

448. 在推进党的自我革命的伟大实践中，不断增强、自我完善、( )、自我提高的能力，把全面从严治党向纵深推进。
A. 自我净化
B. 自我发展
C. 自我革新
D. 自我革命
答案：AC

449. 全面从严治党，核心是加强党的领导，基础在( )，关键在( )，要害在( )。
A. 强
B. 全面
C. 严
D. 治
答案：BCD

450. 不忘初心、牢记使命，说到底是为什么人、靠什么人的问题。以百姓心为心，与人民( )，是党的初心，也是党的恒心。
A. 同呼吸
B. 共命运
C. 心连心
D. 同担当
答案：ABC


单选题
451. 习近平新时代中国特色社会主义思想是马克思主义中国化时代化的现实表现。
答案：对

452. “两个确立”对推进中华民族伟大复兴历史进程具有决定性意义。
答案：对

453.新时代我国社会主要矛盾变化反映了我国已经成为发达的社会主义国家。
答案：错

454.人民至上是我们党制定一切路线方针政策的出发点和归宿。
答案：对

455. 2021年我们党宣布完成第一个百年奋斗目标。
答案：对

456. 我们党不仅仅如是为人民谋幸福的，而且也为世界谋大同的。
答案：对

457.中国式现代化彰显了西方国家所走的现代化是错误的。
答案：错

458. 马克思主义行、中国特色社会主义好归根结底是因为中国共产党能。
答案：错

459. 自信自强是伟大建党精神的内容之一。
答案：错

460. 当下，我国全面依法治国总体格局基本形成。
答案：对

461. “中国梦”是全体中国人民的梦，就是要实现社会主义现代化和中华民族伟大复兴。
答案：对

462. 实现“中国梦”必须坚定不移地走中国特色社会主义道路。
答案：对

463. 十八大报告中提出，建设中国特色社会主义，总依据是社会主义初级阶段，总布局是五位一体，总任务是实现社会主义现代化和中华民族伟大复兴。
答案：对

464. 中国特色社会主义是实现中华民族伟大复兴的必由之路。
答案：对

465. 中国共产党第二十次全国代表大会，是在全党全国各族人民迈上全面建设社会主义现代化国家新征程、向第二个百年奋斗目标进军的关键时刻召开的一次十分重要的大会。
答案：对

466. 我们经过接续奋斗，实现了小康这个中华民族的千年梦想，打赢了人类历史上规模最大的脱贫攻坚战，全国八百三十二个贫困县全部摘帽，近一亿农村贫困人口实现脱贫，九百六十多万贫困人口实现易地搬迁。
答案：对

467. 未来五年是全面建设社会主义现代化国家开局起步的关键时期。
答案：对

468.我们推进的现代化，是中国共产党领导的社会主义现代化，必须坚持以中国式现代化推进中华民族伟大复兴。
答案：对

469.建成社会主义现代化强国的战略安排是：从2020年到本世纪中叶，在全面建成小康社会的基础上，分三步走全面建成社会主义现代化强国。
答案：错

470. 没有全民小康，就没有全面小康。全面小康的路上，一个都不能少。
答案：对

471. 治理好我们这个世界上最大的政党和人口最多的国家，必须坚持党的全面领导特别是党中央集中统一领导，坚持民主集中制确保党始终总揽全局、协调各方。
答案：对

472. 中国共产党领导是中国特色社会主义制度的最大优势。
答案：对

473. 中国共产党领导是中国特色社会主义最本质的特征。
答案：对

474. 党是最高政治领导力量。
答案：对

475. 心怀“国之大者”，站在全局和战略的高度想问题、办事情，可以为了局部利益损害全局利益、为了暂时利益损害根本利益和长远利益。
答案：错

476. 社会治理离不开一定的组织形态。中国共产党的组织形态既推进了社会的有序治理，又保证了社会充满活力。
答案：对

477. 社区治理得好不好，关键在人民群众。
答案：错

478. 《中国共产党章程(修正案)》和宪法总纲确认了党的领导在中国特色社会主义中的地位，也就确定了党在国家治理中的核心领导地位。
答案：对

479. 中国共产党是中国特色社会主义制度的创建者。
答案：对

480.经济发展是充分发挥中国特色社会主义制度优势的根本保障。
答案：错

481. 人民是历史的制造者。
答案：错

482. 我们党的生命力来自于人民。
答案：对

483. 群众路线是党的生命线。
答案：对

484. 江山就是人民，人民就是江山，深刻揭示了国土与人民的关系。
答案：错

485. 人民是中国共产党执政兴国的最大底气。
答案：对

486. 马克思主义政党的经济基础是生产资料私有制
答案：错

487. 党的根本宗旨是促进生产力的高度发展。
答案：错

488. 人民性与党性是根本对立的。
答案：错

489. 人民的美好生活就是物质高度丰富的生活。
答案：错

490. 让老百姓过上好日子是党一切工作的出发点和落脚点。
答案：对

491. 社会主义初级阶段是一个静态、一成不变、停滞不前的阶段。
答案：错

492. 社会主义初级阶段不是一个自发、被动、不用费多大气力自然而然就可以跨过的阶段。
答案：对

493. 社会主义初级阶段是一个动态、积极有为、始终洋溢着蓬勃生机活力的过程。
答案：对

494. 社会主义初级阶段不是一个阶梯式递进、不断发展进步、日益接近质的飞跃的量的积累和发展变化的过程。
答案：错

495. 新发展理念是在深刻总结国内外发展经验教训、分析国内外发展大势的基础上形成的。
答案：对

496. 关键核心技术要得来、买得来、讨得来。
答案：错

497. 协调既是发展手段又是发展目标，同时还是评价发展的标准和尺度。
答案：对

498. 经济全球化遇到一些回头浪，开放合作已不是历史潮流，互利共赢已不是人心所向。
答案：错

499. 改革发展搞得成功不成功，最终的判断标准是国家是否实现富强。
答案：错

500. 改革开放以来，特别是加入世界贸易组织后，我国加入国际大循环，市场和资源“两头在外”，形成“世界工厂”发展模式，对我国快速提升经济实力、改善人民生活发挥了重要作用。
答案：对

501. 改革开放以来，我们遭遇过很多外部风险冲击，最终都能化险为夷，靠的就是办好国际的事、把发展立足点放在国外。
答案：错

502. 维持出口高增长、出口占国内生产总值的高比例已不大可能，必须把经济增长动力更多放在创新驱动和扩大内需特别是消费需求上。
答案：对

503. 我国经济结构调整优化的前进态势已经发展了重大变化。
答案：错

504. 当前和今后一个时期，我国经济发展面临的问题，供给和需求两侧都有，但矛盾的主要方面在需求侧。
答案：错

505. 我国供给侧结构性改革不是西方“供给学派”的翻版。
答案：对

506. 大谈“国有企业垄断论”，宣扬“国有企业与民争利”、“国企是不堪的存在”，鼓吹“私有化”、“去国有化”、“去主导化”，操弄所谓“国进民退”、“民进国退”的话题是有害的。
答案：对

507. 针对国有企业的奇谈怪论，其实只是一个简单的所有制问题，或者只是一个纯粹的经济问题。
答案：错

508. 为资本设置“红绿灯”就是限制资本的发展。
答案：错

509. 十九届三中全会开创了我国改革开放的全新局面。
答案：错

510. 改革开放是我们党的一次伟大觉醒。
答案：对

511. 我国改革进入到攻坚期和深水区。
答案：对

512. 全面深化改革是我们党赢得主动的必然要求。
答案：对

513. 全面深化改革就是经济领域的全面改革。
答案：错

514. 我国的国家治理体系和治理能力现代化跟西方的现代化是一致的。
答案：错

515. 党的集中统一领导是全面深化改革取得成功的关键。
答案：对

516. 在当前资源日益趋紧的背景下，我们应该减少开放。
答案：错

517．逆全球化是当前的时代潮流。
答案：错

518. “一带一路”倡议的主要成就是促进了经济的发展。
答案：错

519.我国社会主义民主是维护人民根本利益的最广泛、最真实、最管用的民主。
答案：对


520.人民代表大会制度是坚持党的领导、人民当家作主、依法治国有机统一的根本政治制度安排，是我国的国体。
答案：错

521.中国共产党领导的多党合作和政治协商制度是我国的一项根本政治制度，人民政协是具有中国特色的制度安排，是社会主义协商民主的重要渠道和专门协商机构。
答案：错

522.基层群众自治制度是我国的一项基本政治制度，是社会主义民主政治建设的基础和重要组成部分。
答案：对

523. 人民当家作主是社会主义民主政治的本质和核心，发展社会主义民主政治就是要体现人民意志、保障人民权益、激发人民创造活力，用制度体系保证人民当家作主。
答案：对

524. 一个国家是不是民主，应该由这个国家的政党来评判，而不应该由外部少数人指手画脚来评判。
答案：错

525. 一个国家民主不民主，关键在于是不是真正做到了人民当家作主。
答案：对

526. 人民民主是社会主义的生命，没有民主就没有社会主义，就没有社会主义的现代化，就没有中华民族伟大复兴。
答案：对

527. 中国政治制度是完美无缺的。
答案：错

528. 坚持党的领导、人民当家作主、依法治国有机统一，核心是人民当家作主。
答案：错

529. 走中国特色社会主义政治发展道路，必须坚持党的领导、人民当家作主、依法治国有机统一。党的领导是人民当家作主和依法治国的根本保证。
答案：对

530. 如果没有一系列的保障条件，全面依法治国就难以实现。要切实加强和改进党对全面依法治国的领导，提高依法执政能力和水平，为全面依法治国提供有力的政治和组织保障。
答案：对
531. 我们坚持的依宪治国、依宪执政依据的是中华人民共和国宪法，而不是其他国家的宪法。盲目地跟着西方所谓“宪政”跑，无异于削足适履，自毁长城。
答案：对

532. 全面贯彻实施地方法规，是建设社会主义法治国家的首要任务和基础性工作。
答案：错

533. 全国人大及其常委会和国家有关监督机关要担负宪法和法律监督职责，加强对宪法和法律实施情况的监督检查，健全监督机制和程序，坚决纠正违宪违法行为。
答案：对

534. 准确把握全面推进依法治国工作布局，坚持依法治国、依法执政、依法行政共同推进，坚持法治国家、法治政府、法治社会一体建设。
答案：对

535．完善的法律体系是中国特色社会主义最本质的特征，是社会主义法治最根本的保证。
答案：错

536. 把党的领导贯彻到依法治国全过程和各方面，是我国社会主义法治建设的一条基本经验。
答案：对

537. 全面依法治国就是要削弱党的领导。
答案：错

538. 党和法、党的领导和依法治国是高度统一的，法是党的主张和人民意愿的统一体现，党既领导人民制定宪法法律，也领导人民实施宪法法律，党自身必须在宪法法律范围内活动。
答案：对

539. 文化是一个国家、一个民族的灵魂。文化兴国运兴，文化强民族强。
答案：对

540. 中国特色社会主义文化是民族的科学的大众的，是面向现代化、面向世界、面向未来的。
答案：对

541. 中华优秀传统文化、革命文化和社会主义先进文化共同构建了新时代中国特色社会主义文化的基本内容。
答案：对

542. 意识形态工作是为国家立心、为民族立魂的工作。
答案：对

543. 社会主义核心价值观必须广泛借鉴世界文明成果，符合人类最美好的价值追求。
答案：对

544. “爱人者，人恒爱之;敬人者，人恒敬之”说明良好的人际关系，是建立在相互尊重的基础之上的。
答案：对

545. 社会主义核心价值体系的灵魂是马克思主义。
答案：对

546. 繁荣发展文化事业和文化产业，要坚持以市场化创作为导向。
答案：错

547. 新时代坚持依法治国和以德治国相结合，把社会主义核心价值观融入法治建设、融入社会发展、融入日常生活。
答案：对

548. 习近平在深圳经济特区建立40周年庆祝大会上指出，40年来，深圳坚持以人民为中心，人民生活水平大幅提高，教育、医疗、住房等实现翻天覆地的变化，率先完成全面建成小康社会的目标，实现了由解决温饱到高质量全面小康的历史性跨越。
答案：对

549. 加强社会治安综合治理，必须正确处理好维稳与维权、活力与秩序的关系，充分调动一切积极因素，确保社会既充满生机活力又保持安定有序。
答案：对

550. 在发展经济的基础上不断提高人民生活水平，实现人民群众对美好生活的向往，是党和国家一切工作的根本目的。
答案：对

551. 从中国共产党的百年奋斗历史来看，让老百姓过上好日子是党一切工作的出发点和落脚点。
答案：对

552. 人民对美好生活的需要仅仅在于个人收入的提高。
答案：错

553. 人民美好生活需要日益广泛，不仅对物质文化生活提出了更高要求，而且在民主、法治、公平、正义、安全、环境等方面的要求日益增长。
答案：对

554. 党的十八大以来，我国社会建设全面加强，人民生活全方位改善，社会治理社会化、法治化、智能化、专业化水平大幅度提升，发展了人民安居乐业、社会安定有序的良好局面，续写了社会长期稳定奇迹。
答案：对

555. 党的十九大明确了“坚持在发展中保障和改善民生”是新时代坚持和发展中国特色社会主义的基本方略之一，把促进GDP的提高摆在了更加突出的位置、贯穿于党中央治国理政的方方面面。
答案：错

556. 要坚持以人民为中心，把促进发展、保障民生置于突出位置，实施政策、采取措施、开展行动都要把是否有利于民生福祉放在第一位。
答案：对

557. 面对突如其来的新冠肺炎疫情，我们坚持人民至上、生命至上，开展抗击疫情人民战争、总体战、阻击战，最大限度保护了人民生命安全和身体健康，统筹经济发展和疫情防控取得世界上最好的成果。
答案：对

558. 建设社会主义生态文明，实质上是要建设以资源环境承载力为基础、以自然规律为准则、以可持续发展为目标的资源节约型、环境友好型社会。
答案：对

559. 建设社会主义生态文明，实质上是要建设以资源环境承载力为基础、以自然规律为准则、以可持续发展为目标的资源节约型、环境友好型社会。
答案：对

560. 牢固树立和践行绿水青山就是金山银山的理念，站在人与自然和谐共生的高度谋划发展。
答案：对

561. 生态环境问题归根结底是发展方式和生活方式问题。
答案：对

562. 我们这一代只需要发展经济，保护环境应该留给下一代承担。
答案：错

563. 环境保护是可持续发展的基础，保护环境的实质就是保护生产力。
答案：对

564．垃圾也是一种很有开发价值的资源。
答案：对

565. 中国的水资源非常丰富，所以中国不需要担心水污染的问题。
答案：错

566. 6月5日是世界环境日。
答案：对

567. 2020年9月中国明确提出2030年“碳达峰”与2060年“碳中和”目标。
答案：对

568. 党的领导是人民军队的根本保证。
答案：对

569. 党委、政治委员和政治机关是党从思想上政治上组织上建设和掌握部队的重要领导支撑。
答案：错

570. 创新是引领发展的第一动力，必须坚持向科技创新要战斗力，建设创新型人民军队。
答案：对

571. 军委主席负责制，是坚持党对人民军队绝对领导的核心制度，处于最高层次，居于核心和统领地位。
答案：对

572. 建设世界一流军队是党的十九大提出的强军目标。
答案：对

573. 习近平强军思想深刻回答了“新时代建设一支什么样的强大人民军队，怎样建设强大恩民军队”的时代课题。
答案：对

574. 党的十九大提出，到2020年，国防和军队建设要基本实现机械化，信息化建设取得重大进展。
答案：对

575. 政治工作是我军的最大特色、最大优势。
答案：对

576. 2019年4月23日，中国人民海军成立80周年海上阅兵活动在青岛附近海空域隆重举行。
答案：错

577. 2016年2月，我军战区军事制度改革将七大军区改为七大战区。
答案：错

578. 国家安全委员会是在十八届三中全会提出设立的。
答案：对

579. 国家安全是安邦定国的重要基石。
答案：对

580. 维护国家安全是全国各族人民根本利益所在。
答案：对

581. 国家安全的宗旨是经济安全。
答案：错

582. 国家安全的基础是经济安全。
答案：对

583. 总体国家安全观强调以军事安全为根本。
答案：错

584. 在防控新冠肺炎疫情中，新纳入国家安全体系的是应急体系安全
答案：错

585. 国家政治安全第一个标志性要素是主权独立。
答案：对

586. 坚持总体国家安全要坚持人民安全、政治安全、国家利益至上的有机统一。
答案：对

587. 国土安全是立国之基。国土的安全状态与国家能否繁荣息息相关。
答案：对

588. “一国两制”的构想是周恩来同志在会见外宾时提出的。
答案：错

589. “一国两制”制度在我国的香港、澳门和台湾地区都已经开始实行。
答案：错

590. “一国两制”是人类政治文明史上前无古人的伟大创举。
答案：对

591. “一国两制”中一国和两制具有同等重要的作用。
答案：错

592. 维护国家主权、安全、发展利益是“一国两制”方针的最高原则。
答案：对

593. “一国两制”框架内，高度自治权是固定的，不受国家全面管治权影响。
答案：错

594. 香港人口高达1000万，是我国重要的外贸，金融、文化、航运中心。
答案：错

595. 澳门主要的产业是出口加工、旅游业博彩业、金融保险业等。
答案：对

596. 香港特行政区区旗是紫荆花旗。
答案：对

597. 澳门特别行政区区旗是百合花旗。
答案：错

598. 经济全球化不是世界问题的“祸根”。
答案：对

599. 西方“普世价值”是人类共同价值。
答案：错

600. 困扰世界的很多问题是由经济全球化造成的。
答案：错

601. 中国所设想的新世界秩序将不会包括西方价值观，而是建立以中国规范、价值观和话语为核心的人类命运共同体。
答案：错

602. 人类命运共同体思想是中华历史上帝国天下观的延续，中国正在现有势力范围内建立古代“朝贡体系”的现代版本。
答案：错

603. 人类命运共同体代指以中国为中心的替代性经济、政治和安全的新全球体系。
答案：错

604. 和平、发展、公平、正义、民主、自由的全人类共同价值主张推动构建人类命运共同体，携手应对全球性风险和挑战，共同创造人类更加美好的未来。
答案：对

605. 当今世界正经历百年未有之大变局，这样的大变局不是一时一事、一域一国之变，是世界之变、时代之变、历史之变
答案：对

606. 党内存在的很多问题都同政治问题相关联，都是因为党的政治建设没有抓紧、没有抓实。
答案：对

607. 补足共产党人精神上的钙指的是要加强党的作风建设。
答案：错

608. 纪律是成文的规矩，一些未明文列入纪律的规矩不是纪律。
答案：错

609. 只要公权力存在，就必须受到制约，否则就会被滥用。
答案：对

610. “微腐败”也可能成为“大祸害”。
答案：对

611. 不管腐败分子逃到哪里，都要缉拿归案、绳之以法，体现了党中央凡逃必追、一追到底的鲜明立场。
答案：对

612. 反腐败斗争关系民心这个最大的政治，是一场输不起也决不能输的重大政治斗争。
答案：对

613. 我们党每一次自我革命，都是一次简单的自我修复。
答案：错

614. 窑洞对是1945年毛泽东与黄炎培的对话。
答案：对

615. 如何跳出治乱兴衰历史周期率，毛泽东同志给出了第一个答案，这就是只有让人民来监督政府，政府才不敢松懈。
答案：对

`;
import { pinyin } from "pinyin";
let list = text.split(/\d+(、|\.)/g);
let firstLetter = "";
let count = 0;

import fileSave from "file-save";

let file = fileSave("./data.js").write(`export const a = [`, "utf8");

for (let index = 0; index < list.length; index++) {
  const i = list[index];
  const answerRegex = /答案：|答案\:/g;
  console.log(count);
  count++;
  // if (count > 266) continue;
  var items = i.split(answerRegex);
  let str = pinyin(
    items[0]
      .split("A")[0]
      .trim()
      .slice(0, i.length > 30 ? 20 : i.length),
    {
      style: "first_letter",
      compact: true,
      heteronym: true,
    }
  );
  firstLetter = "";
  for (let i = 0; i < str.length; i++) {
    for (let j = 0; j < str[i].length; j++) {
      firstLetter += str[i][j];
    }
    firstLetter += "/";
  }
  let ans = items[0].split(/A|B|C|D|E|F|G|H/g);
  const preAns = items[1];
  console.log(items[1]);
  let composeAnswer = "";
  if (items.length > 1) {
    // 如果答案不是ABCD，是文字的话
    if (ans.length == 1) {
      items = i.split(answerRegex);
      // 如果是true或false
      file.write(
        JSON.stringify({
          topic: items[0],
          answer: preAns.replace(/true/g, "正确").replace(/false/g, "错误"),
          pinyin: firstLetter,
        }) + ","
      );
    } else {
      const reals = preAns
        .replace(/\n/g, "")
        .trim()
        .replace(/,/g, "")
        .split("");
      if (reals.length == ans.length - 1 && reals.length != 1) {
        composeAnswer = "全选";
      } else {
        for (let index = 1; index < ans.length; index++) {
          const e = ans[index];
          const pre = ["A", "B", "C", "D", "E", "F", "G"][index - 1];
          for (let realIndex = 0; realIndex < reals.length; realIndex++) {
            const real = reals[realIndex];
            if (pre == real) {
              composeAnswer += pre + e;
            }
          }
        }
      }
      file.write(
        JSON.stringify({
          topic: items[0],
          answer: composeAnswer,
          pinyin: firstLetter,
        }) + ","
      );
    }
  }
}
file.end("];").finish(() => {
  console.log("写入完成");
});
