let text = `
2023年春马克思主义中国化与青年使命担当题库

一、单选（239）
1、经过长期努力，中国特色社会主义进入了新时代，这是我国发展新的（    ）。
A、历史阶段
B、历史方向
C、历史任务
D、历史方位
答案：D
2、新我国社会主要矛盾的变化，没有改变我们对我国社会主义所处历史阶段的判断，我国仍处于并将长期处于社会主义（    ）阶段的基本国情没有变，我国是世界最大发展中国家的国际地位没有变
A、高级
B、初级
C、发达
D、落后
答案：B
3、面对新形势新任务，全面建成小康社会，进而建成富强民主文明和谐的社会主义现代化国家、实现中华民族伟大复兴的中国梦，必须在新的历史起点上全面深化（    ）。
A、开放
B、改良
C、改革
D、认识
答案：C
4、紧紧围绕使（   ）在资源配置中起决定性作用深化经济体制改革。
A、市场
B、政府
C、企业
D、计划
答案：A
5、紧紧围绕坚持（   ）核心价值体系、社会主义文化强国有机统一深化政治体制改革。
A、社会主义
B、资本主义
C、全球
D、普世
答案：A
6、紧紧围绕更好保障和改善（   ）、促进社会公平正义深化社会体制改革。
A、生活
B、民生
C、医疗
D、住房
答案：B
7、紧紧围绕建设美丽中国深化生态文明体制改革，加快建立生态文明制度，健全国土空间开发、资源节约利用、生态环境保护的体制机制，推动形成人与（   ）和谐发展现代化建设新格局。
A、动物
B、人
C、社会
D、自然
答案：D
8、全面深化改革，必须立足于我国长期处于社会主义初级阶段这个最大实际，坚持（   ）仍是解决我国所有问题的关键这个重大战略判断。
A、改革  
B、开放
C、党的建设
D、发展
答案：D
9、无论过去、现在还是未来，（   ）始终是实现中华民族伟大复兴的先锋力量！
A、青年党员
B、青年学生
C、中国青年
D、中国人民 
答案：C
10、青年的人生目标会有不同，职业选择也有差异，但只有把自己的（   ）融入祖国的大我、人民的大我之中，与时代同步伐、与人民共命运，才能更好实现人生价值、升华人生境界。离开了祖国需要、人民利益，任何孤芳自赏都会陷入越走越窄的狭小天地。
A、小我
B、理想
C、爱好
D、诉求  
答案：A
11、对每一个中国人来说，爱国是本分，也是职责，是心之所系、情之所归。对新时代中国青年来说，热爱（   ）是立身之本、成才之基。
A、人民
B、祖国
C、人类
D、事业  
答案：B
12、新时代中国青年要担当时代责任。时代呼唤担当，民族振兴是（   ）的责任。
A、政府
B、执政党
C、青年
D、人才  
答案：C
13、新时代中国青年要勇于砥砺奋斗。（   ）是青春最亮丽的底色。
A、享受;
B、奋斗
C、学习
D、躺平  
答案：B
14、新时代中国青年要练就过硬（   ）。青年是苦练本领、增长才干的黄金时期。
A、技术
B、心理素质
C、体魄
D、本领  
答案：D
15、新时代中国青年要锤炼品德修为。人无（   ）不立，品德是为人之本。
A、才
B、德
C、信
D、名  
答案：B
16、一代人有一代人的长征，一代人有一代人的（    ）。建成社会主义现代化强国，实现中华民族伟大复兴，是一场接力跑。
A、担当
B、事业
C、问题
D、困难 
答案：A
17、我们的工作还存在一些不足，面临不少困难和问题。主要有：发展不平衡不充分问题仍然突出，推进高质量发展还有许多卡点瓶颈，（    ）创新能力还不强。
A、科技
B、制度
C、管理
D、服务  
答案：A
18、从现在起，中国共产党的中心任务就是团结带领全国各族人民全面建成社会主义现代化强国、实现第二个百年奋斗目标，以（    ）全面推进中华民族伟大复兴。
A、西方式现代化
B、中国式现代化
C、现代化
D、全面现代化  
答案：B
19、全面建成社会主义现代化强国，总的战略安排是分（    ）步走：从二〇二〇年到二〇三五年基本实现社会主义现代化；从二〇三五年到本世纪中叶把我国建成富强民主文明和谐美丽的社会主义现代化强国。
A、三
B、两
C、四
D、一  
答案：B
20、坚持发扬（    ）精神。增强全党全国各族人民的志气、骨气、底气，不信邪、不怕鬼、不怕压，知难而进、迎难而上，统筹发展和安全，全力战胜前进道路上各种困难和挑战，依靠顽强斗争打开事业发展新天地。
A、学习
B、奋斗
C、拼搏
D、斗争 
答案：D
21、教育、科技、人才是全面建设社会主义现代化国家的基础性、战略性支撑。必须坚持（   ）是第一生产力、（   ）是第一资源、（   ）是第一动力。
A、科技→人才→创新 
B、人才→创新→科技 
C、创新→人才→科技 
D、人才→科技→创新 
答案：A
22、深入实施人才强国战略。培养造就大批德才兼备的高素质（    ），是国家和民族长远发展大计。
A、工程师
B、科学家
C、大学生
D、人才 
答案：D
23、大自然是人类赖以生存发展的基本条件。尊重自然、顺应自然、（    ）自然，是全面建设社会主义现代化国家的内在要求。
A、利用
B、开发
C、热爱
D、保护 
答案：D
24、（    ）是中国特色社会主义的伟大创举，是香港、澳门回归后保持长期繁荣稳定的最佳制度安排，必须长期坚持。
A、一国两制
B、宪法
C、法律
D、国家安全法 
答案：A
25、要坚持和完善“一国两制”制度体系，落实中央全面（    ），落实“爱国者治港”、“爱国者治澳”原则，落实特别行政区维护国家安全的法律制度和执行机制。
A、管理权
B、管治权
C、管辖权
D、执政
答案：B
26、中国始终坚持维护世界和平、促进共同发展的外交政策宗旨，致力于推动构建人类（    ）共同体。
A、命运
B、利益
C、理想
D、安全 
答案：A
27、全党必须牢记，全面从严（   ）永远在路上，党的自我革命永远在路上。
A、治理
B、治国
C、管理
D、治党 
答案：D
28、（   ）就是力量，团结才能胜利。全面建设社会主义现代化国家，必须充分发挥亿万人民的创造伟力。
A、团结
B、知识
C、创新
D、科技 
答案：A
29、（   ）强，则国家强。当代中国青年生逢其时，施展才干的舞台无比广阔，实现梦想的前景无比光明。
A、民族
B、科技
C、青年
D、政府 
答案：C
30、全党全军全国各族人民要紧密团结在党中央周围，牢记空谈误国、（   ）兴邦，坚定信心、同心同德，埋头苦干、奋勇前进，为全面建设社会主义现代化国家、全面推进中华民族伟大复兴而团结奋斗。
A、团结
B、实干
C、科技
D、青年 
答案：B
31、在整个过渡时期我国要实现“一化三改”。“一化”即（    ），就是要发展生产力。
A、社会主义农业化 
B、社会主义工业化
C、信息化
D、现代化
答案：B
32、在整个过渡时期，新中国仅仅用了（  ）年时间，就完成了对农业、手工业和资本主义工商业的社会主义改造，使中国从新民主主义社会跨入了社会主义社会。
A、4
B、5
C、6
D、7
答案：A
33、（    ）10月19日，中国人民志愿军雄赳赳、气昂昂跨过鸭绿江，和朝鲜人民一道共同抗击侵略者。
A、1950年
B、1951年
C、1952年
D、1953年
答案：A
34、（    ）6月25日，朝鲜内战爆发。
A、1949年
B、1950年
C、1951年
D、1952年
答案：B
35：1950年10月初，美军不顾中国政府一再警告，悍然越过（    ），把战火烧到中朝边境。
A、中朝边境
B、鸭绿江
C、三八线
D、丹东
答案：C
36、伟大的抗美援朝精神，是中国共产党人和人民军队崇高风范的生动写照，是中华民族传统美德和民族品格的集中展示，是以为（    ）核心的民族精神的具体体现。
A、国际主义
B、英雄主义
C、爱国主义
D、人道主义
答案：C
37、“如果我牺牲了，亲爱的母亲，不应悲痛，要明白儿的志愿是为了祖国的将来，为了祖国大规模的经济建设。”它的作者是（     ）。
A、黄继光
B、邱少云
C、杨根思
D、刘胡兰
答案：A
38、抗美援朝战争中，涌现出杨根思、黄继光、邱少云等30多万名英雄功臣和近6000个功臣集体，（   ）多名英雄儿女为了祖国、为了人民、为了和平献出了宝贵生命。
A、17万
B、18万
C、19万
D、16万
答案：C
39、在没有任何对美作战经验的条件下，（    ）依然挂帅出征，出任志愿军总司令。
A、林彪
B、聂荣臻
C、彭德怀
D、粟裕
答案：C
40、伟大的国际主义战士（    ），为营救朝鲜落水儿童牺牲，成为弘扬国际主义的一面旗帜。
A、黄继光
B、杨根思
C、邱少云
D、罗盛教
答案：D
41、以（   ）带领的1205钻井队为代表的大庆石油人，为了国家民族的利益奉献牺牲，用自己的忠诚担当和鲜血汗水兑现着“我为祖国献石油”的爱国誓言。
A、王进喜
B、刘成刚
C、王启民
D、刘国豪
答案：A
42、20世纪60～70年代中国以加强（   ）为中心的战略大后方建设--三线建设，是国防建设和国家经济建设的重要组成部分。
A、工业化
B、国防
C、现代化
D、制造业
答案：B
43、60多年前，（   ）北大荒的建设者们在这片神奇的土地上，共开垦出3600多万亩良田，建成了中国规模最大、现代化程度最高、综合生产能力最强的国有农场群，将（   ）多平方公里的漠漠大荒建成了名闻遐迩、举世瞩目的现代化农业的黑龙江垦区。
A、近百万，5万
B、50万，2万
C、80万，5万
D、60万，2万 
答案：A
44、在长达六十多年北大荒艰苦创业的岁月里，有（    ）多转业官兵、支边青年、知识分子、知识青年永远长眠在北大荒。
A、2万
B、3万
C、4万
D、5万 
答案：D
45、红旗渠动工于1960年，勤劳勇敢的30万林州人民，苦战10个春秋，仅仅靠着一锤，一铲，两只手，在太行山悬崖峭壁上修成了这全长（    ）公里的红旗渠。
A、500
B、1000
C、1500 
D、2000 
答案：C
46、（   ）年，中国研制的第一颗原子弹爆炸成功。
A、1964
B、1965
C、1966
D、1967
答案：A
47、（   ）年，中国第一颗氢弹空爆试验成功。
A、1964
B、1965
C、1966
D、1967
答案：D
48、（   ）年，中国“东方红”1号人造地球卫星发射成功。
A、1964
B、1965
C、1970
D、1967
答案：C
49、万里长征是指:（    ）年10月，中国工农红军主力从长江以南各革命根据地，向陕甘革命根据地会合的战略转移，于（   ）年10月，红二、四方面军到达甘肃会宁地区,同红一方面军会师。。
A、1934，1935
B、1935，1936
C、1934,1937
D、1934,1936
答案：D
50、万里长征的主要指挥者是（   ），在两年的时间里，中国工农红军辗转十四省，突破几十万敌军的围追堵截，创造了人类历史上的奇迹。
A、毛泽东
B、周恩来
C、朱德
D、林彪
答案：A
51、（    ）会议是中国共产党和工农红军历史上一个伟大的转折点，是中国共产党从幼稚走向成熟的标志。
A、遵义
B、延安
C、西柏坡
D、毛尔盖
答案：A
52、中国航天科技事业的先驱和杰出代表，被誉为“中国航天之父”和“火箭之王”的是（    ）。
A、赵九章
B、钱学森
C、邓稼先
D、钱三强
答案：B
53、提出“中国发展人造卫星要走自力更生的道路，要由小到大，由低级到高级”的重要建议的是（    ）。
A、钱学森
B、赵九章
C、邓稼先
D、钱三强
答案：B
54、党的（  ）报告提出，我国社会主要矛盾已经转化为人民日益增长的美好生活需要和不平衡不充分的发展之间的矛盾。
A、十七大 
B、十八大 
C、十九大 
D、二十大
答案：C
55、新时代社会主要矛盾变化，反映了人民需要的新期待，其深层的内在动因，就是时代对（  ）发展提出了新要求。
A、生产关系 
B、生产力 
C、经济基础 
D、上层建筑
答案：B
56、对经济结构进行全面深刻调整，需求结构要转变，降低依靠投资拉动增长的比重，提升（  ）拉动增长的比重，使国内需求成为增长的主动力。
A、消费  
B、教育 
C、出口 
D、制造业
答案：A
57、社会主义发展的根本目标就是满足（  ）的需要。我国社会主要矛盾变化，表明新时代人民群众的需要发生了重大变化，指向了“美好生活需要”这一更高标准。要达到这个更高标准，就要全面提升发展要求和目标。
A、人民群众
B、少数群体
C、干部群体
D、经济发展
答案：A
58、新时代社会主要矛盾变化，也凸显了加快国家（   ）体系变革的紧迫性。面对国内外形势的变化、面对经济社会发展的要求、面对当今世界日趋激烈的国际竞争，我们要实现社会和谐稳定、国家长治久安，就必须加快提高解决社会矛盾的能力和水平。
A、文化 
B、经济
C、发展
D、治理
答案：D
59、社会（ ）矛盾是一个国家在一定历史时期或发展阶段的多种矛盾中起着支配性作用的矛盾，是影响和制约一定时期一个国家发展的决定性矛盾。
A、主要 
B、次要
C、支配
D、经济
答案：A
60、社会主要矛盾表现为（  ），是剩余产品出现、私有制形成、阶级斗争成为历史发展动力的必然结果，是社会生产力得到高度发展、阶级消灭之前的必经阶段。
A、资源与消耗的矛盾 
B、经济发展与环境保护的矛盾
C、阶级矛盾
D、供给与需求的矛盾
答案：C
61、社会主义社会作为人类社会一种崭新的社会形态，人民当家作主，成为公有制的主人，成为国家的主人，（  ）不仅是生产力的主体，而且是生产关系和上层建筑的主体。
A、机器 
B、国家
C、市场
D、人民
答案：D
62、（  ）是一个政党制定路线、开辟道路、形成战略的基本依据。
A、社会主要矛盾 
B、社会次要矛盾
C、个别人的意志
D、国家经济发展
答案：A
63、党的（  ）正确作出了“我们国内的主要矛盾，已经是人民对于建立先进的工业国的要求同落后的农业国的现实之间的矛盾，已经是人民对于经济文化迅速发展的需要同当前经济文化不能满足人民需要的状况之间的矛盾”的判断。
A、一大 
B、二大
C、七大
D、八大
答案：D
64、党的（ ）实现了党和国家工作重心的转移，实现了从“以阶级斗争为纲”到以经济建设为中心的根本性转折。
A、十一届三中全会 
B、八大 
C、十九大 
D、二十大
答案：A
65、党的十一届六中全会在党的八大认识的基础上，将我国社会主要矛盾进一步表述为“在社会主义改造基本完成以后，我国所要解决的主要矛盾，是人民日益增长的物质文化需要同落后的（  ）之间的矛盾”。由此党和国家的工作重心必须转移到以经济建设为中心的社会主义现代化建设上来。
A、社会发展
B、经济发展 
C、社会生产 
D、生产力
答案：C
66、改革开放以来，我国人民物质文化生活得到极大改善，物质文化生活需要得到充分满足。社会生产的迅速发展为满足人民更高物质文化需要创造了物质条件和社会条件，同时生产也促进消费，供给也创造需求，人民在物质生活方面不再满足于有饭吃、有衣穿、有房住、有车坐等，而是要求吃得健康、穿得得体、住得宽敞、坐得舒适等。人是多重属性的人，人的需要是展开的过程，人的（  ）发展是人的本质要求。
A、全面
B、个性 
C、健康 
D、文化
答案：A
67、即使现在我国是世界第（ ）大经济体、制造业第一大国、货物贸易第一大国、商品消费第二大国、外资流入第二大国，但“两个没有变”仍然是一个基本事实。从总体上看，人民日益增长的美好生活需要还不能得到普遍满足，人民生活的水平、质量和层次还有很大差距，特别是低收入人口还占人口多数，发展不平衡不充分成为重大掣肘因素。
A、一 
B、二
C、三
D、四
答案：B
68、新时代以经济建设为中心，要和（  ）统一起来，不断实现人民对美好生活的向往，让人民共享经济、政治、文化、社会、生态等方面发展成果，有更多、更直接、更实在的获得感、幸福感、安全感。
A、文化发展 
B、生态保护
C、刺激消费
D、以人民为中心
答案：D
69、（  ）是解决我国一切问题的基础和关键，无论任何时候、任何情况下，我们都不能放弃发展、放松发展，都要在继续推动发展的基础上解决新的社会主要矛盾。
A、发展 
B、生态保护
C、提升人民生活水平
D、刺激消费
答案：A
70、“不平衡不充分的发展”，这一判断既反映了我国的生产力水平仍然存在较大提升空间，又准确概括了当前中国发展格局和生产状况中比较突出的结构性矛盾。（  ）是“不平衡”产生的客观基础。
A、不充分
B、不发展
C、生产力
D、物质基础
答案：A
71、我国一些产业已经达到世界领先水平，一些产业还处于价值链的低端。在此背景下，我国正大力推进（  ），推动传统产业提质增效、新兴产业加快发展步伐。
A、西部大开发战略
B、全面建成小康社会
C、供给侧结构性改革
D、生态环境保护
答案：C
72、我国的制造业大而不强、全而不优，绝大多数产业处于国际生产链的中低端。“made in China”产品，凭借“世界工厂”的廉价劳动力和“高投入、高排放、高污染、低质量、低效益”的粗放型方式赚取微薄利润。所以，（ ）是中国制造必须解决的关键问题，要坚持创新驱动，把创新摆在制造业发展全局的关键位置，推动产业创新力向前发展。
A、创新 
B、发展
C、投资
D、人才
答案：A
73、关于新时代社会主要矛盾的理论作为习近平新时代中国特色社会主义思想的重要组成部分，体现了我们党运用马克思主义立场观点方法，研究解决各种重大理论和实践问题，不断推进（ ）的理论担当，也体现了我们党善于驾驭复杂局面的能力和认识历史发展规律的理论品格。
A、社会经济发展
B、马克思主义中国化
C、中国特色社会主义
D、全面建成小康社会
答案：C
74、1516年（ ）写成《乌托邦》。
A、托马斯·莫尔
B、康帕内拉
C、欧文
D、圣西门
答案：A
75、1601年（  ）在狱中写成《太阳城》。
A、托马斯·莫尔
B、康帕内拉
C、欧文
D、圣西门
答案：B
76、马克思主义创始人把他们发现的（ ）运用于社会历史领域，创立了历史唯物主义。
A、辩证唯物主义
B、唯物主义
C、机械唯物主义
D、辩证法
答案：A
77、马克思主义创始人分析了资本主义社会中商品生产，揭示了隐藏在商品背后的人与人的关系，即社会关系，发现了（）。
A、唯物史观
B、剩余价值学说
C、社会主义学说
D、辩证法
答案：B
78、：（）的发表，标志着科学社会主义思想体系的创立。
A、《共产党宣言》
B、《资本论》
C、《德意志意识形态》
D、《政治经济学批判》
答案：A
79、马克思和恩格斯辞世后，（ ）继承和发展了马克思主义，在俄国领导共产主义运动，把科学社会主义推向了新的高度。
A、斯大林
B、列宁
C、赫鲁晓夫
D、安德罗波夫
答案：B
80、（ ）一声炮响，给我们传来了马克思主义。
A、俄国二月革命
B、阿根廷五月革命
C、俄国十月革命
D、法国七月革命
答案：C
81、社会主义的本质是，发展生产力，消灭剥削，消灭两极分化，最终达到（）。
A、共同富裕
B、平均富裕
C、同步富裕
D、同等富裕
答案：A
82、要坚定不移地把科学社会主义看作我们党的思想武器、精神旗帜和行动指南，不能因为个别观点被突破，就贬低科学社会主义，否定其科学价值和存在意义，要补足共产党人（）之“钙”，对马克思主义保持坚定信心、对社会主义保持必胜信念。
A、身体
B、精神
C、骨头
D、思想
答案：B
83、要积极应变和主动求变，充分发挥（）精神，在清醒认识和深入把握历史大势的基础上，紧紧抓住时代赋予的广阔发展空间和历史变革机遇，不断提高理论创新创造的能力，引领中国破解时代难题，使科学社会主义始终保持走在时代前列的品质和优势。
A、历史主动精神
B、伟大建党精神
C、红船精神
D、时代精神
答案：A
84、要想使科学社会主义在二十一世纪的中国焕发出新的蓬勃生机，必须贯通历史与现实，科学对待中华传统文化，努力实现（ ）的创造性转化、创新性发展，开创出具有中国特色、中国风格、中国气派的理论成果。
A、传统文化
B、中华文明
C、中华优秀传统文化
D、时代精神
答案：C
85、恩格斯曾经指出：“科学社会主义并不完全是（  ）的产物，而同样是国际的产物。”
A、德国
B、美国
C、法国
D、英国
答案：A
86、当前，世界百年未有之大变局加速演进，世纪疫情影响深远，世界经济复苏乏力，国际环境日趋复杂，不稳定性不确定性明显增加。我国发展进入战略机遇和风险挑战并存、不确定难预料因素增多的时期。这就要求我们坚持（  ），从世界人民的共同利益和根本福祉出发，积极务实地承担起为全人类谋解放的历史使命。
A、开放包容
B、海纳百川
C、胸怀天下
D、与时俱进
答案：C
87、“过去的一切运动都是少数人的，或者为少数人谋利益的运动。（  ）的运动是绝大多数人的，为绝大多数人谋利益的独立的运动”。
A、无产阶级
B、资产阶级
C、地主阶级
D、农民
答案：A
88、科学社会主义之所以得到中国共产党的高度认可和中国人民的大力支持，其根本原因就在于把（  ）作为根本立场，把为人民谋幸福作为根本使命，坚持全心全意为人民服务的根本宗旨。
A、无产阶级立场;
B、工人立场
C、农民立场
D、人民立场
答案：D
89、科学社会主义为人民而生、因人民而兴，始终把实现人民群众对（ ）的向往作为奋斗目标和最根本的价值旨归。
A、健康生活
B、幸福生活
C、美好生活
D、快乐生活
答案：C
90、中国共产党第二十次全国代表大会什么时候召开（ ）。
A、2017年
B、2018年
C、2019年
D、2022年
答案：D
91、（）是社会主义现代化的开创者，他明确提出，在俄国这样经济文化比较落后的国家，可以在无产阶级革命主客观条件都具备的条件下先夺取国家政权，然后在工农政权和苏维埃制度的基础上提高生产力和文化水平。
A、列宁
B、恩格斯
C、马克思
D、斯大林
答案：A
92、第一个社会主义国家什么时候建立（）
A、1917年
B、1918年
C、1919年
D、1949年
答案：A
93、中国的社会主义现代化建设开始时也曾照搬苏联模式，但（ ）以后，中国就开始以苏为鉴、探索自己的社会主义建设道路，经过艰辛探索，终于在1978年党的十一届三中全会以后开创了中国特色社会主义道路。
A、1956年
B、1960年
C、1962年
D、1949年
答案：A
94、中国用四十多年时间走完了发达国家二三百年走过的发展历程，一跃成为世界（ ）经济体，实现了全面建成小康社会的宏伟目标，创造了世所罕见的发展奇迹。
A、第一大
B、第二大
C、第三大
D、第四大
答案：B
95、（）的成功开创，使中国不仅经受住了苏东剧变的巨大冲击，而且取得了现代化建设的重大成就。
A、中国特色社会主义理论
B、中国特色社会主义制度
C、中国特色社会主义道路
D、中国特色社会主义文化
答案：C
96、党的二十大强调“高举中国特色社会主义伟大旗帜，为（）而团结奋斗”，这标志着社会主义国家的现代化建设开始进入第三个阶段，即全面建设社会主义现代化国家阶段。
A、全面建成小康社会
B、全面建设社会主义现代化强国
C、全面建设社会主义现代化国家
D、社会主义国家
答案：C
97、党的十八大以来，以习近平同志为核心的党中央坚持把马克思主义基本原理同中国具体实际相结合、同中华优秀传统文化相结合，运用辩证唯物主义和历史唯物主义的世界观和方法论，对新时代一系列重大理论和实践问题作出科学回答，创立了（ ）。
A、科学社会主义理论
B、中国特色社会主义理论
C、习近平新时代中国特色社会主义思想 
D、社会主义思想
答案：C
98、现在，全世界发达国家的人口总共只有9亿左右。中国(  )亿多人口实现现代化，将使世界上实现现代化的人口数量增加一倍以上，对世界现代化的贡献应该予以充分估计和评价。
A、12
B、13
C、14
D、15
答案：C
99、西方资本主义的现代化是( )主导的现代化，资本的本性是追求自身利益最大化，由资本主导现代化必然导致两极分化，使财富越来越集中在少数资本家的手中。
A、资本
B、人民
C、金钱
D、商品
答案：A
100、（）是全面建设社会主义现代化国家的首要任务。
A、高质量发展  
B、发展  
C、快速发展 
D、又好又快发展
答案：A
101、（）年召开十一届三中全会。
A、1956
B、1978
C、1979
D、1982
答案：B
102、邓小平（）年发表《解放思想，实事求是，团结一致向前看》讲话。
A、1956
B、1978
C、1979
D、1982
答案：B
103、解放思想，开动脑筋，实事求是，团结一致向前看，首先是（  ）。
A、解放思想
B、开动脑筋
C、实事求是
D、团结一致向前看
答案：A
104、(  )是检验真理的唯一标准。
A、理路
B、实践
C、思想
D、法律
答案：B
105、(  )，是无产阶级世界观的基础，是马克思主义的思想基础。
A、解放思想
B、实事求是
C、一切从实际出发
D、理论联系实际
答案：B
106、邓小平在解放思想，实事求是，团结一致向前看》讲话中指出：“党的领导就是要善于集中（）的正确意见，对不正确的意见给以适当解释”。
A、人民群众
B、无产阶级
C、农民
D、工人
答案：A
107、邓小平在解放思想，实事求是，团结一致向前看》讲话中指出：“为了保障人民民主，必须加强（）。”
A、法制
B、法治
C、发展
D、立法
答案：A
108、南方谈话什么时候发表。
A、1991
B、1992
C、1993
D、1984
答案：B
109、邓小平在南方谈话中讲到：“革命是解放生产力，（）也是解放生产力”。
A、改革
B、建设
C、发展
D、开放
答案：A
110、“一个中心，两个基本点”中，一个中心指（）
A、经济建设
B、精神建设
C、物质建设
D、文化建设
答案：A
111、社会主义的本质，是解放生产力，发展生产力，消灭剥削，消除两极分化，最终达到（）。
A、同步富裕
B、平均富裕
C、共同富裕  
D、同等富裕
答案：C
112、邓小平同志是全党全军全国各族人民公认的享有崇高威望的卓越领导人，伟大的马克思主义者，伟大的无产阶级革命家、政治家、军事家、外交家，久经考验的共产主义战士，（ ）的总设计师，中国特色社会主义道路的开创者，邓小平理论的主要创立者。
A、中国社会主义改革开放和现代化建设
B、中国社会主义改革
C、改革开放
D、现代化建设
答案：A
113、邓小平同志出生在四川省（ ）协兴乡牌坊村。
A、泸县
B、合江县
C、叙永县 
D、广安县
答案：D
114、党的十一届三中全会什么时候召开（）。
A、1978年12月
B、1977年12月
C、1979年12月
D、1980年12月
答案：A
115、1978年12月召开的党的十一届三中全会，重新确立了解放思想、实事求是的思想路线，停止使用“以阶级斗争为纲”的错误提法，确定把全党工作的着重点转移到(  )上来，作出实行改革开放的重大决策，实现了党的历史上具有深远意义的伟大转折。
A、改革开放
B、社会主义建设
C、社会主义现代化建设
D、现代化建设
答案：C
116、邓小平领导我们党在新中国成立以来革命和建设实践的基础上，成功走出了一条（ ）新道路。
A、中国特色社会主义
B、社会主义
C、共产主义
D、改革开放
答案：A
117、邓小平同志强调必须坚持以（ ）为中心，坚持四项基本原则，坚持改革开放，领导我们党制定了党在社会主义初级阶段的基本路线。
A、物质建设
B、经济建设
C、精神建设 
D、文化建设
答案：B
118、邓小平同志指导我们党正确认识我国所处的发展阶段和根本任务，制定了现代化建设（ ）发展战略。
A、“三步走”
B、“两步走”
C、“五步走”
D、“四步走”
答案：A
119、（），是邓小平同志一生最鲜明的政治品格，也永远是中国共产党人应该挺起的精神脊梁。
A、思想坚定
B、信念坚定
C、精神坚定
D、理想坚定
答案：B
120、邓小平同志高度关注世界和平与发展问题，提出“应当把（）问题提到全人类的高度来认识，要从这个高度去观察问题和解决问题”。
A、和平
B、发展
C、合作 
D、共赢
答案：B
121、邓小平一生（）都是因为敢于坚持真理、修正错误，每次被错误批判打倒都豁达乐观、沉着坚韧，对未来充满希望；每次复出重新回到工作岗位都无私无畏、以顽强的意志排除各种干扰，坚定不移推动正确路线方针政策的形成和实践。
A、“二落二起”
B、“三起三落”
C、“三落三起” 
D、“四落四起”
答案：C
122、邓小平创立了（）。
A、邓小平学说
B、邓小平主义
C、邓小平理论 
D、邓小平思想
答案：C
123、以社会主义核心价值观为引领，发展（     ），弘扬革命文化，传承中华优秀传统文化，巩固全党全国各族人民团结奋斗的共同思想基础，不断提升国家文化软实力和中华文化影响力。
A、社会文化    
B、传统文化    
C、社会主义先进文化
D、优秀文化 
答案：C
124、发展社会主义先进文化，不断提升国家文化软实力和中华文化影响力的路径，以下哪一项不正确（   ）。
A、坚持为人民服务、为社会主义服务
B、坚持百花齐放、百家争鸣  
C、坚持创造性转化、创新性发展
D、坚持文化封闭、保护自己传统文化
答案：D
125、弘扬以（     ）为源头的中国共产党人精神谱系，用好红色资源，深入开展社会主义核心价值观宣传教育，深化爱国主义、集体主义、社会主义教育，着力培养担当民族复兴大任的时代新人。
A、井冈山精神
B、伟大建党精神
C、社会主义先进文化
D、长征精神 
答案：B
126、实施（    ）建设工程，弘扬中华传统美德，加强家庭家教家风建设，加强和改进未成年人思想道德建设，推动明大德、守公德、严私德，提高人民道德水准和文明素养。
A、公民道德
B、社会道德
C、思想道德
D、个人道德
答案：A
127、繁荣发展文化事业和文化产业，要实施国家文化数字化战略，健全现代（     ）体系，创新实施文化惠民工程。
A、公共文化服务
B、社会文化 
C、历史文化保护   
D、文化发展
答案：A
128、党的十八大报告中，习近平总书记提出了道路自信、理论自信和制度自信三个自信，2016年,习近平总书记在庆祝建党 95 周年的大会讲话中,在“三个自信”的基础上增加了（    ）,这样“四个自信”的思想正式形成。
A、道路自信   
B、理论自信   
C、制度自信 
D、文化自信
答案：D           
129、坚定中国特色社会主义道路自信、理论自信、制度自信，说到底是要坚定（     ）。
A、道路自信
B、理论自信
C、制度自信
D、文化自信
答案：D
130、2019年7月，（     ）遗址入选《世界遗产名录》，这一实证中华5000多年文明史最直接、最有力的证据，从此受到国际社会更为广泛的关注。
A、莫高窟
B、龙门石窟
C、秦始皇兵马俑
D、良渚古城
答案：D
131、2022年第14期《求是》杂志刊发了习近平总书记的重要文章《把中国文明历史研究引向深入，增强历史自觉坚定文化自信》，文中引用清代著名思想家龚自珍的《定盦文集·续集·尊史》指出：“‘出乎史，入乎道。欲知大道，必先为（    ）。’”
A、经
B、史
C、子
D、集
答案：B
132、习近平总书记强调：“文艺创作方法有一百条、一千条，但最根本、最关键、最牢靠的办法是扎根（    ）、扎根生活。”
A、历史
B、现实
C、人民
D、文化
答案：C
133、1949年9月，作为临时宪法性质的《中国人民政治协商会议共同纲领》正式确立了“文化为（    ）服务”的指导方针。
A、人民
B、现实
C、历史
D、文化
答案：A
134、“温故而知新，可以为师矣。”出自孔子的（   ）。
A、《论语》
B、《大学》
C、《中庸》
D、《孟子》
答案：A
135、“构建人类命运共同体”是习近平外交思想的核心理念，这与中国古代（     ）理念对大同世界的追求是相通的。
A、“天人合一”
B、“经世致用”
C、“民贵君轻”
D、“大道之行也，天下为公”
答案：D
136、毛泽东坚持“（      ）”的方针，强调在对比和交流中扬长避短、吸收长处，从而完善自身，以实现民族文化的现代化与科学化。
A、百花齐放
B、百家争鸣
C、古为今用、洋为中用 
D、经世致用
答案：C
137、习近平总书记就深化中华文明探源工程进行第三十九次集体学习时强调，中华文明源远流长、博大精深，是中华民族独特的（    ），是当代中国文化的根基，是维系全世界华人的精神纽带，也是中国文化创新的宝藏。
A、精神力量
B、精神标识
C、精神财富
D、精神动力
答案：B
138、习近平强调，中华优秀传统文化是中华文明的智慧结晶和精华所在，是中华民族的（     ），是我们在世界文化激荡中站稳脚跟的根基。
A、根和魂
B、基础
C、精髓
D、根本
答案：A
139、要坚持马克思主义的根本指导思想，传承弘扬革命文化，发展社会主义先进文化，从（     ）中寻找源头活水。
A、中华文化
B、中华传统文化
C、中华优秀传统文化
D、中国特色文化
答案：C
140、（   ）关乎旗帜、关乎道路、关乎国家政治安全，决定文化前进方向和道路。
A、社会主义核心价值观
B、意识形态
C、道德观念
D、法律制度
答案：B
141、建设中国特色社会主义文化，必须建设具有强大凝聚力、引领力的社会主义意识形态，使全体人民在理想信念、价值理念、道德观念上紧紧团结在一起，巩固（    ）在意识形态领域的指导地位，牢牢掌握意识形态工作领导权。
A、马克思主义
B、儒家哲学
C、传统文化
D、西方哲学
答案：A
142、文化强国是指一个国家具有强大的文化力量。这种力量既表现为具有高度文化素养的国民，也表现为发达的文化产业，还表现为强大的（    ）。
A、精神力量
B、文化软实力
C、文化情怀
D、民族精神
答案：B
143、（    ）是一个民族赖以维系的精神纽带，是一个国家共同的思想道德基础。
A、传统文化
B、儒家哲学
C、核心价值观
D、道家哲学
答案：C
144、习近平总书记在中国共产党第十九次全国代表大会上的报告中讲到文化观时指出，人民有信仰，国家有力量，民族有（  ）。
A、能量
B、信念
C、力量
D、希望
答案：D
145、（    ）被概括为开天辟地、敢为人先的首创精神，坚定理想、百折不挠的奋斗精神，立党为公、忠诚为民的奉献精神。
A、“延安精神”
B、“红船精神”
C、“大庆精神”
D、“长征精神”
答案：B
146、文化强国是指一个国家具有强大的文化力量。这种力量既表现为具有高度文化素养的国民，也表现为发达的文化产业，还表现为强大的文化（     ）。
A、力量
B、软实力
C、动力
D、驱动力
答案：B
147、要以马克思主义为指导，坚守中华文化立场，立足当代中国现实，结合当今时代条件，走（      ）发展道路，建设中国特色社会主义文化。
A、中国传统文化
B、中国文化
C、中国特色社会主义文化
D、社会主义文化
答案：C
148、习近平总书记指出：“一个国家的综合实力最核心的还是文化（   ） ，这事关精气神的凝聚”。
A、力量
B、动力
C、软实力 
D、驱动力
答案：C
149、一个民族的复兴需要强大的物质力量，也需要强大的（   ）。没有先进文化的积极引领，没有民族精神世界的极大丰富，没有民族精神力量的不断增强，一个国家、一个民族不可能屹立于世界民族之林。
A、精神力量
B、思想动力
C、文化动能
D、创新驱动
答案：A
150、“（    ）是一个国家、一个民族的灵魂。文化兴国运兴，文化强民族强。没有高度的文化自信，就没有中华民族伟大复兴。”
A、制度
B、文明
C、文化
D、法律
答案：C
151、（     ）、中华精神是我们文化自信的源泉。
A、中华文化
B、中华历史
C、中华典故
D、中国法律
答案：A
152、中华文化之所以如此精彩纷呈、博大精深，就在于它（     ）的包容特性。
A、故步自封
B、封闭保守
C、坚守自己
D、兼收并蓄
答案：D
153、2022年5月10日，庆祝中国共产主义青年团成立（   ）周年大会在北京人民大会堂隆重举行。
A、90   
B、100  
C、110   
D、120           
答案：B
154、（   ）年5月5日，在中国共产党直接关怀和领导下，中国共产主义青年团宣告成立。
A、1922
B、1923
C、1924
D、1925     
答案：A
155、一百年来，中国共青团始终（  ）、跟党奋斗。
A、与党同呼吸
B、与党共命运
C、与党同心
D、与党在一起    
答案：C
156、中国共青团不愧为中国青年运动的先锋队，不愧为党的忠实助手和可靠（  ）！
A、后备军
B、力量
C、朋友
D 、伙伴    
答案：A
157、在庆祝中国共产党成立100周年大会上，共青团员、少先队员代表响亮喊出（  ）的青春誓言。
A、时刻准备着
B、奋勇争先
C、力争上游
D、请党放心、强国有我
答案：D
158、我们党用（   ）为团命名。
A、共产主义
B、社会主义
C、中国特色社会主义
D、马克思主义
答案：A
159、党和国家的希望寄托在（  ）身上！
A、农民
B、工人
C、青年
D、妇女
答案：C
160、习近平总书记明确提出“（  ），是中国青年运动的时代主题”。
A、努力学习
B、为实现中华民族伟大复兴的中国梦而奋斗
C、参与社会实践
D、干事创业
答案：B
161、习近平总书记亲自指导制定的《中长期青年发展规划（2016—2025年）》鲜明提出（  ）重大原则。
A、坚持党管青年
B、品学兼优
C、人才第一
D、注重实干        
答案：A
162、1953年，（   ）面向新中国第一代青年提出了“身体好、学习好、工作好”的殷切期望。
朱德
毛泽东
叶剑英
周恩来
答案：B
163、改革开放后，（   ）提出培养“有理想、有道德、有文化、有纪律”时代新人的重要要求。
A、江泽民
B、胡锦涛
C、叶剑英
D、邓小平
答案：D
164、2017年4月，在习近平总书记亲自关心和推动下，党中央、国务院出台《中长期青年发展规划（2016—2025年）》，这是新中国历史上（   ）青年发展规划，标志着中国青年发展制度体系迈上历史新台阶。
第一个
第二个
第三个
第四个
答案：A
165、（   ）专门作出《关于青年运动的决议案》，其后历次党的代表大会无不对广大青年和青年工作寄予厚望。
A、党的一大
B、党的二大
C、党的三大
D、党的四大
正确答案：C
166、“国家不可一日无青年，青年不可一日无觉醒。”这是（  ）在《晨钟报》创刊号上写下的话。
A、李大钊
B、陈独秀
C、毛泽东
D、周恩来
答案：A
167、抗战时期，受到我们党的革命精神和英勇气质的感召，无数青年将（  ）视为自己的精神家园，演绎了一段“数万知识青年赴延安”的历史画卷。
A、西柏坡
B、井冈山
C、延安
D、遵义
答案：C
168、（  ）始终是中国青年运动的领导核心。
中国国民党
中国共产党
九三学社
中国民主建国会
答案：B
169、（  ）是中国青年运动的先锋队。
A、知识分子
B、青年学生
C、共青团
D、妇联
答案：C
170、入队、（  ）、入党，是青少年追求政治进步的“人生三部曲”。
A、入伍
B、入校
C、入团
D、入伙
答案：C
171、中共八大会议上，（   ）曾指出：“青年是我们的未来，我们的一切事业的继承者。”
A、毛泽东
B、邓小平
C、周恩来
D、刘少奇
答案：B
172、习近平总书记指出：“（   ）是青春最亮丽的底色，民族复兴的使命要靠奋斗来实现。”
A、拼搏
B、学习
C、奋斗
D、流汗
答案：B
173、五四运动爆发这一年，陈独秀40岁、李大钊30岁，毛泽东（  ）岁。
A、30
B、28
C、26
D、24          
答案：C
174、（  ）形象地把青年比作“早上八九点钟的太阳”。
A、毛泽东
B、周恩来
C、李大钊
D、陈独秀
答案：A
175、纵观近代以来的历史，建立公正合理的国际秩序是人类孜孜以求的目标。从360多年前《威斯特伐利亚和约》确立的平等和主权原则，到（  ）多年前日内瓦公约确立的国际人道主义精神；从70多年前联合国宪章明确的四大宗旨和七项原则，到60多年前万隆会议倡导的和平共处五项原则，国际关系演变积累了一系列公认的原则。
A、130
B、140
C、150
D、160
答案：C
176、（  ）是数百年来国与国规范彼此关系最重要的准则，也是联合国及所有机构、组织共同遵循的首要原则。
A、主权平等
B、平等协商
C、互联互通
D、合作共赢
答案：A
177、数百年前，即使中国强盛到国内生产总值占世界（  ）的时候，也从未对外侵略扩张。
A、40%
B、30%
C、20%
D、50%
答案：B
178、世界上有（  ）多个国家和地区、2500多个民族、多种宗教。不同历史和国情，不同民族和习俗，孕育了不同文明，使世界更加丰富多彩。
A、 200
B、300
C、400
D、500
答案：A
179、中国是联合国创始成员国，是第（  ）个在联合国宪章上签字的国家
A、四
B、三
C、二
D、一
答案：D
180、2008年爆发的国际金融危机启示我们，引导经济全球化健康发展，需要加强协调、完善治理，推动建设一个开放、包容、普惠、（  ）、共赢的经济全球化，既要做大蛋糕，更要分好蛋糕，着力解决公平公正问题。
A、智慧
B、平衡
C、友善
D、统一
答案：B
181、年，中国恢复在联合国的合法席位、重返日内瓦国际机构后，逐步参与裁军、经贸、人权、社会等各领域事务，为重大问题解决和重要规则制定提供了中国方案。
A、1979
B、1973
C、1971
D、1972
答案：C
182、我们的先辈建立了联合国，为世界赢得（  ）余年相对和平。我们要完善机制和手段，更好化解纷争和矛盾、消弭战乱和冲突。
A、70
B、90
C、100
D、110
答案：A
183、今年是我国提出“一带一路”倡议（  ）周年
A、5
B、10
C、15
D、20
答案：B
184、在通信领域，中央三大电信运营商海外服务网络遍及全球（  ）余个国家；
A、40
B、50
C、60
D、70
答案：A
185、央企积极参与特高压、5G通信等领域的国际标准制定，主导发起编制电力国际标准超过（  ）项
A、50
B、60
C、80
D、100
答案：D
186、新年伊始，中国与菲律宾续签共建“一带一路”谅解备忘录，与土库曼斯坦签署共建“一带一路”谅解备忘录。截至目前，已有（  ）个国家、32个国际组织与中国签署了200余份共建“一带一路”合作文件。
A、120
B、140
C、151
D、161
答案：C
187、今年，中国将举办第（  ）届“一带一路”国际合作高峰论坛，共同总结成就、擘画下一个十年蓝图，让这条造福世界的“发展带”更加繁荣、惠及人类的“幸福路”更加宽广。
A、五
B、一
C、二
D、三
答案：D
188、“一带一路”（The Belt and Road，缩写B&R）是“丝绸之路经济带”和“（ ）”的简称，2013年9月和10月由中国国家主席习近平分别提出建设“新丝绸之路经济带”和“21世纪海上丝绸之路”的合作倡议 [1]  。
A、21世纪海上丝绸之路
B、海上丝绸之路
C、15世纪海上丝绸之路
D、13世纪海上丝绸之路
答案：A
189、一带一路旨在借用古代丝绸之路的历史符号，高举和平发展的旗帜，积极发展与沿线国家的（  ）伙伴关系，共同打造政治互信、经济融合、文化包容的利益共同体、命运共同体和责任共同体。
A、社会合作
B、文化合作
C、经济合作
D、政治合作
答案：C
190、丝绸之路是起始于古代（  ），连接亚洲、非洲和欧洲的古代陆上商业贸易路线，最初的作用是运输古代中国出产的丝绸、瓷器等商品，
A、中国
B、日本
C、蒙古
D、朝鲜
答案：A
191、陆上丝绸之路，是指西汉（前202年—8年）汉武帝派张骞出使西域开辟的以首都（  ）为起点
A、开封
B、长安
C、北京
D、广州
答案：B
192、海上丝绸之路，是指古代中国与世界其他地区进行经济文化交流交往的海上通道，最早开辟也始于（  ）时期。
A、秦汉
B、隋唐
C、唐宋
D、明清
答案：A
193、（）年10月24日，在美国旧金山签订的《联合国宪章》生效，联合国正式成立。
A、1944
B、1945
C、1946
D、1947
答案：B
194、联合国会员国现有（）个。
A、191
B、192
C、193
D、194
答案：C
195、迄今为止，人类社会已经经历了三次工业革命，即蒸汽时代、电气时代、（）。
A、信息时代
B、智能时代
C、核能时代
D、电子时代
答案：A
196、（）世纪60年代末，英国人詹姆斯·瓦特制造出人类第一台有实用价值的蒸汽机
A、19
B、20
C、18
D、17
答案：C
197、在蒸汽机之后，19世纪60年代，美国又实现了电力的广泛使用，并且开始使用第二种化石能源——（），这就进一步拉大了与非西方的差距。
A、液化气
B、煤炭
C、天然气
D、石油
答案：D
198、（）年前的地理大发现，使得人类开始从农业时代向工业时代迈进，工业文明开始取代农业文明。
A、400
B、500
C、600
D、700
答案：B
199、“修昔底德陷阱”这个概念由美国学者格雷厄姆·艾利森（Graham Allison）于（）年提出，源自修昔底德的著作《伯罗奔尼撒战争史》中论述的内容。
A、2010
B、2011
C、2012
D、2013
答案：C
200、虽然有学者统计过，自1500年以来，在15次大国权力转移中，有（）次是因为陷入安全困境而开始，并以战争的形式解决问题的
A、11
B、12
C、13
D、14
答案：A
201、（）年前的地理大发现，使得人类开始从农业时代向工业时代迈进，工业文明开始取代农业文明。
A、400
B、500
C、600
D、700
答案：B
202、党的二十大报告鲜明地将推动构建人类命运共同体归结为新时代（）个方面的伟大变革之一。
A、14
B、15
C、16
D、17
答案：C
203、2013年习近平主席在（）国际关系学院阐明命运共同体理念
A、莫斯科
B、纽约
C、巴黎
D、伦敦
答案：A
204、2015年习近平主席在联合国成立（）周年峰会上对人类命运共同体理念的主要内涵进行阐释
A、40
B、50
C、60
D、70
答案：D

205、要树立尊重自然、顺应自然、保护自然的生态文明理念，增强（   ）的意识。
A、金山银山不如绿水青山      
B、绿水青山就是金山银山
C、金山银山就是绿水青山      
D、绿水青山胜过金山银山
答案：B
206、加快构建生态文明体系，确保到（    ）美丽中国目标基本实现。
A、2020年       
B、2025年
C、2030年      
D、2035年
答案：D 
207、人因自然而生，人与自然是一种(   )。 
A、利用关系 
B、共生关系 
C、敌对关系
D、生存关系
答案：B
208、习近平“两山论”的突出贡献是（  ）
A、马克思主义生产力观的新成果 
B、马克思主义唯物史观的新成果 
C、马克思主义文明观的新成果 
D、马克思主义世界观的新成果
答案：A
209、(   )是一个系统整体，山水林田湖草沙构成相依共存、有机关联的生命共同体。 
A、生产力 
B、生物多样性 
C、生态系统 
D、自然生态观
答案：C 
210、 五四运动的导火线是（      ）。 A、 北洋军阀的反动统治
B、 十月革命的影响
C、 无产阶级力量的壮大
D、 巴黎和会上中国外交的失败 答案：D
211、 新民主主义革命的开端是（    ）。 A、 鸦片战争 B、 辛亥革命 C、 太平天国运动 D、 五四运动 答案：D 212、 中国共产党为集中力量领导工人运动而成立的领导机关是（       ）。 A、 上海共产主义小组 B、 中国同盟会 C、 北京共产主义小组 D、 中国劳动组合书记部 答案：D
213、 中国无产阶级产生于（      ）。 A、 19世纪四五十年代 B、 第二次鸦片战争以后 C、 19世纪六七十年代 D、 洋务运动以后 答案：A
214、五四运动是中国近代史上一次彻底的反帝反封建的爱国运动，这里的“彻底”指的是（      ）。
A、 完成了反帝反封建的任务
B、 不达目的不罢休的精神
C、 学生在斗争中充当了先锋
D、 工人阶级登上政治舞台
答案：B
215、 对京汉铁路工人罢工进行镇压并酿成惨案的军阀是（      ）。 A、 张作霖 B、 吴佩孚 C、 段祺瑞 D、 冯国璋 答案：B
216、 下列文章中，比较全面地介绍马克思主义的是（       ）。
A、 《庶民的胜利》
B、 《布尔什维主义的胜利》
C、 《青春》
D、 《我的马克思主义观》
答案：D
217、 五四运动的发源地是（      ）。 A、 北京 B、 青岛 C、 天津 D、 上海 答案：A
218、 1919年6月初以后，五四运动的中心是。 A、 上海 B、 天津 C、 北京 D、 长沙 答案：A
219、 袁世凯死后，中国出现军阀割据局面的社会根源是（      ）。 A、 半殖民地半封建的社会性质 B、 军阀拥有武装 C、 帝国主义扶植军阀 D、 军阀派系之间的矛盾 答案：A
220、 一战期间，中国民族工业发展最快的是（      ）。 A、 化工和火柴 B、 纺织和面粉 C、 造纸和纺织 D、 榨油和制瓷 答案：B
221、 1915年9月，陈独秀在上海创办了（      ），掀起了提倡民主与科学的新文化运动。 A、 《青年杂志》 B、 《每周评论》 C、 《向导》周报 D、 《新青年》 答案：A 222、 1917年俄国十月革命后，（    ）率先在中国大地上举起马克思主义大旗。 A、 李大钊 B、 毛泽东 C、 李汉俊 D、 陈独秀 答案：A
223、 近代中国的社会性质是（       ）。 A、 半殖民地社会 B、 半封建社会 C、 半殖民地半封建社会 D、 不完全的殖民地社会 答案：C
224、 五四运动开始登上历史舞台的阶级是（       ）。 A、 农民阶级 B、 地主阶级 C、 资产阶级 D、 工人阶级 答案：D
225、 下列各项，不属于五四运动取得的重要成果的是（      ）。  A、 废除“二十一条” B、 北洋军阀释放被捕学生 C、 罢免曹汝霖等卖国贼的职务 D、 拒绝在对德“和约”上签字 答案：A 226、五四运动促进了马克思主义与中国工人运动的结合，标志着（      ）。  A、 近代化的开端 B、 中国民主革命的开始 C、 中国新民主主义的开端 D、 近代史的开端 答案：C 227、 在1840年至1919年期间，比较完全意义上的资产阶级民主革命是（      ）。 A、 辛亥革命 B、 戊戌维新运动 C、 太平天国革命 D、 义和团运动 答案：A
228、 北京学生的爱国行为，得到全国各地的积极响应，下列行为不属于各地学生声援北京学生的行动的是（      ）。 A、 举行罢课游行 B、 火烧赵家楼 C、 痛陈国耻 D、 抵制日货 答案：B
229、 将五四运动作为新民主主义革命开端的最主要依据是（      ）。 A、 俄国十月革命的影响 B、 无产阶级登上历史舞台 C、 先进知识分子起了重要作用 D、 提出“外争国权、内惩国贼”的口号 答案：B
230、 新文化运动对中国革命产生的最深刻的影响是（      ）。  
A、 动摇封建思想的统治地位 B、 弘扬了民主和科学，推动了自然科学发展 C、 对五四运动的爆发起了宣传作用 D、 后期传播社会主义思想，成为知识分子拯救国家改造社会的思想武器
答案：D
231、 在20世纪第二个十年，堪称中国历史转折之里程碑的是（      ）。 
A、 武昌起义、中华民国建立 
B、 《新青年》创办、武昌起义 
C、 五四运动、《新青年》创办 
D、 中华民国建立、五四运动 答案：D
232、 前期新文化运动与资产阶级改良派、革命派思想相比，就其作用而言，主要“新”在（      ）。 A、 传播了资产阶级民权平等思想 B、 动摇了封建正统思想的统治地位 C、 绝对肯定了西方文化的进步性 D、 深入研究和传播了马克思主义 答案：B
233、 五四运动爆发的根本原因是（      ）。 
A、 十月革命的影响和“一战”的推动 
B、 巴黎和会外交的失败 
C、 新文化运动促成中国人民新的觉醒 
D、 中国人民与帝国主义、封建主义之间矛盾的加深 答案：D
234、 不符合五四爱国运动6月3日以后史实的是（       ）。 
A、 火烧曹汝霖住宅 
B、 无产阶级成为运动主力 
C、 运动中心从北京转移到上海 
D、 上海等城市举行罢工 答案：A
235、 最能体现五四运动性质的口号是（      ）。 
A、 废除“二十一条” 
B、 还我青岛 
C、 外争国权，内惩国贼 
D、 拒绝在和约上签字
答案：C
236、五四运动中心转移到上海后，成为全国性的爱国运动说明（      ）。
A、 五四运动具有反帝反封建的性质
B、 上海市最早出现工人罢工的城市
C、 工人阶级充分发挥领导作用
D、 五四运动具有广泛的群众基础
答案：D
237、我们要弘扬五四精神，其精神核心是（      ）。
A、 爱国主义
B、 民族主义
C、 国际主义
D、 人文主义
答案：A
238、下列哪条口号最能体现五四爱国运动性质的是（       ）。
A、 胶州亡矣，山东亡矣，国将不国矣！
B、 外争国权，内惩国贼！
C、 誓死力争，还我青岛！
D、 取消“二十一条”
答案：B
239、最早发起五四运动的高等学府是（      ）
A、北京大学
B、南开大学
C、清华大学
D、武汉大学

二、多选（104）
1、中国特色社会主义新时代是怎样的时代？（    ）。
A、承前启后、继往开来、在新的历史条件下继续夺取中国特色社会主义伟大胜利的时代  
B、决胜全面建成小康社会、进而全面建设社会主义现代化强国的时代 
C、全国各族人民团结奋斗、不断创造美好生活、逐步实现全体人民共同富裕的时代 
D、全体中华儿女勠力同心、奋力实现中华民族伟大复兴中国梦的时代；E 我国日益走近世界舞台中央、不断为人类作出更大贡献的时代
答案：ABCDE
2、新时代我国社会主要矛盾已经转化为人民日益增长的（    ）和（    ）之间的矛盾。
A、美好生活需要
B、不平衡不充分的发展
C、物质生活需要、
D、落后生产力
答案：AB
3、全面深化改革的总目标是（    ）完善和发展中国特色社会主义制度，推进国家治理体系和治理能力现代化。
A、破除各方面体制机制弊端 
B、完善和发展中国特色社会主义制度 
C、推进国家治理体系和治理能力现代化 
D、让发展成果更多更公平惠及全体人民
答案：BC
4、紧紧围绕坚持（   ）、（   ）、（   ）有机统一深化政治体制改革。
A、依法行政
B、党的领导
C、人民当家作主
D、依法治国
答案：BCD
5、紧紧围绕提高（   ）执政、（   ）执政、（   ）执政水平深化党的建设制度改革。
A、科学
B、民主
C、依法
D、长期
答案：ABC
6、我们要建设的世界一流大学是中国特色社会主义的一流大学，我国社会主义教育就是要培养（   ）（   ）（   ）（   ）（   ）全面发展的社会主义建设者和接班人。
A、德
B、智
C、体
D、美
E、劳
答案：ABCDE
7、在清华大学建校110周年校庆日即将来临之际，习近平总书记来到清华大学考察时勉励青年大学生，要（   ）（   ）（   ）（   ）全面发展的社会主义建设者和接班人。
A、爱国爱民
B、锤炼品德
C、勇于创新
D、实学实干 
答案：ABCD
8、新时代中国青年运动的主题，新时代中国青年运动的方向，新时代中国青年的使命，就是坚持（   ）领导，同人民一道，为实现（   ）奋斗目标、实现（   ）的中国梦而奋斗。
A、中国共产党
B、两个一百年
C、中华民族伟大复兴
D、全面小康  
答案：ABC
9、新时代中国青年要自觉树立和践行社会主义核心价值观，自觉抵制（   ）主义、（   ）主义、（   ）主义、（   ）主义等错误思想。
A、拜金
B、享乐
C、极端个人
D、历史虚无 
答案：ABCD
10、我们要坚持走中国特色社会主义法治道路，全面推进科学立法、严格（   ）、公正（   ）、全民（   ），全面推进国家各方面工作法治化。
A、执政
B、执法
C、司法
D、守法 
答案：BCD
11、三大改造，即中华人民共和国建立后，中国共产党领导的对（     ）的社会主义改造。
A、农业
B、手工业
C、资本主义工商业
D、工业
答案：ABC
12、危急关头，应朝鲜党和政府的请求，中共中央和毛泽东同志高瞻远瞩，审时度势，作出了（   ）的历史性决策。
A、抗美援朝
B、保家卫国
C、主动出击
D、拒美击韩
答案：AB
13、大三线建设是中国国家战略后方基地的建设，是三线建设的主要部分，建设内容是建立以（      ）为主体，包括交通运输、邮电通信的中国国家战略后方基地的建设。
A、国防工业
B、基础工业
C、重工业
D、制造业
答案：AB
14、什么是北大荒精神指的是：（      ）。
A、艰苦奋斗
B、勇于开拓
C、顾全大局
D、无私奉献
答案：ABCD
15、北大荒的无私奉献精神主要体现在以下几个方面:
A、家庭的奉献
B、事业的奉献
C、青春的奉献
D、生命的奉献 
答案：BCD
16、红旗渠精神的内涵是（    ）。
A、自力更生
B、艰苦创业
C、团结协作
D、无私奉献 
答案：ABCD
17、两弹一星”工程是中国于20世纪50～60年代组织实施的，以研制（         ）为主要内容的重大国防工程。
A、导弹
B、原子弹
C、科学试验卫星
D、航天飞机
答案：ABC
18、“两弹一星”精神是（     ）精神的生动体现。
A、爱国主义
B、集体主义
C、社会主义
D、科学
答案：ABCD
19、社会主要矛盾变化体现了新时代的新标志。马克思在《资本论》第一卷中明确讲到，“各种经济时代的区别，不在于生产什么，而在于怎样生产，用什么劳动资料生产”。（  ）和（  ）是划分经济时代的主要标志。
A、社会生产力发展水平 
B、上层建筑 
C、生产力性质 
D、人民生活幸福感
答案：AC
20、经过新中国成立以来特别是改革开放40多年来的发展，我国社会生产力水平总体上显著提高，社会生产能力在很多方面进入世界前列，更加突出的问题是发展（ ），这已经成为满足人民日益增长的美好生活需要的主要制约因素。
A、能力提升 
B、不平衡 
C、不充分 
D、停滞
答案：BC
21、如若要化解发展不平衡不充分这个制约因素，关键是要促进社会生产力的新跃升，大力提升发展的质量和效益，加快转向（ ），把(  )推向发展新境界。这是中国特色社会主义进一步发展的必然选择，也是新时代的内在根据和重要标志。
A、高质量发展 
B、中国特色社会主义 
C、GDP指标提升 
D、经济发展
答案：AB
22、习近平总书记指出：“我国社会主要矛盾的变化是关系全局的历史性变化，对党和国家工作提出了许多新要求。”这里，全局性表明这一变化是(  )、(  )、(  )，历史性表明这一变化是长期积累而形成的、根本性的、不可逆的。这一变化对党和国家工作产生深刻影响。
A、全面的 
B、片面的 
C、系统的 
D、全方位的
答案：ACD
23、习近平总书记指出：“我国社会主要矛盾的变化是关系全局的历史性变化，对党和国家工作提出了许多新要求。”这一变化要求全面调整经济结构。新时代社会主要矛盾从经济方面看，就是（   ）落后于（  ）的发展。
A、生产力 
B、外贸需求 
C、经济结构 
D、市场需求
答案：CD
24、对经济结构进行全面深刻调整，产业结构要转变，提升（  ）的比重，使（   ）成为经济增长的强劲动力。
A、服务业  
B、第三产业 
C、工业 
D、第二产业
答案：AB
25、对经济结构进行全面深刻调整，发展动力要转变，降低人力、资源投入推动经济增长的比重和环境消耗，提升（  ）和（  ）推动经济增长的比重，实现可持续增长。
A、农业  
B、投资 
C、技术进步 
D、内需
答案：CD
26、理念是行动的先导，发展实践都是由发展理念来引领的。发展理念从根本上决定着发展方向和成效。“五大发展理念”是我们党针对发展中的突出问题提出来的，集中反映了正确认识和处理新时代社会主要矛盾的根本要求，反映了解决不平衡不充分问题的基本途径。要全面贯彻新发展理念，统筹推进“五位一体”总体布局，协调推进“四个全面”战略布局，按照（  ）的要求，全面推进物质文明、精神文明、政治文明、社会文明、生态文明协调发展。
A、创新
B、协调
C、绿色
D、开放
E、共享
答案：ABCDE
27、社会主要矛盾始终是依据人民（ ）与（  ）的关系确立的。在过去很长一个时期，我国社会主要矛盾都是人民日益增长的物质文化需要同落后的社会生产之间的矛盾，这是符合我国实际情况的正确判断。中国特色社会主义进入新时代，我国社会需求和社会生产都发生了巨大变化。
A、生产 
B、消费
C、需要
D、供给
答案：CD
28、社会主义发展客观上要求（ ）和（ ）。邓小平同志说过，搞改革开放和现代化建设，光有经济建设一手搞得好还不行，要坚持“两手抓，两手都要硬”，不仅要建设高度的物质文明，而且要建设高度的精神文明。
A、单一 
B、全面
C、平均
D、平衡
答案：BD
29、习近平总书记指出，“发展必须是遵循（ ）的科学发展，必须是遵循（ ）的可持续发展，必须是遵循（  ）的包容性发展”“着力提高发展的协调性和平衡性”。正确认识和处理社会主要矛盾，必须全面贯彻创新、协调、绿色、开放、共享的发展理念，在实践上要统筹兼顾、注重平衡、补齐短板，着力解决我国发展长期存在的问题，促进城乡、区域、沿海和中西部协调发展，增强发展的平衡性、包容性、可持续性，不断形成平衡发展结构，增强发展后劲，提升发展的整体效能，促进经济社会持续健康发展。
A、经济规律 
B、自然规律
C、社会规律
D、个人意志
答案：ABC
30、习近平总书记强调，要“坚持发展地而不是静止地、全面地而不是片面地、系统地而不是零散地、普遍联系地而不是单一孤立地观察事物，准确把握客观实际，真正掌握规律，妥善处理各种重大关系”。这就要求我们在认识和处理社会主要矛盾时，坚持用（ ）的观点和方法推动对矛盾的认识和处理。只有这样，才能总揽社会矛盾全局，协调各方矛盾的解决。
A、片面 
B、系统
C、普遍联系
D、静止
答案：BC
31、社会主要矛盾来自社会基本矛盾，（  ）和（  ）、（  ）和（ ）的矛盾，决定社会的基本性质。
A、生产力 
B、生产关系
C、经济基础
D、上层建筑
答案：ABCD
32、新民主主义革命时期，我们党准确认识中国半殖民地半封建社会的性质，作出了近代中国社会的主要矛盾是（  ）和（  ）的矛盾、（  ）和（  ）的矛盾的正确判断。因此，“伟大的近代和现代的中国革命，是在这些基本矛盾的基础之上发生和发展起来的”。新民主主义革命的道路和纲领，都是以此为依据确立的。
A、帝国主义 
B、中华民族
C、封建主义
D、人民大众
答案：ABCD
33、从人民需要的变化看，人民日益增长的物质文化需要已经转化为人民日益增长的美好生活需要，人民生活需要领域拓展、层次提升。人民生活需要覆盖各个领域，除了（  ）需要之外，还有（  ）、（  ）、（  ）等领域的需要。
A、物质文化生活 
B、政治生活
C、社会生活
D、生态文明
答案：ABCD
34、新时代的发展不平衡，主要表现在（ ）。
A、城乡区域发展不平衡
B、居民生活水平不平衡
C、基本公共服务提供不平衡
D、教育资源平均分配
答案：ABC
35、党的十九大作出我国社会主要矛盾变化的重大论断，同时也强调“两个没有变”“三个牢牢”。这就要求我们深入领会(  )与(  )的关系，在新的历史方位基础上把握社会主义初级阶段，并且在解决新的社会主要矛盾过程中走出社会主义初级阶段。
A、社会主要矛盾变化
B、社会主义初级阶段
C、社会次要矛盾变化
D、中国特色社会主义
答案：AB
36、习近平总书记在庆祝改革开放40周年大会上的讲话中强调的：“我们要坚持党的基本路线，把以（ ）为中心同坚持( )、坚持( )这两个基本点统一于新时代中国特色社会主义伟大实践，长期坚持，决不动摇。”
A、经济建设 
B、四项基本原则
C、生态保护
D、改革开放
答案：ABD
37、要在坚决贯彻新发展理念中着力解决发展不平衡不充分问题，依靠(  )解决发展动力问题，依靠(  )解决发展不平衡问题，依靠(  )解决人与自然和谐问题，依靠(  )解决发展内外联动问题，依靠共享发展解决社会公平正义问题。
A、创新发展
B、协调发展
C、绿色发展
D、开放发展
答案：ABCD
38、（  ）是马克思主义社会理想的精髓，社会全面进步的创造者是人民，享用者也是人民。不断满足人民日益增长的美好生活需要，实质上就是更好推动人的全面发展。
A、人的全面发展
B、人的个性发展
C、人的自由发展
D、社会全面发展
答案：A
39、党的十九大提出，新时代社会主要矛盾已转化为“人民日益增长的美好生活需要和不平衡不充分的发展之间的矛盾”，抓住了新时代中国基本国情的主要特征，是我们党坚持（ ）和（ ）的方法论而得出的正确结论。
A、辩证唯物主义
B、历史唯物主义
C、唯心主义
D、孤立片面
答案：AB
40、目前我国城乡发展和收入分配差距依然较大，城乡及城市内部的二元结构矛盾突出，并且随着城镇化的进一步发展，农村的空心化将会日趋严重。与城市的车水马龙相比，农村地区的（  ）还需进一步发展。
A、耕地种植面积
B、基础设施建设
C、公共服务水平
D、乡村治理水平
答案：BCD
41、我国作为人口大国，随着城市化的不断发展，确实存在大城市房源供不应求的情况，但居高不下的房价显然已成为政府亟待解决的问题。除却(  )等行为外，更需要加大投入的是( )、( )、(  )等民心工程，切实解决贫困和低收入人民的安家问题。
A、抑制炒房
B、经济适用房
C、公租房
D、保障房
答案：ABCD
42、19世纪空想主义主要代表人物有（  ）。
A、圣西门
B、傅立叶
C、欧文
D、托马斯·莫尔
答案：ABC
43、毛泽东思想关于（）、关于（）、关于（）、关于（）、关于（），极大地丰富了科学社会主义理论宝库。
A、革命军队的建设和军事战略
B、政策和策略
C、思想政治工作和文化工作
D、党的建设
E、社会主义建设的探索
答案：ABCDE
44、习近平总书记指出：“把（）和（）统一起来，结合新的实践不断作出新的理论创造，这是马克思主义永葆生机活力的奥妙所在。”
A、坚持马克思主义
B、发展马克思主义
C、模范马克思主义
D、照搬马克思主义
答案：AB
45、要坚持实事求是的态度，把科学社会主义看作是不断随实践的发展而发展的科学，坚决反对以“坚持”为借口而因循守旧、故步自封，防止和克服（）、（）、（）等不良倾向。
A、教条主义
B、实用主义
C、形式主义
D、实践主义
答案：ABC
46、要想使科学社会主义在中国焕发蓬勃生机，就要把马克思主义基本原理同（ ）相结合、同（ ）相结合，中华优秀传统文化是中华文明中“跨越时空、超越国度、富有永恒魅力、具有当代价值”的精华。
A、中国具体实际
B、中华优秀传统文化
C、中国国情
D、中国文化
答案：AB
47、科学社会主义是致力于实现（ ）、（ ）的伟大理论。
A、共产主义远大理想
B、解放全人类
C、社会主义理论
D、解放无产阶级
答案：AB
48、（）和（）创立了科学社会主义，论证了资本主义灭亡和社会主义胜利的历史必然性。
A、马克思
B、恩格斯
C、列宁
D、斯大林
答案：AB
49、“（ ）就是苏维埃政权加全国电气化”和“苏维埃政权+普鲁士的铁路秩序+美国的技术和托拉斯组织+美国的国民教育等等等等++=总和=（  ）”。
A、共产主义
B、社会主义
C、资本主义
D、封建主义
答案：AB
50、习近平总书记在党的二十大报告中指出，“新时代十年的伟大变革，在（）、（）、（）、（）、（）上具有里程碑意义。”
A、党史
B、新中国史
C、改革开放史
D、社会主义发展史
E、中华民族发展史
答案：ABCDE
51、习近平总书记在党的二十大报告中深入阐述了新时代中国特色社会主义思想的世界观和方法论，指出要坚持（ ）、坚持（ ）、坚持（ ）、坚持（ ）、坚持（ ）、坚持（ ）。
A、人民至上
B、自信自立
C、守正创新
D、问题导向
E、系统观念
F、胸怀天下
答案：ABCDEF
52、马克思主义的世界观和方法论是（  ）和（  ）。
A、辩证唯物主义
B、史唯物主义
C、辩证法
D、唯物论
答案：AB
53、习近平总书记在党的二十大报告中着力强调：“不断谱写马克思主义中国化时代化新篇章，是当代中国共产党人的庄严历史责任。继续推进实践基础上的理论创新，首先要把握好新时代中国特色社会主义思想的（ ）和（ ），坚持好、运用好贯穿其中的立场观点方法。”
A、世界观
B、方法论
C、历史观
D、实践论
答案：AB
54、习近平总书记在党的二十大报告中指出，中国式现代化是中国共产党领导的社会主义现代化，它既有各国现代化的共同特征，更有基于自己国情的中国特色，是（ ）的现代化，是（  ）的现代化，是（  ）的现代化，是（  ）的现代化，是（  ）的现代化。
A、人口规模巨大
B、全体人民共同富裕
C、物质文明精神和文明相协调
D、人与自然和谐共生
E、走和平发展道路
答案：ABCDE

55、中国作为世界上最大的发展中国家，在现代化建设过程中奉行（ ）、（ ）、（ ）、（ ）原则，以平等友好的态度对待发展中国家，与它们共享自己的发展成果，为它们的发展提供大量的支持和援助，这同当年西方列强和帝国主义国家对它们的侵略、欺压、掠夺形成鲜明的对比。
A、和平
B、发展
C、合作
D、共赢
答案：ABCD
56、只有（ ），（ ），（ ），（ ），我们的社会主义现代化建设才能顺利进行，我们党的马列主义、毛泽东思想的理论也才能顺利发展。
A、解放思想
B、坚持实事求是
C、一切从实际出发
D、理论联系实际
答案：ABCD
57、邓小平在《解放思想，实事求是，团结一致向前看》中讲：“我们要创造民主的条件，要重申“三不主义”：（），（），（）。”
A、不抓辫子
B、不扣帽子
C、不打棍子
D、不穿小鞋
答案：ABC
58、有了(  ) ，（ ），（ ）、（）的政治局面，小道消息就少了，无政府主义就比较容易克服。
A、又有集中又有民主
B、又有纪律又有自由
C、又有统一意志
D、又有个人心情舒畅、生动活泼
答案：ABCD
59、“（），（）”是社会主义初级阶段党的基本路线的核心内容。
A、一个中心
B、两个基本点
C、多个中心
D、多个基本点
答案：AB
60、“一个中心，两个基本点”中，两个基本点指（）
A、坚持四项基本原则
B、坚持改革开放
C、坚持社会主义
D、坚持马克思主义
答案：AB
61、计划多一点还是市场多一点，不是社会主义与资本主义的本质区别。计划经济不等于社会主义，资本主义也有计划；市场经济不等于资本主义，社会主义也有市场，（）和（）都是经济手段。
A、商品
B、货币
C、计划
D、市场
答案：CD
62、共同富裕的构想是这样提出的：（），（），（），（）。
A、一部分地区有条件先发展起来
B、一部分地区发展慢点
C、先发展起来的地区带动后发展的地区
D、最终达到共同富裕。
答案：ABCD
63、1980年5月，中共中央和国务院决定将（）、（）、（）和（）这四个出口特区改称为经济特区。
A、深圳
B、珠海
C、汕头
D、厦门
E、海南
答案：ABCD

64、邓小平马克思主义的入门老师是（）和（）。
A、《共产党宣言》
B、《共产主义ABC》
C、《资本论》
D、《德意志意识形态》
答案：AB

65、邓小平同志的一生，同中国共产党、中国人民解放军、中华人民共和国创建和发展的历史进程紧紧相连，同中国（ ）、（ ）、（ ）的历史进程紧紧相连，同中华民族抗争、独立、振兴的历史进程紧紧相连，是光辉的一生、战斗的一生、伟大的一生。
A、革命
B、建设
C、改革
D、开放
答案：ABC
66、邓小平理论的基本问题是（）
A、什么是社会主义
B、怎么建设社会主义
C、什么是发展
D、怎么发展
答案：AB
67、邓小平同志明确提出（）与（）是当代世界的两大问题。
A、和平
B、发展
C、合作
D、共赢
答案：AB
68、我们共产党人锤炼党性，首要的就是坚定（ ）远大理想和（ ）共同理想。
A、共产主义
B、中国特色社会主义
C、社会主义
D、小康社会
答案：AB
69、邓小平反复强调，要把人民拥护不拥护、赞成不赞成、高兴不高兴、答应不答应作为制定方针政策和作出决断的出发点和归宿。
A、拥护不拥护
B、赞成不赞成
C、高兴不高兴
D、答应不答应
答案：ABCD
70、党的实事求是思想路线是（）、（）、（）、（）。
A、一切从实际出发
B、理论联系实际
C、实事求是
D、在实践中检验真理和发展真理
答案：ABCD
71、邓小平强调，要把是（）、（）、（）作为判断一切工作是非得失的标准。
A、是否有利于发展社会主义社会的生产力
B、是否有利于增强社会主义国家的综合国力
C、是否有利于提高人民的生活水平
D、是否有利于促进经济发展
答案：ABC
72、社会主义的本质是：（）、（）；（）、（）、（）。
A、解放生产力
B、发展生产力
C、消灭剥削
D、消除两极分化
E、最终达到共同富裕。
答案：ABCDE
73、邓小平告诫人们：“中国的事情要按照中国的情况来办，要依靠中国人自己的力量来办。（），（），无论过去、现在和将来，都是我们的立足点。”“任何外国不要指望中国做他们的附庸，不要指望中国会吞下损害我国利益的苦果。” A、独立自主
B、自力更生
C、团结奋斗
D、勤劳勇敢
答案：AB
74、全面建设社会主义现代化国家，必须坚持中国特色社会主义文化发展道路，增强文化自信，发展（     ）的，民族的科学的大众的社会主义文化。
A、面向现代化
B、面向历史
C、面向世界
D、面向未来
答案：ACD
75、为满足人民日益增长的精神文化需求，不断提升国家文化软实力和中华文化影响力。我们要坚持（     ）基本原则。
A、坚持为人民服务、为社会主义服务
B、坚持百花齐放、百家争鸣
C、坚持创造性转化、创新性发展
D、坚持融合发展、系统观念
答案：ABC
76、实施公民道德建设工程，弘扬中华传统美德，加强家庭家教家风建设，加强和改进未成年人思想道德建设，推动（     ），提高人民道德水准和文明素养。
A、明大德
B、尊道德
C、守公德
D、严私德
答案：ACD
77、我们坚持把马克思主义基本原理同中国具体实际相结合、同中华优秀传统文化相结合，不断推动马克思主义中国化时代化，推进了中华优秀传统文化（   ）。
A、创造性转化
B、守住传统
C、现代化改造
D、创新性发展 
答案：AD
78、要坚持弘扬（    ）的文明观，以文明共存超越文明优越，弘扬中华文明蕴含的全人类共同价值，推动构建人类命运共同体。
A、平等
B、互鉴
C、对话
D、包容
答案：ABCD
79、社会主义核心价值观的基本内容包括（    ）
A、富强、民主、文明、和谐 
B、自由、民主、公正、法治  
C、爱国、敬业、诚信、友善 
答案：ABC
80、中国特色社会主义文化，源自于中华民族五千多年文明历史所孕育的中华优秀传统文化，熔铸于党领导人民在革命、建设、改革中创造的（    ）和（   ），植根于中国特色社会主义伟大实践。
A、革命文化
B、中国传统文化
C、制度文化
D、社会主义先进文化
答案：AD
81、（     ）共同构建了新时代中国特色社会主义文化的基本内容。
A、中华优秀传统文化
B、革命文化
C、物质文化
D、社会主义先进文化
答案：ABD
82、(     )是我们党梦想起航的地方。我们党从这里诞生，从这里出征，从这里走向全国执政。这里是我们党的根脉。
A、延安
B、上海党的一大会址
C、嘉兴南湖红船
D、井冈山
答案：BC
83、在《新民主主义论》中，毛泽东强调，“所谓新民主主义的文化，一句话，就是无产阶级领导的人民大众的反帝反封建的文化”，其特点就是（    ）文化。
A、民族的
B、科学的
C、历史的
D、大众的
答案：ABD
84、党的十一届三中全会以来，优秀青年群体获得的称号包括（     ）。
A、新长征突击手
B、青年岗位能手
C、青年星火带头人
D、青年文明号
答案：ABCD

85、在整个发展过程中，我们都要坚持（  ）的方针，要像保护眼睛一样保护生态环境。
A、节约优先
B、发展为主
C、保护优先
D、自然恢复为主
答案：ACD
86、绿水青山就是金山银山，阐述了（   ）的关系。
A、社会和谐
B、经济发展
C、生态环境保护
D、人类生存
答案：BC 
87、建设生态文明是关系（ ）、关乎（ ）的千年大计。
A、人民福祉
B、国家发展
C、中华民族永续发展
D、社会长治久安
答案：AC
88、加快形成绿色生活方式，增强全面（   ），培养生态道德和行为习惯。
A、节约意识
B、环保意识
C、发展意识
D、生态意识
答案：ABD 
89、人类经历了（  ），是工业文明发展到一定阶段的产物，是实现人与自然和谐发展的新要求。
A、原始文明
B、农业文明
C、工业文明
D、生态文明
答案：ABCD 
90、实现（  ）是我国向世界作出的庄严承诺，也是一场广泛而深刻的经济社会变革，绝不是轻轻松松就能实现的。
A、碳达峰
B、碳中和
C、建设美丽世界
D、构建人与自然的生命共同体
答案：AB 
91、推进生态文明建设，解决（  ）的问题，必须采取一些硬措施，真抓实干才能见效。
A、资源约束趋紧
B、经济社会发展
C、环境污染严重
D、生态系统退化
答案：ACD 
92、要加快推进（  ），开创美丽中国建设新局面。
A、绿色发展
B、循环发展
C、低碳发展
D、可持续发展
答案：ABC
93、党的二十大报告指出：“（   ），是全面建设社会主义现代化国家的内在要求。”
A、敬畏自然
B、尊重自然
C、顺应自然
D、保护自然
答案：BCD
94、坚持（  ），持续深入打好蓝天、碧水、净土保卫战。
A、精准治污
B、科学治污
C、依法治污
D、全民治污
答案：ABC
95、五四运动中喊出的口号是（     ）
A、 “外争国权，内惩国贼”
B、 “废除二十一条”
C、 “拒绝在和约上签字”
D、 “停止内战，一致对外”
答案：ABC
96、五四运动后，马克思主义在中国传播的特点有（      ）
A、 陈独秀、李大钊、胡适等进步的知识分子起了推动作用；
B、 马克思主义宣传与工人运动相结合；
C、 马克思主义战胜了其他非马克思主义；
D、 马克思主义成为新文化运动的主流。
答案：ABCD
97、早期共产党组织同反马克思主义思潮进行的论战有（       ）。 A、 同自由主义的论战 B、 同张东荪、梁启超关于社会主义的论战 C、 同无政府主义的论战 D、 同胡适围绕“问题与主义”的论战
答案：BCD
98、中国早期马克思主义思想运动的特点有（       ）。
A、重视对马克思主义基本理论的学习，拥有马克思主义者的队伍
B、明确地同第二国际的社会民主主义划清界限
C、注意从中国的实际出发，学习、运用马克思主义的理论
D、开始提出知识分子应当同劳动群众相结合的思想
答案：ABCD
99、新文化运动中，陈独秀提出“德先生”和“赛先生”口号的进步意义体现
在（       ）。
A、反对封建专制统治
B、反对愚昧，促进科学事业的发展
C、促进中国的富强
D、敢于向两千年来神圣不可侵犯的封建礼教进行自觉挑战
答案：ABCD
100、新文化运动的主要阵地有（       ）。
A、《新青年》杂志 
B、《时务报》
C、《中外纪闻》 
D、北京大学
答案：AD
101、陈独秀被毛泽东称为"五四运动的总司令"，主要因为他（       ）。
A、最早宣传十月革命和马克思主义
B、是五四以前的新文化运动的精神领袖
C、领导了新文化运动，为五四运动作了思想准备
D、联系进步青年和社团，指导和推动运动发展
答案：CD
102、五四运动与以往的民主主义革命的显著区别是（       ）。
A、有广泛的群众基础
B、促进了马克思主义在中国的传播及其与中国工人运动的结合
C、工人阶级发挥了主力军作用
D、在俄国十月革命影响下发生的
答案：ABCD
103、下列说明五四运动是中国新民主主义革命开端的是（      ）。
A、无产阶级以独立姿态登上政治舞台
B、发生在俄国十月社会主义革命之后，属于世界无产阶级革命一部分
C、是反帝反封建的群众运动
D、具有初步共产主义思想的知识分子起了领导作用
答案：ABD
104、五四运动后，马克思主义在中国传播的特点是（       ）。
A、进步知识分子起了推动作用
B、马克思主义宣传与工人运动相结合
C、马克思主义同非马克思主义展开斗争
D、马克思主义成为新文化运动的主流
答案：ABCD
`;
import { pinyin } from "pinyin";
let list = text.split(/\d+、/g);
let firstLetter = "";
let count = 0;

import fileSave from "file-save";

let file = fileSave("./data.js").write(`var a = 1;`, "utf8");

for (let index = 0; index < list.length; index++) {
  const i = list[index];

  console.log(count);
  count++;
  // if (count > 266) continue;
  var items = i.split(/答案：/g);
  let str = pinyin(i.trim().slice(0, i.length > 30 ? 20 : i.length), {
    style: "first_letter",
    compact: true,
    heteronym: true,
  });
  firstLetter = "";
  for (let i = 0; i < str.length; i++) {
    for (let j = 0; j < str[i].length; j++) {
      firstLetter += str[i][j];
    }
    firstLetter += "/";
  }
  file.write(
    JSON.stringify({
      topic: items[0],
      answer: items[1],
      pinyin: firstLetter,
    }) + ","
  );
}
file.end("\n").finish(() => {
  console.log("写入完成");
});
