let text = `
1. 甲午海战发生的年度是 ( ) 
A. 1894年
B. 1895年
C. 1931年
D. 1937年
答案：A

2. 中国公民能够快速从关西机场撤出，告诉我们，一个国家是否强大关键在于： ( ) 
A. 当你身处海外险境时祖国能第一时间把你接走
B. 护照可能有近200个国家对你免签证
C. 国家有丰富的石油资源
D. 国家GDP很高特价也很高
答案：A

3. 我军上世纪80年代就有了现代化的野战炊事车，在野外准备一个连队约100人的四菜一汤大约需要的时间是  ( )  。
A. 30分钟
B. 60分钟
C. 90分钟
D. 120分钟
答案：B

4. 也门撤侨行动中，我海军大约接走了多少名中国公民？ ( ) 
A. 200
B. 500
C. 100,0
D. 10,000
答案：B

5. 大清士兵打败仗的原因是他们有两杆枪，打仗之外的另外一杆枪是 ( ) 。
A. 步枪
B. 猎枪
C. 手枪
D. 烟枪
答案：D

6. 鸦片战争之后，到民国初期，中国被迫与外国人签定了大约多少个不平等条约。 ( ) 
A. 2,00
B. 5,00
C. 8,00
D. 1,100
答案：D

7. 英国对大清发动的鸦片战争是在 ( ) 。
A. 1840年
B. 1860年
C. 1894年
D. 1900年
答案：A

8. 清朝末年到民国时期，中国版图共失去陆地领土约  ( )  万平方公里。
A. 400
B. 300
C. 200
D. 100
答案：B

9. 中国大唐时的版图面积约为  ( )  万平方千米。
A. 960
B. 1260
C. 1500
D. 1700
答案：D

10. 圆明园被毁，其根本原因是 ( ) 
A. 八国联军入侵
B. 英法联军入侵
C. 清朝没有军队
D. 大清的实际政权掌握在慈禧太后手里
答案：D

11. 中国甲午海战失败之后被迫与日本签定《马关条约》的年份是 ( ) 
A. 1894年
B. 1895年
C. 1931年
D. 1937年
答案：B

12. 全面抗战开始后，我八路军取得了一系列的重大胜利，振备了全国人民，这些胜利包括 ( ) 
A. 平型关大捷
B. 台儿庄大捷
C. 武汉会战
D. 长沙会战
答案：A

13. 平型关大捷中，我八路军沉重地打击了日本军队的嚣张气焰，被打击的日军师团是 ( ) 
A. 板垣师团
B. 小野师团
C. 大岛师团
D. 龟田师团
答案：A

14. 取得平型关大捷胜利的是我八路军第几师 ( ) 
A. 115
B. 120
C. 125
D. 129
答案：A

15. 日本天皇向全世界宣布停止战争(投降)的时间是1945年的哪一天？ ( ) 
A. 5月9日
B. 8月15日
C. 9月2日
D. 9月9日
答案：B

16. 日本正式向中国政府递交投降书的时间是1945年的 ( ) 
A. 5月9日
B. 8月15日
C. 9月2日
D. 9月9日
答案：D

17. 2017年4月6、7日两天，习近平主席专程会见的外国总统是 ( ) 
A. 韩国
B. 法国
C. 俄罗斯
D. 美国
答案：D

18. “国”这个概念的出现其标志是 ( ) 
A. 中华人民共和国建立
B. 中华民国建立
C. 秦始皇统一华夏
D. 周朝建立
答案：D

19. 建国初期的十年间我国国庆阅兵式是每几年进行一次 ( ) 。
A. 1
B. 5
C. 10
D. 20
答案：A

20. 我国的民兵建设队伍最庞大时的人数达到了 ( ) 。
A. 1000万
B. 5000万
C. 10000万
D. 20000万
答案：D

21. 国防存在的价值就相当于人的 ( ) 
A. 钱财
B. 面子
C. 健康
D. 快乐
答案：C

22. 近代中国打了败仗之后，从1940年到1919年共与列强签定了 ( ) 个不平等条约。
A. 566
B. 888
C. 1024
D. 1182
答案：D

23. 中国近代国防的起点是哪一场战争 ( ) 
A. 第一次鸦片战争
B. 第二次鸦片战争
C. 中法战争
D. 中日战争
答案：A

24. 明朝国防衰弱的一个非常简单的原因是 ( ) 
A. 好人没有好报
B. 好人有好报
C. 坏人有恶报
D. 好人一生平安
答案：A

25. 元朝时曾经再次从朝鲜半岛出发攻打日本，再次都是在即将成功时失利了，其原因是 ( ) 
A. 台风
B. 暴雨
C. 大雪
D. 地震
答案：A

26. 唐朝时我国的GDP约占到全世界的百分之多少？ ( ) 
A. 30
B. 50
C. 60
D. 80
答案：D

27. 秦代从山东境内运送粮食到九原城，每送1000石，只有多少石能被边防官兵食用，其余都消耗在路上。 ( ) 
A. 1
B. 5
C. 10
D. 20
答案：B

28. 秦代的边防重镇“九原城”指的是今天的 ( ) 。
A. 包头
B. 呼和浩特
C. 赤峰
D. 张家口
答案：A

29. 秦代中国的“高速公路”是指 ( ) 
A. 万里长城
B. 大运河
C. 秦直道
D. 长江
答案：C

30. 1984年国庆35周年大阅兵时上场地坦克型号是 ( ) 
A. T72
B. 59式
C. 79式
D. 84式
答案：B

31. 1999年国庆阅兵式上，新装备占到的百分比是 ( ) 
A. 50
B. 70
C. 90
D. 95
答案：D

32. 1969年3月发生在东北中苏边界地区的一场武装冲突是 ( ) 
A. 珍宝岛保卫战
B. 黑龙江保卫战
C. 东北保卫战
D. 对苏云南作战
答案：A

33. 真正打出国威军威的一场战争是 ( ) 
A. 抗日战争
B. 解放战争
C. 抗美援朝
D. 对越自卫反击战
答案：C

34. 2017年建军90周年大阅兵的地点是 ( ) 
A. 北京天安门
B. 北京某训练场
C. 南昌八一广场
D. 内蒙古某训练场
答案：D

35. 2015年大阅兵的时间是当年的 ( ) 
A. 7月1日
B. 8月1日
C. 9月3日
D. 10月1日
答案：C

36. 1995年7月我军对台寰演习中，发射的导弹数量是 ( ) 。
A. 2枚
B. 4枚
C. 6枚
D. 10枚
答案：C

37. 1979年对越自卫反击作战时，越南自所以敢侵犯中国南部边境地区，是因为其国家“过于膨胀”，甚至认为其军事实力是世界的 ( ) 。
A. 老大
B. 老二
C. 老三
D. 老四
答案：C

38. 对越自卫反击作战发生的时间是在 ( ) 
A. 1969年
B. 1979年
C. 1989年
D. 2009年
答案：B

39. 在珍宝岛保卫战中我们缴获缴获的苏军装备是 ( ) 
A. 一台上车
B. 一台指挥车
C. 一门大炮
D. 一辆坦克
答案：D

40. 面对大陆导弹演习给台湾岛内居民造成的混乱，台湾当局用高音喇叭喊话安抚民众，其中一句讲到，大陆的导弹有一个最大的特点，就是 ( ) 
A. 特别多
B. 特别贵
C. 特别远
D. 特别准
答案：D

41. 1996年3月台海地区军事演习的导弹试射地点有 ( ) 
A. 2处
B. 3处
C. 4处
D. 5 处
答案：D

42. 与邓小平同志商讨中英联合声明的英国首相在到达中国之前非常傲气，是因为其刚刚赢得了马岛战争的胜利，被世界称之为 ( ) 。
A. 第一女首相
B. 铁首相
C. 铁娘子
D. 女魔头
答案：C

43. 香港和平回归中国的时间是 ( ) 
A. 1987年
B. 1989年
C. 1997年
D. 1999年
答案：C

44. 澳门和平回归中国的时间是 ( ) 
A. 1987年
B. 1989年
C. 1997年
D. 1999年
答案：D

45. 国防强大的基础是 ( ) 
A. 人口众多
B. 物资丰富
C. 农业丰收
D. 经济发展
答案：D

46. 国防巩固的根本是 ( ) 
A. 政治合格
B. 政治开明
C. 政治过硬
D. 政治挂帅
答案：B

47. 国防强大的关键是 ( ) 
A. 团结进步
B. 团结合作
C. 团结奋进
D. 团结统一
答案：D

48. 国防发展的后盾是 ( ) 
A. 经济发展
B. 科技发展
C. 科技进步
D. 经济进步
答案：C

49. 国防及武器装备的发展，最最离不开的一个因素是 ( ) 。
A. 技术工人
B. 工业发展
C. 经济发展
D. 科技发展
答案：D

50. “要把进攻中国列为世界的一大禁忌。你们打中国打进去就出不来了。”说这一句话的人是 ( ) 
A. 英国元帅蒙可马利
B. 英国首相丘吉尔
C. 美国将军巴顿
D. 美国总统尼克松
答案：A

51. “人们只知道有一个美国，不好惹，须知道还有一个中国更不好惹！”说这一句话的人是 ( ) 
A. 毛泽东
B. 朱德
C. 周恩来
D. 陈毅
答案：D

52. “若有战，召必回”表达是 ( ) 
A. 要打仗了
B. 老兵不想退伍
C. 老兵对祖国的承诺
D. 老兵们早就想着退伍
答案：C

53. 《兵役法》说中国公民不分文化程度都有当兵的义务，是不是说任何一个中国公民，但并不是说无论你是什么文化程度都可以当兵，因为征兵工作条例规定了当兵的最低文化程度的要求，这就是必须至少 ( ) 
A. 小学毕业
B. 初中毕业
C. 高中毕业
D. 大学毕业
答案：B

54. 当一个人破坏以下哪些东西时要被判刑 ( ) 
A. 电信局的1米长通信光缆
B. 有线电视的一个接口
C. 10米长的供电电线
D. 0.1米长的国防光缆
答案：D

55. 中华人民共和国的公民除了拥有国防义务之外，还拥有非常重要的 ( ) 
A. 国防权利
B. 国防意识
C. 国防参与
D. 国防保密
答案：A

56. 英国首相撒切尔夫人被称为“铁娘子”，这个铁指的是 ( ) 
A. 铁血心肠
B. 铁血手段
C. 铁血外交
D. 铁血法律
答案：D

57. 软实力对国家综合国力的关系是 ( ) 
A. 乘法
B. 加法
C. 指数
D. 无关
答案：A

58. 国防法规也是国家一种能力的重要构成，这一能力是国家的 ( ) 
A. 软实力
B. 硬实力
C. 公信力
D. 号召力
答案：A

59. 国防法规的重要意义之一是体现一维护国家安全的 ( ) 
A. 国家实力
B. 国家意志
C. 国防实力
D. 国家行为
答案：B

60. 现行《兵役法》最新一次的修订时间是 ( ) 
A. 1984年
B. 2011年
C. 2009年
D. 2019年
答案：B

61. 现行的《国防教育法》全国人大通过的时间是 ( ) 
A. 1998年4月28日
B. 2001年3月8日
C. 2001年4月28日
D. 2008年3月8日
答案：C

62. 中华人民共和国全民国防教育日是每年的 ( ) 
A. 8月15日
B. 9月1日
C. 9月15日
D. 9月的第三个星期六
答案：D

63. 《国防教育法》第3条规定，国家通过开展国防教育，使公民增强______，掌握基本的______，学习必要的______，激发爱国热情，自觉履行______。 ( ) ① 国防观念 ② 国防义务 ③ 军事技能 ④ 国防知识
A. ①④③②  
B. ①②③④   
C. ④①②③   
D. ②③④①
答案：A

64. 公民的国防权力之一就是 ( ) 
A. 可以不当兵
B. 可以不上军校
C. 可以缓征
D. 可以随时离开军队
答案：C

65. 中华人民共和国武装力量属于 ( ) 
A. 党
B. 国家
C. 军队
D. 人民
答案：D

66. 我军同人民群众的关系是 ( ) 
A. 鱼水情深
B. 兄弟一样
C. 主客不分
D. 血肉相联
答案：D

67. 目前解放军陆军的集团军数量是 ( ) 。
A. 9个
B. 11个
C. 13个
D. 15个
答案：C

68. 1985年，陆军组建了集团军后，专业技术兵种所占比重明显增加，这时连队数量最多的兵种是 ( ) 。
A. 步兵
B. 炮兵
C. 装甲兵
D. 防空兵
答案：B

69. 陆军自建国初期到当前按照顺序先后经历了如下几个时期 ( ) ① 骡马化  ② 半机械化 ③ 机械化与信息化 ④ 摩托化
A. ①④③②  
B. ①②③④   
C. ①④②③   
D. ②③④①
答案：C

70. 中国人民解放军的诞生标志是 ( ) 。
A. 南昌起义
B. 百色起义
C. 黄麻起义
D. 秋收起义
答案：A

71. 榴弹炮、加农炮的区别在于射管长度与炮管口径比值的大小不同，榴弹炮、加农炮的比值分别是 ( ) ① 15 ② 25 ③ 40   ④ 50
A. ①②  
B. ②③   
C. ③④   
D. ③①
答案：B

72. 黄洋界保卫战中红军只有几发炮弹，但是就是凭着这能够发射出去的几发炮弹，就打退了敌人。 ( ) 
A. 1发
B. 2 发
C. 3 发
D. 4发
答案：A

73. 很有可能是红军时期第一次使用的炮是一门82毫米迫击炮，这个炮使用的战斗是 ( ) 。
A. 南昌起义
B. 秋收起义
C. 井冈山会师
D. 黄洋界保卫战
答案：D

74. 我们所说的步兵的炮叫“小炮”，是因为其 ( ) 。
A. 口径不大
B. 个头不大
C. 炮弹不大
D. 一两个人可以扛着走
答案：D

75. 枪与炮的区别主要是口径大小，一般来说口径在多少毫米以下称为枪，而以上就称为炮 ( ) 。
A. 20
B. 23
C. 35
D. 60
答案：A

76. 当前大学生军训及实弹射击用枪大多数采用的是 ( ) 。
A. 56式步枪
B. 56式冲锋枪
C. 95式步枪
D. 95式冲锋枪
答案：B

77. 步兵中最早的一款国产步枪是型号是 ( ) 。
A. 38式
B. 54式
C. 56式
D. 65式
答案：C

78. 每个集团军共编有的联合兵种旅及战斗及战斗支援旅的数量分别是 ( ) 。①6 ② 8 ③ 10
A. ①②  
B. ②③   
C. ①③   
D. ③①
答案：A

79. 传统牵引火炮完成射击前的准备叫作炮火准备，通常一个训练半年以上的炮兵班完成这一过程约需要的时间是约 ( ) 
A. 10分钟
B. 15分钟
C. 20分钟
D. 30分钟
答案：C

80. 2019年国庆阅兵式上展示的15式轻型坦克，其战斗全重及发动机功率分别是 ( ) 。① 25吨  ② 35吨 ③ 750马力 ④ 735千瓦
A. ①②  
B. ②④   
C. ①④   
D. ③①
答案：B

81. 反应式装甲自所以做成约一长A4纸大小，就能起到保护坦克的目的，其原理是因为 ( ) 
A. 物理学上的反作用力
B. 化学反应
C. 数学上的概率
D. 硬气功作用
答案：C

82. 当前我军装备的轻型主战坦克型号是 ( ) 。
A. 63式
B. 99式
C. 99A
D. 15式
答案：D

83. 当前我军装备的重型主战坦克型号是 ( ) 。
A. 63式
B. 99式
C. 99A
D. 15式
答案：C

84. 2019年国庆阅兵式上展示的国产新型火箭炮的口径和射程估算可以达到。 ( ) ① 250毫米及以上 ② 500毫米 ③ 约100千米 ④ 约300千米
A. ①②  
B. ②③   
C. ①④   
D. ③①
答案：C

85. 火箭炮通常都是多管的，一般40管的火箭炮的炮弹可以在多少时间内一次发射完毕？ ( ) 
A. 10秒
B. 15至20秒
C. 40秒
D. 60秒
答案：B

86. 我海军护航编队首次到达亚丁湾的时间是 ( ) 
A. 2008.4.23.
B. 2008.12.26.
C. 2009.1.6.
D. 2009.4.23.
答案：C

87. 自2008年底开始，我海军长年都在一支护航舰队担任国际水上通道的护航任务，这一护航水域叫 ( ) 
A. 波斯湾
B. 阿曼湾
C. 红海
D. 亚丁湾
答案：D

88. 我国拥有的海洋国土约多少万平方千米，海岸线长约多少万千米？ ( ) ① 300  ② 960 ③ 1.8 ④ 2.2
A. ①②  
B. ②④   
C. ①④   
D. ①③
答案：D

89. 海军的诞生时间是1949年4月23日，诞生地点是 ( ) 。
A. 辽宁大连
B. 山东青岛
C. 浙江宁波
D. 江苏泰州
答案：D

90. 当一方炮弹发射出去之后，炮弹在空中飞行的时候，就有可能被对方专门用来探测火炮陆地位置的雷达探测到，从而测算出陆地位置，随后反击的炮弹就会发射过来，通常从一方第一发炮弹发出，到对方反击炮弹落地，大约需要的时间是 ( ) 。
A. 半分钟
B. 1分钟
C. 2分钟
D. 5分钟
答案：C

91. 传统火炮撤出阵地通常需要的时间是 ( ) 
A. 20秒
B. 50秒
C. 100秒
D. 150秒
答案：C

92. 炮弹在发射之后，在空中飞行时基本上按照一种什么线飞行(不考虑空气阻力) ( ) 。
A. 直线
B. 水平线
C. 斜线
D. 抛物线
答案：D

93. 火炮射击时如果不设置助锄坑，将助锄埋入地下，则火炮发射时会 ( ) 。
A. 向后滑动
B. 一动不动
C. 向前滑动
D. 左右晃动
答案：A

94. 现代级驱逐舰当年购买时每一艘大约是多少人民币？ ( ) 
A. 8千万
B. 2亿
C. 20亿
D. 50亿
答案：D

95. 20世纪90年代，我国购买的俄罗斯现代级驱逐舰一共是几艘？ ( ) 
A. 2
B. 4
C. 6
D. 8
答案：B

96. 2019年4月23日阅舰式上展示的094核潜艇，可以装载并发射多少枚潜射导弹？ ( ) 。
A. 12枚巨浪2
B. 8枚东风26
C. 12枚东风26
D. 8枚巨浪2
答案：A

97. 中国新型驱逐舰055于2019年4月开始正式服役，其第一艘的舰名是 ( ) 。
A. 南京号
B. 杭州号
C. 福州号
D. 南昌号
答案：D

98. 预警机的最大作用是能够让使用者 ( ) 
A. 多一种飞机
B. 多一点时间
C. 大大增加预警时间
D. 有效进行空战
答案：C

99. 中国空军国产新型预警机型号是 ( ) 。
A. E—2
B. E—3
C. 空警2000
D. 伊尔76
答案：C

100. 我空军装备的一款防空导弹名气很大，这是因为有一个国家出尔反尔给炒作出来的，这个防空导弹名称是 ( ) 
A. 爱国者3
B. 东风21
C. 红旗61
D. 红旗9
答案：D

101. 空军防空导弹担任的主要任务是 ( ) 
A. 作战地区的防空
B. 沿海的防空
C. 空军的防空
D. 国土的防空
答案：D

102. 一般航母上的降落拦阻索有几根？ ( ) 
A. 2
B. 3
C. 4
D. 5
答案：C

103. 东风17导弹是第一次向世界展示的导弹，一经问世就令世界刮目相看，因为其飞行速度可以达到5倍音速以上，其弹头采用的是 ( ) ，可以突破目前所有的各国预警雷达的探测。
A. 流线体
B. 刚体
C. 飞行体
D. 乘波体
答案：D

104. 一个美国学者说，只要有多少枚东风41导弹，就可以打击美国所有人口超过5万的所有城市。 ( ) 
A. 10
B. 16
C. 32
D. 50
答案：C

105. 东风41导弹的公布，震惊了世界。据说其造价及使用成本非常高，一枚东风41各种费用估计要高达 ( ) 。
A. 1亿人民币
B. 1亿美元
C. 10亿人民币
D. 10亿美元
答案：C

106. 火箭军是维护国家安全的 ( ) 
A. 重要基石
B. 战略力量
C. 决定力量
D. 核心基石
答案：A

107. 火箭军正式成立的时间是 ( ) .
A. 2009年10.1
B. 2012.10.1
C. 2015.10.1
D. 2015.12.31
答案：D

108. 我国第一颗人造地球卫星成功发射的时间是 ( ) 。
A. 1959.10.1.
B. 1964.10.1.
C. 1964.10.16.
D. 1970.4.24.
答案：D

109. 我国第一颗原子弹成功爆炸的时间是 ( ) 。
A. 1959.10.1.
B. 1964.10.1.
C. 1964.10.16.
D. 1970.4.24.
答案：C

110. 我军最初组建的第二炮兵，实际上就是一支 ( ) 。
A. 炮兵部队
B. 高炮部队
C. 火箭部队
D. 导弹部队
答案：D

111. 中国目前正在服役的潜射导弹型号是 ( ) 
A. 东风2
B. 红旗2
C. 霹雳2
D. 巨浪2
答案：D

112. 东风系列导弹又被网友们称为 ( ) 
A. 东风快递
B. 顺风快递
C. 中国快递
D. 导弹快递
答案：A

113. 东风17导弹弹头的最快飞行速度可以达到 ( ) 。
A. 5M
B. 10M
C. 15M
D. 20M
答案：D

114. 苏联卫国战争开始的1941年6月，其总兵力是460万人，经过近一年的战争后的1941年5月，其损失兵员数已经达到804万，为什么苏联还能赢得这场战争的最后胜利？因为苏联在战争爆发后 ( ) 
A. 遇到了上帝的帮助
B. 遇到了欧洲盟友的帮助
C. 开始对德国展开了全面进攻
D. 开始了持续不断的兵员动员
答案：D

115. 国防动员的服务功能指的是 ( ) 。
A. 服务于人民
B. 服务于国防建设
C. 服务于经济建设
D. 服务于军队建设
答案：C

116. 2020年抗击新型冠状病毒肺炎行动中，专门建成了武汉火神山医院，完成这一任务用时为 ( ) 。
A. 3天
B. 7天
C. 10天
D. 20天
答案：C

117. 在抗击“非典”行动中，我们建成北京专门用来收治非典病人的“小汤山”医院，完成这一任务所用时间为 ( ) 。
A. 3天
B. 7天
C. 10天
D. 20天
答案：B

118. 在2003年抗击“非典”的斗争中，我们动员了大量的民兵队伍，参与抗击工作。总共动员的民兵人数约为 ( ) 。
A. 100万
B. 500万
C. 1000万
D. 1100万
答案：D

119. 我国民兵是战时武装力量动员的基础，是进行人民战争的巨大力量。所以毛泽东同志说 ( ) 。
A. 民兵是胜利之本
B. 兵民是胜利之本
C. 兵民是胜利之师
D. 兵民是胜利之根
答案：B

120. 现役部队动员的顺序是 ( ) 。① 进入临战状态 ② 扩建现役部队 ③ 组建新的部队 ④ 实行战时编制
A. ①④③②  
B. ①②③④   
C. ④①②③   
D. ①④②③
答案：D

121. 二战中日本发起太平洋战争并最终导致其彻底的失败，其中一个重要原因是日本战时的工业生产能力与美国相比，简直是微不足道。如，美国飞机生产量约是日本的5倍，火炮约是30多倍，航母更是达到了 ( ) 。
A. 50多倍
B. 80多倍
C. 150多倍
D. 250多倍
答案：D

122. 抗美援朝期间，全国各地捐献的钱款总数相当于可以购买 ( ) 架战斗机。
A. 710架
B. 1710架
C. 2710架
D. 3710架
答案：D

123. 抗美援朝期间，全国各地开展了广泛的捐献武器运动，其中最突出的一位艺术家利用表演收入捐献金额相当于一架战斗机。这位表演艺术家是著名的 ( ) 。
A. 京剧艺术家梅兰芳
B. 评剧艺术家常香玉
C. 黄梅戏艺术家严凤英
D. 歌剧艺术家郭兰英
答案：B

124. 和平时期一般国家的国防经费约战GDP的1—4%之间，但战时会明显高于这一比例。如抗美援朝时我国国防开支占到总开支的 ( ) 。
A. 11%
B. 22%
C. 33%
D. 44%
答案：D

125. 现代战争消耗巨大，如二战各方消耗总数约达到1.35万亿美元，而到了最近几十年，消耗更大，1991年的海湾战争，仅仅进行了42天，以美国为首的多国部队的战争经费达到了 ( ) 。
A. 300多亿美元
B. 500多亿美元
C. 600多亿美元
D. 800多亿美元
答案：C

126. 我国采取 ________ 国防政策。
A. 扩张型
B. 自卫型
C. 中立型
D. 联盟型
答案：B

127. 人类历史上第一部最全面论述战争的军事著作是________。
A. 《孙子兵法》
B. 《六韬》
C. 《战争艺术》
D. 《战争论》
答案：A

128. 古语中：“民无兵不安，国无防不立所说的含义在当今是指国防的意思么？
A. 是
B. 不是
答案：A

129. 我国是采取扩张型国防政策吗？
A. 是
B. 不是
答案：B

130. 国家领土完整是“国防”定义的范畴么？
A. 是
B. 不是
答案：A

131. 在奴隶社会和封建社会国防是指一个氏族或国家自己管辖区域内所有应有的秩序吗？
A. 是
B. 不是
答案：A

132. 中日甲午战争是1894年吗？
A. 是
B. 不是
答案：A

133. 习近平2014年4月15日在中央国家安全委员会第一次会议上阐述“总体国家安全观”时指出：“必须坚持总体国家安全观，以(   )为宗旨，以(   )为根本，以(   )为基础，以(   )为保障，以促进国际安全为依托，走出一条中国特色国家安全道路。”①人民安全  ②政治安全  ③经济安全  ④军事、文化、社会安全
A. ④③②①
B. ①②③④
C. ①②④③
D. ②①③④
答案：B

134. 国家安全的主体是(     )。
A. 联合国   
B. 国家   
C. 全体公民  
D. 政府
答案：B

135. 永暑礁是位于南海海域上吗？
A. 是
B. 不是
答案：A

136. 中国周边安全环境特征有(    )陆上邻国。
A. 12个
B. 13个
C. 14个
D. 15个
答案：C

137. 军队就是我国国防建设总体这一个说法是否狭隘?
A. 是
B. 不是
答案：A

138. 中国公民所做的每一项合法工作都是在为国防做贡献吗？
A. 是
B. 不是
答案：A

139. 1959年阅兵是基本实现国产化吗？
A. 是
B. 不是
答案：A

140. 我国的防御型国防政策就是维护国家的和平统一吗？
A. 是
B. 不是
答案：A

141. 中国是世界170个国家(地区)的最大贸易伙伴吗？
A. 是
B. 不是
答案：B

142. 我国周边安全形势是总体稳定的，局部是严峻的吗？
A. 是
B. 不是
答案：A

143. 美国21万亿美元的外债，最主要原因之一是战争吗？
A. 是
B. 不是
答案：A

144. 与中国在南海问题有主权诉求的国家有越南、菲律宾、泰国、马来西亚、印度是吗？
A. 是
B. 不是
答案：B

145. 美国是通过把南海局势搅乱，为布局南海找借口，达到唯独中国的目的吗？
A. 是
B. 不是
答案：A

146. 武器装备的现代化程度，是 ( ) 的重要标志
A. 国家现代化  
B. 国防现代化  
C. 军事技术现代化 
D. 军队现代化
答案：D

147. 国防和军队建设，是 ( ) 和(  B )全国各族人民的共同事业
A. 全党   
B. 全国各族人民   
C. 中国公民  
D. 海内外同胞
答案：A

148. 要把实施科技强军战略作为军队建设的 ( ) 予以高度重视
A. 重要内容  
B. 根本动力   
C. 重要动力   
D. 重要措施
答案：B

149. 见到过毛泽东主席的基辛格说，毛泽东的著作，推动了一个民族，改造了整个 ( ) 。
A. 中国
B. 亚洲
C. 世界
D. 宇宙
答案：C

150. 抗日战争全面爆发后，毛泽东同志撰写了一部著名的军事著作《论持久战》，指出了中国的抗日战争必然是一场 ( ) 。
A. 持久战
B. 速决战
C. 拉锯战
D. 歼灭战
答案：A

151. 遵义会议之后，毛泽东同志指挥的渡过赤水河战役为 ( ) 。
A. 二渡
B. 三渡
C. 四渡
D. 六渡
答案：C

152. 毛泽东同志认为战争的规律是可寻的，因为 ( ) 。
A. 战争可以重复出现
B. 战争可以重复实验
C. 战争胜负由人数多少决定
D. 战争胜负由双方政治经济等共同决定
答案：D

153. 毛泽东军事思想产生于红军初创时期有 ( ) 。
A. 1927年
B. 1928年
C. 1927-1930年间
D. 1930年
答案：C

154. 我军当年在陕北时开展军民大生产的原因是 ( ) 。
A. 记住艰苦朴素作风
B. 部队作战任务不重
C. 部队困难吃饭都难
D. 当地空地太多
答案：C

155. 毛泽东同志在三湾村调研时看到一个连队没有一个逃兵，经过调查，其原因是这个连队 ( ) 。
A. 伙食好
B. 有军饷
C. 党员多
D. 连长会打人
答案：C

156. 秋收起义失利之后，毛泽东带领残余的约1000上井冈山，在上山之前进行了改编，将所谓的一个师改编成了一团，这个改编的村子是 ( ) 。
A. 麻田村
B. 古田村
C. 大井村
D. 三湾村
答案：D

157. “八七会议”之后，毛泽东领导的武装起义是 ( ) 。
A. 南昌起义
B. 秋收起义
C. 黄麻起义
D. 百色起义
答案：B

158. 我军初创时期的第一场武装起义是 ( ) 。
A. 南昌起义
B. 秋收起义
C. 黄麻起义
D. 百色起义
答案：A

159. 中国历史上的农民起义大多数都失败了，其原因就是 ( ) 。
A. 没有一个有信仰的政党的领导
B. 起义军人数不够
C. 起义初步成功之后就嘚瑟
D. 执政的政府太强大
答案：A

160. 实行人民战争，在战场上会收获意想不到的结果。典型的就一场战斗，这场战斗因为人民群众及时提供敌情，从而使八路军用炮兵就打死一大批日军军官，其中最大的还是一个中将。这场战斗是 ( ) 。
A. 平型关之战
B. 孟良崮之战
C. 百团大战
D. 黄土岭之战
答案：D

161. 毛泽东军事思想可以说是博大精深，他一辈子写了5000多篇军事著作，总字数达到 ( ) 。
A. 20多万字
B. 40多万
C. 200多万
D. 400多万
答案：D

162. 我军自创立以来，一直实行的都这样一种战略 ( ) 。
A. 积极进攻
B. 积极防御
C. 消极进攻
D. 消极防御
答案：B

163. 党对军队绝对领导的根本原则和制度，发端于(        )，奠基于(        )，定型于(        )。① 北伐战争  ②南昌起义  ③ 三湾改编  ④古田会议
A. ②③④  
B. ①③④  
C. ③①④  
D. ③②④
答案：A

164. ___________,习近平主席在一次重要会议提出：“建设一支听党指挥、能打胜仗、作风优良的人民军队、是党在新形势下的强军目标。”
A. 2013年3月
B. 2014年3月
C. 2015年3月
D. 2016年3月
答案：A

165. 习近平指出：“建设一支听党指挥、能打胜仗、作风优良的人民军队，力争到___________年基本实现国防和军队现代化，到本世纪中叶把人民军队全面建成世界一流军队。”
A. 2020
B. 2025
C. 2030
D. 2035
答案：D

166. 新时代强军思想是习近平确立的吗？
A. 是
B. 不是
答案：A

167. 2015年，习近平访美时在欢迎晚宴上表示：世界上本无“修昔底德陷阱”，但__________，就可能自己给自己造成“修昔底德陷阱”。
A. 后起大国想要崛起
B. 守成大国缺乏定力
C. 大国之间一再发生战略误判
D. 大国之间互相信任
答案：C

168. 习近平总书记在党的_________大上再一次强调：“坚持陆海统筹，加快建设海洋强国”。
A. 16
B. 17
C. 18
D. 19
答案：D

169. 下列关于现代战争的说法错误的是： ( ) 。
A. 当前和平与发展仍然是时代主题 
B. 世界仍然很不太平，局部战争此起伏 
C. 中国实力不断强大，再不会发生任何战争 
D. 全体中国人民仍然要对战争保持警惕
答案：C

170. 在《中国人民解放军军语》中，把 ( ) 定义为：“国家或政治集团之间为了一定的政治、经济等目的，使用武装力量进行的大规模激烈交战的军事斗争。是解决国家、政治集团、阶级、民族、宗教之间矛盾冲突的最高形式。”
A. 政治斗争
B. 军队作战 
C. 战争 
D. 打仗
答案：C

171. 毛泽东同志站在马克思主义的立场上，深刻指出：“ ( ) ——从有私有财产和有阶级以来就开始了的，用以解决阶级和阶级、民族和民族、国家和国家、政治集团和政治集团之间，在一定发展阶段上的矛盾的一种最高斗争形式。”
A. 战争 
B. 政治 
C. 和平 
D. 军事斗争
答案：A

172.  ( ) 是违背人民根本利益、阻碍社会进步的战争，包括为实行阶级与民族压迫、镇压人民革命、侵略他国、制造国家分裂和争夺世界与地区霸权等而进行的战争。
A. 正义战争 
B. 侵略战争 
C. 争霸战争 
D. 非正义战争
答案：D

173. 从根本上说，战争的性质包括正义战争和非正义战争。其中， ( ) 是符合人民根本利益、推动社会进步的战争，包括为抵抗反动阶级压迫、争取民族解放、抵御外来侵略、维护国家统一和世界和平等而进行的战争。
A. 非正义战争 
B. 反侵略战争 
C. 正义战争 
D. 民族独立和解放战争
答案：C

174. 邓小平同志提出，自20世纪中后期以后，和平与发展是时代的主题，但这两大问题至今一个也没有解决； ( ) 的存在，始终是解决世界和平与发展问题的主要障碍。
A. 恐怖主义 
B. 霸权主义和强权政治 
C. 帝国主义和殖民主义 
D. 美苏争霸
答案：B

175. 马克思主义者以辩证唯物主义和历史唯物主义的立场、观点、方法看待战争，认为战争是人类社会发展到一定历史阶段的产物，产生战争的根本原因是 ( ) 。
A. 人性中的贪婪与自私 
B. 对抗性的经济利益冲突 
C. 政治人物的欢喜好恶 
D. 军事统帅的思想意识和物质追求
答案：B

176. 下列关于大学生与战争活动的说法错误的是： ( ) 。
A. 大学生必须形成正确的战争观，促进形成科学的世界观 
B. 从历史和现实来看，大学生的前途命运与战争活动紧密相关 
C. 大学生是遏制和打赢战争的重要力量 
D. 大学生的本职是认真读书，不需要关心和思考战争的问题
答案：D

177. 机械化武器装备，包括工业化生产的坦克、自行火炮、水面舰艇、潜艇、战斗机、轰炸机等。主要依托装甲战斗车辆等机械化装备实施机动和作战的部队，以 ( ) 或坦克兵等为主体的诸兵种合成部队，被称为机械化部队。
A. 骑兵
B. 车兵 
C. 机械化步兵 
D. 网络攻防部队
答案：C

178. 在机械化战争中，战场空间呈现 ( ) 的特点。
A. 平面化 
B. 立体化 
C. 多维一体化 
D. 向网络空间拓展
答案：B

179. 世界新军事革命，以 ( ) 为核心，以重塑军事体系为目标，最终的结果是促使信息化战争形态发展成熟。
A. 机械化
B. 信息化
C. 装甲化 
D. 人工智能
答案：B

180. 党的十九大报告明确提出，要适应世界新军事革命发展趋势和国家安全需求，提高建设质量和效益，确保到二○二○年我军基本实现机械化，信息化建设取得重大进展，力争到 ( ) 年基本实现国防和军队现代化。
A. 二○二五
B. 二○三五
C. 二○四五
D. 二○五○
答案：B

181. 在当前的世界军事革命大潮中，军事科技等方面最为领先的国家是 ( ) 。
A. 中国
B. 英、法、德、日等国
C. 俄罗斯
D. 美国
答案：D

182. 新军事革命背景下，世界各主要国家均对军队组织结构进行调整改革。下列说法错误的是： ( ) 。
A. 信息化军队的组织结构具有高度一体化的特点 
B. 世界各主要国家均压缩军队规模、提高各军兵种的技术含量 
C. 只有大力增加军队员额，才能获得更大的军事力量优势 
D. 随着形势的发展，世界各主要国家军队出现了许多新的军兵种，改变了军队的组织结构
答案：C

183.  ( ) 是信息化战争的基本作战样式。
A. 大规模纵深作战 
B. 线性作战 
C. 接触作战 
D. 一体化联合作战
答案：D

184. 下列关于世界新军事革命发展历程的说法错误的是： ( ) 。
A. 世界新军事革命起源于技术领域的进步，逐步拓展到其他各个领域 
B. 世界新军事革命走过了一条从简单到复杂、从局部到全局的发展历程 
C. 在新军事革命的发展过程中，世界各主要国家总是齐头并进
D. 世界新军事革命方兴未艾，未来仍然继续发展
答案：C

185. 新军事革命是在工业社会走向信息社会的时代，以 ( ) 为核心并得以广泛应用，从而引起军事领域武器装备、军事理论和组织体制等一系列的根本变革，导致彻底改变战争形态的一场革命。
A. 云计算技术
B. 信息技术
C. 新材料技术 
D. 人工智能技术
答案：B

186. 信息化武器装备主要由信息化作战平台、信息化弹药和 ( ) 构成。
A. 信息化枪炮 
B. 信息化的坦克、飞机和大炮
C. 导弹等主战兵器
D. 军事信息系统
答案：D

187. 以主战兵器作为划分战争形态的主要标准，可以将人类历史上的战争形态分为冷兵器战争、热兵器战争、机械化战争、 ( ) 。
A. 核战争
B. 信息化战争
C. 全面战争
D. 局部战争
答案：B

188.  ( ) 是人类历史上第一场仅以空军进行轰炸而没有使用地面部队就确定胜利的战争。
A. 伊拉克战争
B. 科索沃战争
C. 阿富汗战争
D. 海湾战争
答案：B

189. 1991年1月17日凌晨，美国和英国等组成多国部队开始了对伊拉克的代号为“沙漠风暴”的空袭行动，由此开始了一场具有较为显著信息化特点的战争。2月28日，战争结束。这场战争被称为 ( ) 。
A. 伊拉克战争
B. 科索沃战争
C. 阿富汗战争
D. 海湾战争
答案：D

190. 在信息化战争中，诸军兵种部队指挥员依托 ( ) ，可以更为迅速方便地进行信息沟通。
A. 通信员 
B. 步话机 
C. 军事信息网络
D. 互联网
答案：C

191. 在信息化战争中， ( ) 成为交战各方主要的较量方式。
A. 体系对抗 
B. 平台对抗 
C. 兵力对抗 
D. 人力对抗
答案：A

192. 在信息化战争中， ( ) 成为战场争夺的首要目标。
A. 火力优势 
B. 兵力优势 
C. 信息优势
D. 智力优势
答案：C

193. 信息化弹药主要指精确制导武器，即 ( ) 、精确制炸弹等新型武器装备。
A. 航空炸弹
B. 火药
C. 导弹
D. 军用机器人
答案：C

194. 中日甲午战争是1894年吗？
A. 是
B. 不是
答案：A

195. 人类历史上第一部最全面论述战争的军事著作是________。
A. 《孙子兵法》
B. 《六韬》
C. 《战争艺术》
D. 《战争论》
答案：A

196. 美国21万亿美元的外债，最主要原因之一是战争吗？
A. 是
B. 不是
答案：A

197. 雷达是机械化战争的手段吗？
A. 是
B. 不是
答案：B

198. 战场透明化是信息化战争的特点之一吗？
A.  是
B. 不是
答案：A

199. 致盲敌人的雷达系统是信息化战争手段吗？
A. 是
B. 不是
答案：A

200. 在一场信息化战争中手机是指挥战斗的最好指挥方式吗?
A. 是
B. 不是
答案：B

201. 在1991年1月17日伊拉克巴格达战争中所采用的是信息化战争吗？
A. 是
B. 不是
答案：A

202. 信息化战争是在机械化战争的基础上发展起来的吗？
A. 是
B. 不是
答案：A

203. 信息化战争中，参战的主体除了军队之外，还包括社会团体和个人。
A. 是
B. 不是
答案：A

204. 信息化战争主要是军队的事，与地方政府无关，也与大学生无关。
A. 是
B. 不是
答案：B

205. 在信息化战争中，信息是核心资源，是决定战争胜负的关键因素吗？
A. 是
B. 不是
答案：A

206. 在信息化战争中，起核心作用的资源是____________。
A. 机动力
B. 火力
C. 信息
D. 体能
答案：C

207. 近代以来，海战场的主战军种是 ( ) 。
A. 陆军      
B. 海军     
C. 空军      
D. 火箭军
答案：B

208.  ( ) 被称为“闪击战之父”。
A. 古德里安  
B. 曼施坦因 
C. 隆美尔  
D. 富勒
答案：A

209.  ( ) 是当代德国陆军的主战坦克，堪称世界一流水平。
A. Ｍ１Ａ１  
B. 豹－２  
C. 梅卡瓦  
D. 软杀伤
答案：B

210. 中国的ZTZ-99Ａ坦克属于第 ( ) 代坦克。
A. 一     
B. 二    
C. 三    
D. 四
答案：C

211.  ( ) 最先系统提出了“装甲战”理论。
A. 古德里安  
B. 曼施坦因 
C. 隆美尔  
D. 富勒
答案：D

212. 美国陆军现役的 ( ) 被公认为是当今世界最先进的武装直升机。
A. 阿帕奇   
B. 眼镜蛇  
C. 卡－５２  
D. 虎式
答案：A

213.  ( ) 是我军第一款专业武装直升机，也是亚洲第一款批量装备部队的武装直升机。
A. 直－５   
B. 武直-10  
C. 直－１８  
D. 直－２０
答案：B

214.  ( ) 是我国自主研发的首款中型(１０吨级)直升机。
A. 直－５   
B. 武直-10  
C. 直－１８  
D. 直－２０
答案：D

215.  ( ) 的诞生，开启了“一树之高”的新战场。
A. 直升机   
B. 坦克   
C. 装甲车   
D. 战斗机
答案：A

216.  ( ) 步战车是以美军五星上将的名字命名的履带式步战车。
A. 艾布拉姆斯 
B. 布雷德利 
C. 尼米兹   
D. 斯特瑞克
答案：B

217.  ( ) 8轮步战车是美国陆军过渡战斗旅的主战装备。
A. 艾布拉姆斯 
B. 布雷德利 
C. 尼米兹   
D. 斯特瑞克
答案：D

218. 中国空降兵部队装备的 ( ) 系列空降战车可利用重型伞降系统进行空投。
A. ZBD-03   
B. ZBD-05   
C. ZTD-03   
D. ZTD-05
答案：A

219. 法国和德国联合研制 ( ) 武装直升机在设计理念上突出了制空作战的性能。
A. 阿帕奇   
B. 眼镜蛇  
C. 卡-５２  
D. 虎式
答案：D

220. 当今世界现役的隐形轰炸机有 ( ) 。
A. B-1b   
B. B-2   
C. B-52     D图-160
答案：B

221.  ( ) 是中国海军现役装备的第一种航母舰载战斗机。
A. 歼-10  
B. 歼-11   
C. 歼-15  
D. 歼-20
答案：C

222.  ( ) 是目前中国性能最强的双发重型隐形战斗机。
A. 歼-10  
B. 歼-11   
C. 歼-15  
D. 歼-20
答案：D

223. 中国第一艘国产航母被命名为 ( ) 号。
A. 辽宁    
B. 山东   
C. 江苏   
D. 浙江
答案：B

224. 中国第一艘服役的辽宁号航母舷号为 ( ) 
A. １６    
B. １７   
C. １８  
D. １９
答案：A

225.  ( ) 是世界上第一艘装备“宙斯盾”系统并全面采用隐形设计的驱逐舰。
A. 查尔斯·F·亚当斯级 
B. 斯普鲁恩斯级 
C. 阿利·伯克级  
D. 朱姆沃尔特级
答案：C

226. 满载排水量３～６万吨级的航母属于 ( ) 航空母舰。
A. 小型    
B. 轻型   
C. 中型   
D. 大型
答案：C

227.  ( ) 是中国自主建造的装备有源相控阵雷达的排水量超过万吨的导弹驱逐舰。
A. 052型   
B. 053型   
C. 054型   
D. 055型
答案：D

228. 1918年9月服役的 ( ) “百眼巨人”号航母是世界上第一艘全通式甲板航空母舰。
A. 英国    
B. 美国   
C. 法国   
D. 德国
答案：A

229. 二战时期的太平洋海战，证明了战列舰称霸海战场时代，已经被航空母舰加 ( ) 的新型作战力量所取代。
A. 水面舰艇  
B. 潜艇   
C. 舰载机  
D. 航空母舰
答案：C

230.  ( ) 是根据装备的使用需求和发展规律，按一定序列排列其主要性能参数和结构形式，有计划地指导产品发展的一种标准化方法。
A. 系列化   
B. 通用化  
C. 信息化  
D. 标准化
答案：A

231.  ( ) 是将现有或正在研制的具有互换性特征的通用单元用于新研制武器系统的一种标准化方法。
A. 系列化   
B. 通用化  
C. 信息化  
D. 标准化
答案：B

232. 在信息化战争中，起核心作用的资源是____________。
A. 机动力
B. 火力
C. 信息
D. 体能
答案：C

233. 在信息化战争中，信息是核心资源，是决定战争胜负的关键因素吗？
A. 是
B. 不是
答案：A

234. 信息化战争主要是军队的事，与地方政府无关，也与大学生无关。
A. 是
B. 不是
答案：B

235. 信息化战争中，参战的主体除了军队之外，还包括社会团体和个人。
A. 是
B. 不是
答案：A

236. 信息化战争是在机械化战争的基础上发展起来的吗？
A. 是
B. 不是
答案：A

237. 在1991年1月17日伊拉克巴格达战争中所采用的是信息化战争吗？
A. 是
B. 不是
答案：A

238. 在一场信息化战争中手机是指挥战斗的最好指挥方式吗?
A. 是
B. 不是
答案：B

239. 致盲敌人的雷达系统是信息化战争手段吗？
A. 是
B. 不是
答案：A

240. 用文字去描述一件事情是培养信息化思维的行为方式吗？
A. 是
B. 不是
答案：B

241. 战场透明化是信息化战争的特点之一吗？
A.  是
B. 不是
答案：A

242. 雷达是机械化战争的手段吗？
A. 是
B. 不是
答案：B

243. 目前美军M1A2坦克的装备是否配备先进的探测设备和战场综合管理系统？
A. 是
B. 不是
答案：A

244. 美国击毙本拉登的行动只出动了24人，背后有卫星、侦察机、电子干扰飞机、航母等庞大体系支撑，这一方式是信息化战争的特征吗？
A. 是
B. 不是
答案：A

245.  1895年____________发明了无线电。
A. 波波夫
B. 尼古拉•特斯拉
C. 伽利尔摩•马可尼
D. 托马斯•阿尔瓦•爱迪生
答案：A

246. 五维立体战场是指陆、海、空、天、信这5种方式吗？
A. 是
B. 不是
答案：B

247. 二十大指出，在新时代，国防和军队现代化新&ldquo;三步走&rdquo;战略安排是( )。
A. 2027年确保实现建军一百年奋斗目标，到2035年基本实现国防和军队现代化，到本世纪中叶把人民军队全面建成世界一流军队
B. 2020年基本实现机械化，2030年基本实现强军目标，2050年全面建成世界一流军队
C. 2027年基本实现信息化，2030年基本实现国防和军队现代化，本世纪中叶实现强军目标
D. 2027年基本实现信息化，2035年基本实现强军目标，2050年全面建成世界一流军队
答案：A

248. 也门撤侨行动中，中国小姑娘与举起双手投降的叙利亚小姑娘的对比照片告诉我们 ( ) 
A. 有一个强大的国家是幸福的
B. 强大的国防很重要
C. 这个世界并不太平，只是我们生活在和平的国度
D. 和平是人类共同的夙愿
答案：ABCD

249. 2016年夏抗洪救灾的战士们在泥水地里吃着群众送来的冷馒头，其原因是 ( ) 。
A. 伙食保障能力太差
B. 交通阻断饭菜送不上来
C. 救灾任务重战士们来不及吃
D. 人民群众对子弟兵的热爱
答案：CD

250. 日本间谍宗方小太郎对大清当时的现状高度概括为 ( ) 
A. 上下团结紧
B. 满汉不家亲
C. 上下皆腐败
D. 全民失信仰
答案：CD

251. 《马关条约》规定了大清向日本进行赔偿有 ( ) 
A. 共赔款2.3亿两白银
B. 割让台湾岛
C. 割让澎湖及钓鱼岛
D. 割让东北
答案：ABC

252. 建国最初的一、二十年，我国国防成就中包括打败或者挫败了几个国家的入侵或者企图入侵，这几个国家包括 ( ) 。
A. 美国
B. 苏联
C. 日本
D. 印度
答案：ABD

253. 中国近些年来的成就主要有成功举办了以下在世界范围都产生重大影响的大型活动 ( ) 。
A. 奥运会
B. G20峰会
C. 世博会
D. APEC峰会
答案：ABCD

254. 2014年3月，习近平主席出访欧洲四国，取得了重大外交成就，这四国是 ( ) 。
A. 德国
B. 法国
C. 荷兰
D. 英国
E. 意大利
F. 比利时
答案：ABCF

255. 中国经济建设成就的显著标志有 ( ) 
A. 辽宁号航母
B. 高铁
C. 大飞机
D. 中国无人机
答案：AB

256. 与中国相对比，三个极为贫困的国家包括 ( ) 。
A. 阿富汗
B. 伊拉克
C. 津巴布韦
D. 委内瑞拉
答案：ACD

257. 现代国防系统主要包括 ( ) 等。
A. 国防体制
B. 国防力量
C. 国防动员
D. 国防教育
E. 国防法规
F. 国防科技
答案：ABCDEF

258. 从全世界范围看，国防可以分为以下类型 ( ) 
A. 扩张型
B. 联盟型
C. 中立型
D. 自卫型
答案：ABCD

259. 目前世界范围实行联盟型国防的国家有 ( ) 。
A. 日本
B. 韩国
C. 美国
D. 英国
E. 法国
答案：ABCDE

260. 中立型国防的典型国家是 ( ) 
A. 瑞典
B. 瑞士
C. 德国
D. 意大利
答案：AB

261. 中国人民解放军的几大军种包括以下 ( ) 
A. 陆军
B. 海军
C. 空军
D. 火箭军
E. 第二炮兵
答案：ABCD

262. 中国特色的武装力量指的是 ( ) 
A. 中国人民解放军
B. 中国人民武装警察
C. 中国民兵
D. 中国预备役部队
答案：ABC

263. 中国古代国防衰弱的朝代有 ( ) 
A. 两晋南北朝
B. 宋
C. 明中后期
D. 清后期
答案：ABCD

264. 元朝时我国的战马曾经到达的地方有 ( ) 
A. 莫斯科
B. 多瑙河畔
C. 尼罗河畔
D. 罗马
答案：ABC

265. 中国古代国防强盛的朝代有 ( ) 
A. 春秋末期
B. 秦
C. 唐
D. 元
答案：ABCD

266. 抗美援朝战争到1953年7月27日结束时，代表各方签字的人员有 ( ) 
A. 中国周恩来
B. 中国彭德怀
C. 美国杜鲁门
D. 美国克拉克
答案：BD

267. 建国后我们取得了一系列抵御外敌入侵的战争或武装冲突的胜利，这些战争或者武装冲突包括 ( ) 
A. 抗美援朝
B. 中印过境自卫反击战
C. 珍宝岛保卫战
D. 对越自卫反击战
答案：ABCD

268. 2019年国庆大阅兵第一次亮相的兵器有 ( ) 
A. 东风41
B. 东风26
C. 东风31
D. 东风17
答案：AD

269. 2015年大阅兵时展示的新型兵器有 ( ) 
A. 舰载飞机
B. 东风系列导弹
C. 99A坦克
D. 航母
答案：ABC

270. 2009年国庆阅兵式上出现的令人振奋的兵器有 ( ) 
A. 国产空中预警机
B. 国产巡航导弹
C. 战略导弹
D. 新型军舰
答案：ABC

271. 城镇男青年入伍必须同时满足以下哪些条件才可以 ( ) 
A. 高中毕业以上
B. 有纹身
C. 刑满释放
D. 身体健康
答案：AD

272. 兵役类法规主要有 ( ) 
A. 《兵役法》
B. 《现役军官法》
C. 《预备役军官法》
D. 《现役士兵服役条例》
答案：ABCD

273. 国防基本法主要有 ( ) 
A. 《宪法》中相关内容
B. 《兵役法》，
C. 《国防教育法》
D. 《征兵工作条例》 AB
答案：AB

274. 违反国防法规要进行严厉的处罚，在外国同样也是这样的，讲课中提到的几个严厉处罚的国家有 ( ) 
A. 俄罗斯
B. 美国
C. 法国
D. 韩国
E. 朝鲜
F. 日本
答案：ABCDF

275. 国防法规处罚措施的严厉性的一个重要体现就是，如果一个小伙子当兵到了部队的很短时间内，却因为怕苦而坚决要求立即回家，则要对其进行以下一些处罚 ( ) 。
A. 罚款约10万元人民币
B. 两年内不得就业
C. 两年内不得升学和出国
D. 两年内不准结婚
E. 两年内无法乘坐飞机和高铁
答案：ABCE

276. 国防法规的个性主要有 ( ) 
A. 调整对象的军事性
B. 公开程度的有限性
C. 司法适用的优先性
D. 处罚措施的严厉性
答案：ABCD

277. 国防法规的共性主要有 ( ) 
A. 鲜明的阶级性
B. 高度的权威性
C. 严格的强制性
D. 普遍的适用性
E. 相对的稳定性
F. 极端的保密性
答案：ABCDE

278. 中华人民共和国的公民的国防权力体现在以下几点 ( ) 
A. 2011年利比亚撤侨
B. 2015年也门撤侨
C. 叙利亚战火中撤离游客
D. 新西兰地震后撤离游客
答案错误

279. 国家的软实力体现在 ( ) 
A. 法制状况
B. 社会制度
C. 价值观念
D. 文化 
答案：ABCD

280. 国家的硬实力体现在 ( ) 
A. 经济
B. 军事
C. 科技
D. 文化
答案：ABC

281. 国家意志体现在 ( ) 
A. 全民普适性
B. 全民权威性
C. 权威强制性
D. 特权优先性
答案：AC

282. 《国防教育法》对国防教育的以下内容作出了明确规定 ( ) 
A. 目的和地位
B. 方针
C. 保障
D. 法律责任
答案：ABCD

283. 学生军事训练的意义有 ( ) 。
A. 公民履行兵役义务的一种形式
B. 加强国防后备力量建设的战略措施
C. 提高学生综合素质的有效途径
D. 让学生学会吃苦的精神
答案：ABC

284. 开展学生军训的国家很多，比如 ( ) 
A. 印度
B. 美国
C. 英国
D. 澳大利亚
答案：ABCD

285. 实施国防教育的目的主要是增强国防观念，而国防观念主要是指年青人要具有  ( ) 。
A. 忧患意识
B. 主人意识
C. 尚武意识
D. 责任意识
答案：ACD

286. 法国二战中在德国入侵45天后就宣布投降这个事实告诉我们，法国严重缺少 ( ) 。
A. 革命教育
B. 国防教育
C. 尚武教育
D. 忧患教育
答案：BD

287. 中国公民履行兵役义务的形式有 ( ) 。
A. 服现役
B. 服预备役
C. 参加学生军训
D. 当民兵
答案：ABC

288. 公民服现役的形式有 ( ) 
A. 应征服现役
B. 报考军事院校
C. 直招士官生
D. 报考军队文职人员
答案：ABC

289. 公民依法可以缓征的情况是 ( ) 
A. 正在全日制学校上学的学生
B. 成为家里唯一劳动力的男性青年
C. 正在服刑期间的人员
D. 考上公务人员的青年
答案：AB

290. 公民的国防权力简单地说有以下几种 ( ) 
A. 建议权
B. 制止权
C. 检举权
D. 要求补偿权
答案：ABCD

291. 中国的三结合武装力量体系包括 ( ) 
A. 解放军
B. 预备役部队
C. 武警
D. 民兵
答案：ACD

292. 中央军队五大战区包括 ( ) 
A. 东部
B. 南部
C. 西部
D. 北部
E. 中部
答案：ABCDE

293. 我军全心全意为人民服务的唯一宗旨在课程中老师讲到的例子有 ( ) 
A. 也门撤侨
B. 抗洪救灾战士露宿大堤
C. 上海解放后战士露宿街头
D. 抗震救灾冲向第一线
答案：ABCD

294. 中国人民解放军具体的任务是： ( ) 。
A. 巩固国防
B. 抵抗侵略
C. 保卫祖国
D. 保卫人民的和平劳动
E. 参加国家建设事业
答案：ABCDE

295. 陆军发展中的两次飞跃分别发生在 ( ) 
A. 1985年
B. 1995年
C. 2005年
D. 2015年
答案：AD

296. 目前解放军陆军已经发展成真正的合成军，其主要的兵种有 ( ) 。
A. 步兵
B. 炮兵
C. 装甲兵
D. 防空兵
E. 陆军航空兵
答案：ABCDE

297. 《新时代的中国国防》白皮书强调的新时代中国国防的根本目标是，坚决捍卫国家的 ( ) 。
A. 主权
B. 安全
C. 发展
D. 进步
答案：ABC

298. 新中国成立后，解放军在保卫祖国的斗争中进行了一系列的战争或武装冲突，课程中老师举的例子有 ( ) 。
A. 抗美援朝
B. 西沙之战
C. 南沙之战
D. 抗美援越
答案：ABC

299. 当前步枪使用的95—1式步枪与传统的步枪相比，有以下几点不同 ( ) 。
A. 塑料枪身
B. 口径小了为5.8毫米
C. 加装了瞄准镜
D. 可以装弹50发
答案：ABC

300. 传统牵引火炮要想进行实弹射击打出炮弹，必须要进行相关的工作，这些工作主要有 ( ) 。
A. 地面处于水平状态
B. 大架要打开
C. 要将助锄埋入泥土中
D. 要进行试射
答案：ABCD

301. 相对于传统牵引火炮，现代化的自行火炮具有以下特点 ( ) 
A. 准备快
B. 发射快
C. 跑得快
D. 热得快
答案：ABC

302. 打航母的关键之处不在于是否将航母打沉没或者打碎，而是只需要将航母上的什么打掉(打坏)就可以了？ ( ) 
A. 发动机
B. 飞机起飞装置
C. 降落时的拦阻装置
D. 舰体炸个大洞
答案：BC

303. 20世纪90年代，台湾地区老百性说台湾的“台独分子”有“3怕”，这个“3怕”是 ( ) 。
A. 核潜艇
B. 航母
C. 苏27战机
D. 无数的导弹
答案：ACD

304. 潜艇按动力分主要有 ( ) 
A. 柴油核潜艇
B. 常规动力潜艇
C. 核动力潜艇
D. 战略潜艇
答案：BC

305. 我军目前的反舰导弹主要有 ( ) 
A. YJ12
B. YJ18
C. YJ21
D. YJ31
答案：AB

306. 世界上排水量最大的军舰是航空母舰，按照排水量由大到小分别称为大型，中型，轻型航母，其排水量分别对应 ( ) 
A. 8万是吨以上
B. 4至6万吨
C. 2万吨
D. 1万吨
答案：ABC

307. 中国空军的轰6K轰炸机曾经飞过的祖国大陆之外的中国领土是 ( ) 。
A. 渤海
B. 黄海
C. 台湾岛
D. 南海黄岩岛
答案：CD

308. 空警2000预警机参加过的阅兵式有 ( ) 。
A. 1999年国庆阅兵式
B. 2009年国庆阅兵式
C. 2017年建军90周年阅兵式
D. 2019年国庆阅兵式
答案：BD

309. 当前我空军装备的先进的国产歼击机主要有 ( ) 。
A. 歼10
B. 歼11
C. 歼20
D. 歼35
答案：ABC

310. 空军的主要机种有 ( )  等。
A. 歼击机
B. 战斗机
C. 轰炸机
D. 强击机
答案：ACD

311. 联勤保障部队按照联合_____、联合_____、联合_____的要求，加快融入联合作战体系，提高一体化联合保障能力，努力建设一支强大的现代化联勤保障部队。 ( ) 
A. 作战
B. 行动
C. 训练
D. 保障
答案：ACD

312. 联勤保障部队下辖无锡、 ( ) 沈阳等5个联勤保障中心。
A. 桂林
B. 西宁
C. 济南
D. 郑州
E. 西安
答案：ABD

313. 中国新组建的战略支援部队通俗地讲，主要包括以下几个部分 ( ) 
A. 网军
B. 天军
C. 心战
D. 电子战、信息战
答案：ABCD

314. 在最近30余年以来，美军打了多场局部战争，无一例外的是，所有的战争美军都进行了广泛的战争动员，包括 ( ) 。
A. 兵员动员
B. 运输力量动员
C. 医药卫生动员
D. 生活保障动员
答案：ABC

315. 按动员的对象区分，动员有 ( ) 。
A. 人力
B. 财力
C. 权力
D. 物力
答案：ABD

316. 1998年的抗洪救灾斗争中，进行了广泛的动员，主要的有 ( ) 。
A. 武装力量
B. 国发经济
C. 邮电通信
D. 科学技术
答案：ABCD

317. 国防动员的应急功能指的是应对一些自然灾害而进行的动员，这些灾害主要有 ( ) 。
A. 地震
B. 台风
C. 特大暴雨
D. 突发公共卫生事件
答案：ABCD

318. 20世纪60年代初，为了遏制美蒋企图反攻大陆，我们进行了全国范围的总动员，具体有 ( ) 。
A. 在全国广泛进行宣传发动
B. 向东南沿海紧急调兵遣将
C. 军工部门紧急动员扩产
D. 东南沿海加强军民联防
答案：ABCD

319. 国家的综合国力只有通过动员才能转化为战争的实力，以所，动员是战争力量的 ( ) 。
A. 聚集器
B. 凝聚器
C. 转换器
D. 变压器
答案：BC

320. 国防动员的应战功能动员是 ( ) 
A. 打赢战争的必要条件
B. 打赢战争的基础环节
C. 遏制危机的有效手段
D. 吓唬敌人的有力武器
答案：BC

321. 按动员时机区分动员有 ( ) 
A. 应战动员
B. 应急动员
C. 战争初期动员
D. 战争中后期动员
答案：BCD

322. 民兵支前的工作有 ( ) 。
A. 抬担架
B. 救护伤员
C. 技术人员
D. 技术兵器操作
答案：ABCD

323. 后备兵员动员也是武装力量动员的一个重要内容，主要包括 ( ) 。
A. 补充不满编的现役部队
B. 补充部队战斗减员
C. 补充扩建部队
D. 补充新组建的部队
答案：ABCD

324. 为什么要对现役部队动员，因为现役部队在平时与战时有许多不同，需要通过动员而转换至战时状态。现役部队平时与战时不同的方面为 ( ) 。
A. 规模不同
B. 人数不同
C. 编制不同
D. 战备程度不同
答案：ACD

325. 武装力量动员的内容包括 ( ) 。
A. 现役部队动员
B. 预备役部队动员
C. 后备兵员动员
D. 民兵动员
答案：ABCD

326. 加强国防建设可以达到这样的目的，即 ( ) 。
A. 平时多养兵
B. 平时少养兵
C. 战时不出兵
D. 战时多出兵
答案：BD

327. 工业动员的主要内容有 ( ) 。
A. 调整工业生产能力增加军品产量
B. 调整工业布局增强国家长期支持战争的能力
C. 完善工业动员体制
D. 加快武器制造
答案：ABC

328. 战争中敌对国家往往会对敌方国家进行经济打击，其主要手段有 ( ) 。
A. 经济破坏
B. 金融扰乱
C. 经济制裁
D. 抢夺粮食
答案：ABC

329. 未来作战中中国民兵将要担任一系列的重要的保障任务，包括 ( ) 。
A. 情报侦察
B. 通信保障
C. 信息作战
D. 装备维修
E. 卫勤保障
F. 开山修路
答案：ABCDE

330. 国家号召大学生入伍，是为满足军队建设的迫切需要而做出的战略决定，这些迫切需要有 ( ) 。
A. 军队现代化建设的迫切需要
B. 完成多样化军事任务的迫切需要
C. 部队人才队伍建设的迫切需要
D. 社会对退役士兵文化素质和技能的迫切需要
答案：ABCD

331. 医药卫生动员包括 ( ) 。
A. 卫生人力动员
B. 卫生物资动员
C. 医药卫生设施动员
D. 药品动员
答案：ABC

332. 财政金融动员的主要方式有 ( ) 。
A. 实行战时财政预算
B. 实行战时税制
C. 举借债务
D. 寻求国外援助
答案错误

333. 收拾好行囊，部队里也有 ( ) 。
A. 诗
B. 远方
C. 理想
D. 信念
答案：AB

334. 在严的方面，学会了 ( ) 。
A. 服从
B. 忍耐
C. 负责
D. 节俭
E. 自律
F. 自立
G. 细心
H. 勤劳
答案：ABCDEFGH

335. 在勇的方面，学会了 ( ) 。
A. 吃苦
B. 勇敢
C. 拼搏
D. 从容
E. 亮剑
F. 较量
答案：ABCDF

336. 在仁的方面，学会了 ( ) 。
A. 宽容
B. 孝道
C. 团结
D. 友爱
答案：ABD

337. 在信的方面，学会了 ( ) 。
A. 体贴
B. 奉献
C. 务实
D. 沉默
E. 风度
F. 自信
G. 执着
H. 积极
I. 认真
J. 团结
答案：ABCDEFGH

338. 在智的方面，学会了 ( ) 。
A. 求知
B. 思考
C. 合作
D. 团结
答案：ABC

339. 中国当代富豪们当过兵的有 ( ) 。
A. 王王林
B. 王石
C. 任正非
D. 刘强东
答案：ABC

340. 年青时当过兵的党的领导人有 ( ) 。
A. 毛泽东
B. 邓小平
C. 江泽民
D. 习近平
答案：ABD

341. 《国家安全法》明确的18个领域的国家安全任务可以概括为三个方面，即(               )。
A. 传统国家安全领域       
B. 非传统国家安全领域
C. 特殊国家安全领域      
D. 重点国家安全领域
答案：ABD

342. 与其他各种国家安全观相比较，总体国家安全观具有鲜明的( )和持续性特点。
A. 时代性   
B. 人民性    
C. 系统性    
D. 包容性
答案：ABCD

343. 《中华人民共和国国家安全法》对“国家安全”的定义是：“国家安全是指国家(   )、经济社会可持续发展和国家其他重大利益相对处于没有危险和不受内外威胁的状态，以及保障持续安全状态的能力。”
A. 国家政权   
B. 主权   
C. 统一和领土完整  
D. 人民福祉
答案：ABCD

344. 大学生国家安全教育的主要内容有(                  )、国家安全技能教育、国家安全战略教育等。
A. 国家安全相关法律教育
B. 国家安全形势教育
C. 国家安全思想教育
D. 国家安全基础知识教育
答案：ABCD

345. 坚持(                 )是维护我国国家安全的基本原则之一。
A. 先发制人       
B. 预防为主
C. 标本兼治      
D. 专群结合
答案：BCD

346. 如何维护我国的经济安全？(                    )。
A. 要坚持中国特色社会主义基本经济制度不动摇
B. 要建设现代化经济体系
C. 要打好防范化解金融风险这场攻坚战
D. 要把发展实体经济作为重中之重
答案：ABCD

347. 在维护重点国家安全领域方面，当前和今后一个时期要着重抓好6个领域的重点任务——要着重抓好政治安全、国土安全、(               )等重点领域的国家安全工作。
A. 经济安全       
B. 社会安全
C. 网络安全      
D. 外部安全
答案：ABCD

348. 我国的军事创新体系是以国家创新体系为基础的，具体包括 ( ) 等几大创新体系
A. 军事理论创新  
B. 军事技术创新  
C. 军事组织创新  
D. 军事管理创新
答案：ABCD

349. 我军传统军事战略功能，要发展为 ( ) 的功能
A. 应对危机  
B. 维护和平  
C. 遏制战争  
D. 打赢战争
答案：ABCD

350. 毛泽东提出的十大军事原则，今后 ( ) 
A. 不用发展创新了 
B. 不用继承了 
C. 加以补充和发展   
D. 有的可能要修正
答案：CD

351. 2004年军事战略方针提出了更加具体的战略指导原则，即 ( ) 
A. 遏制危机     
B. 控制战局   
C. 打赢战争   
D. 灵活机动
答案：ABC

352. 军队要 ( ) 整个国家建设大局
A. 服从  
B. 服务  
C. 保障  
D. 保驾
答案：AB

353. 坚持党对军队的绝对领导，我军绝对不能搞 ( ) 
A. 政治教育  
B. “非党化”  
C. “国家化”    
D. 和“非政治化”
答案：BCD

354. 胡锦涛强调要大力弘扬我军“听党指挥、服务人民、英勇善战”的优良传统 ( ) 
A. 听党指挥    
B. 服务人民    
C. 英勇善战   
D. 献身使命
答案：ABC

355. 在美国少数军人认为要把战火延伸到中国大陆地区时，美国国内多数人持反对态度，并最终阻止了少数军人的愚蠢行为，因为大多数人认为，如果将战火引到中国大陆，美国将会一错再错，他们将会面临 ( ) 。
A. 错误的时间
B. 错误的地点
C. 错误的对象
D. 错误的战争
答案：ABCD

356. 中央在决策是否参加朝鲜战争时，很多领导同志都不主张参战，其原因是当时的中国与美国相比，实力非常弱小，如 ( ) 。
A. 钢产量只有其1/147
B. 煤产量只有其1/1000
C. 工业总产值只有其1/28
D. GDP只有其1/50
答案：AC

357. 中央苏区一共进行了五次反围剿斗争，其中毛泽东同志亲自指挥的是 ( ) 。
A. 第一次
B. 第二次
C. 第三次
D. 第四次
E. 第五次
答案：ABC

358. 在2019年国庆阅兵式的游行队伍里，出现了这样的画面  ( ) 。
A. 毛泽东开国大典上讲话的照片
B. 毛泽东在延安时的照片
C. 坚持毛泽东思想七个字
D. 坚持毛泽东军事思想九个字
答案：AC

359. 毛泽东同志认为战争 ( ) 。
A. 是政治的继续
B. 是经济的斗争
C. 是流血的政治
D. 是失控的决斗
答案：AC

360. 毛泽东军事思想形成的标志是以下文章的发表 ( ) 。
A. 中国革命战争的战略问题
B. 井冈山的斗争
C. 星星之火可以燎原
D. 论持久战
答案：AD

361. 毛泽东与朱德同志共同创造了游击战的十六字诀，就是 ( ) 。
A. 敌进我退
B. 敌驻我扰
C. 敌疲我打
D. 敌逃我追
E. 敌退我追
答案：ABCE

362. 毛泽东军事思想的基本内容包括 ( ) 。
A. 战争观和军事问题方法论
B. 人民战争思想
C. 人民军队思想
D. 人民战争的战略战术思想
E. 国防建设思想
答案：ABCDE

363. 我军坚持的三大原则是，坚持 ( ) 。
A. 工农一致
B. 官兵一致
C. 军民一致
D. 瓦解敌军
答案：BCD

364. 我军实行的几大民主指的是 ( ) 。
A. 政治
B. 经济
C. 责任
D. 军事
答案：ABD

365. 解放军的几大任务是 ( ) 。
A. 战斗队
B. 宣传队
C. 工作队
D. 生产队
答案：ACD

366. 三湾改编的成果之一是加强了党对军队的绝对领导，提出了 ( ) 。
A. 团以下也要设立党代表
B. 支部建在连上
C. 排要有党小组
D. 班要有党员
答案：ABCD

367. 人民战争的几个重要内容包括“ ( ) ”。
A. 人民群众是战争胜负的决定力量
B. 战争的正义性是实行人民战争的政治基础
C. 战争胜负的决定因素是人不是物
D. 马克思主义政党的正确领导是实行人民战争的必要条件
答案：ABCD

368. 人民战争的两个重要标志是战争的 ( ) 。
A. 正义性
B. 群众性
C. 革命性
D. 坚决性
答案：AB

369. 我军全心全意为人民服务的作风可以从以下方面体现 ( ) 。
A. 抗洪救灾
B. 抗震救灾
C. 露宿街头
D. 军民一致
答案：ABC

370. 毛泽东军事思想的历史作用体现在 ( ) 。
A. 是中国革命胜利的指南
B. 极大地丰富了马列主义军事理论宝库
C. 在世界上产生了广泛的影响
D. 今天仍然是我们克敌制胜的法宝
答案：ABCD

371. 为什么国防建设要坚持独立自主的方针？是因为花钱 ( ) 。
A. 买不来真正的国防
B. 买不来有自己主导权的武器
C. 全靠买关键时候会受制于人
D. 花钱太多
答案：ABC

372. 毛泽东国防建设思想的主要内容是 ( ) 。
A. 国防不可没有
B. 依靠全民办国防
C. 以积极防御为指导
D. 坚持独立自主的方针
答案：ABCD

373. 毛泽东同志确立了向国防科技尖端发展的战略，随后我们在这方面取得了巨大的进展，其标志就是 ( ) 。
A. 原子弹成功爆炸
B. 氢弹成功爆炸
C. 人造卫星成功上天
D. 核潜艇取得成功
答案：ABCD

374. 毛泽东同志建国后在国防建设思想方面有了巨大的成就，具体而言就是体现在 我们要 ( ) 。
A. 建设现代化、正规化国防军，抵御外敌入侵
B. 确立了向国防科技尖端发展的战略
C. 取得了一系列武装斗争的胜利
D. 积极防御战略思想有了新的发展
答案：ABD

375. 积极防御思想还体现在两立足，即立足于 ( ) 。
A. 以劣势装备战胜优势装备之敌
B. 复杂困难情况下作战
C. 人定胜天
D. 集中优势兵力
答案：AB

376. 积极防御思想体现在三坚持和两立足，即坚持 ( ) 。
A. 后发制人
B. 人民战争
C. 连续作战
D. 持久作战
答案：ABD

377. 习近平指出:“党在新时代的强军目标是建设一支(          )的人民军队，把人民军队建设成为世界一流军队”。
A. 听党指挥  
B. 能打胜仗  
C. 保障有力 
D. 作风优良
答案：ABD

378. 军队首先是一个战斗队，(    )和(   )是军人的天职。
A. 打仗  
B. 经商  
C. 做宣传工作  
D. 准备打仗
答案：AD

379. 国防和军队现代化建设是一个系统工程，必须坚持(          )。
A. 政治建军  
B. 改革强军   
C. 科技兴军   
D. 依法治军
答案：ABCD

380. 习近平强调，要着力培养(          )的新时代革命军人。
A. 有灵魂   
B. 有本事   
C. 有血性    
D. 有品德
答案：ABCD

381. 在长期实践中，我们党坚持把马克思主义基本原理同中国革命战争和人民军队建设实践相结合，先后形成毛泽东军事思想、(    )等具有中国特色的马克思主义军事理论成果。
A. 邓小平新时期军队建设思想  
B. 江泽民国防和军队建设思想
C. 胡锦涛国防和军队建设思想  
D. 习近平强军思想
答案：ABCD

382. 习近平强调，党的十八届三中全会决定成立国家安全委员会，是___________。
A. 推进国家治理体系和治理能力现代化、实现国家长治久安的迫切要求
B. 全面建成小康社会、实现中华民族伟大复兴中国梦的重要保障
C. 更好适应我国国家安全面临的新形势新任务
D. 建立集中统一、高效权威的国家安全体制，加强对国家安全工作的领导。
答案：ABCD

383. 习近平指出，调整组建新的__________，是党中央和中央军委着眼实现中国梦强军梦作出的重大决策，是推进改革强军、构建我军新型军事人才培养体系和军事科研体系的战略举措，必将对加快推进国防和军队现代化、把我军建设成为世界一流军队产生重大而深远的影响。
A. 军事科学院
B. 国防大学
C. 国防科技大学
D. 战略学院
答案：ABC

384. 2014年8月29日下午，习近平在十八届中共中央政治局第十七次集体学习时说，这次学习的主题为“世界军事发展新趋势和推进我军军事创新”，这场军事领域的发展变化，以信息化为核心，以__________、组织体制和军事管理创新为基本内容，以重塑军事体系为主要目标，正在推动新军事革命深入发展。
A. 军事战略
B. 军事技术
C. 作战思想
D. 作战力量
答案：ABCD

385. 冷兵器战争是主要使用木石、青铜、铁制等冷兵器为主要武器装备及相应作战方法的战争形态。下列哪些兵器属于冷兵器： ( ) 。
A. 大刀 
B. 长矛
C. 火枪
D. 坦克
答案：AB

386. 下列关于战争发展历程的说法正确的是： ( ) 。
A. 战争作为一种历史性社会活动，经历了一个漫长的发展过程
B. 从时间上可以区分为古代战争、近代战争、现代战争
C. 从社会发展史的角度，可以分为奴隶社会时期的战争、封建社会时期的战争和资本主义上升时期的战争，以及帝国主义和无产阶级革命时期的战争等 
D. 从科技与战争互动影响的角度，可以把战争区分冷兵器战争、热兵器战争、机械化战争和冷兵器战争等战争形态
答案：ABCD

387. 下列关于战争的影响和作用的说法正确的是： ( ) 。
A. 战争对人类社会只有消极作用，而没有积极作用
B. 战争受政治、经济、科技和文化等方面条件的制约，又具有极大的反作用 
C. 战争对政治、经济、科技、文化等既可能破坏作用，也可能有促进作用 
D. 战争只是单纯的消耗社会资源，没有任何有利的一面
答案：BC

388. 下列关于战争的说法正确的是： ( ) 。
A. 战争是政治的继续
B. 战争与经济紧密相联 
C. 战争与科技共同发展 
D. 战争与文化活动相互影响、相互促进
答案：ABCD

389. 下列关于对待战争的态度说法正确的是： ( ) 。
A. 支持正义战争
B. 反对非正义战争
C. 以正义战争反对非正义战争
D. 用正义战争消灭非正义战争
答案：ABCD

390. 下列哪些战争具有典型的机械化战争的特点： ( ) 。
A. 第一次世界大战 
B. 第二次世界大战 
C. 海湾战争 
D. 伊拉克战争
答案：AB

391. 下列关于大学生与世界新军事革命的关系说法正确的是 ( ) 。
A. 大学生思想敏锐，应当关注世界新军事革命的发展
B. 大学生是科技发展的主力军，可以从不同角度为中国特色军事变革贡献力量
C. 世界新军事革命发生在军事领域，与大学生的学习和工作没有关系
D. 关注世界新军事革命和中国特色军事变革，是大学生关心和支持国防建设的重要体现
答案：ABD

392. 为积极推进中国特色军事变革，中国军队应当 ( ) 。
A. 始终坚持以正确的理论指导军事变革
B. 始终坚持以开拓精神推动军事变革
C. 始终坚持以科技创新推动军事变革
D. 始终坚持走中国特色强军之路
答案：ABCD

393. 随着世界新军事革命的发展，出现了很多新的军事理论。下列哪些是新军事革命浪潮中涌现出的新的军事理论？ ( ) 
A. 非线式作战
B. 非接触作战
C. 网络中心战
D. 装甲闪电战
答案：ABC

394. 新军事革命的主要特征有 ( ) 。
A. 武器装备智能化
B. 体制编制精干化
C. 指挥控制自动化
D. 作战空间多维化
答案：ABCD

395. 新军事革命的主要内容包括 ( ) 。
A. 创新军事技术
B. 创新体制编制
C. 创新军事理论
D. 创新作战方式
答案：ABCD

396. 下列关于大学生与信息化战争的关系说法正确的是 ( ) 。
A. 遏制和打赢信息化战争需要依靠全体民众的力量，也需要广大大学生的关心和支持
B. 大学生应当确立与信息化战争相适应的思想观念
C. 大学生是最具潜力的发展群体，也是遏制和打赢战争最可依赖的一个力量
D. 广大大学生应当充分学习包括军事知识在内的各种知识，以各种方式，直接或间接地为维护中国国家安全贡献力量
答案：ABCD

397. 下列关于中国未来可能面对战争的说法正确的是： ( ) 。
A. 中国未来可能面对的战争，也将是信息化战争
B. 只有准确把握新世界新军事革命和信息化战争形态演变提出的新要求，按照加速推进中国特色军事变革的要求，深入进行国防和军队建设，充分做好军事斗争准备，才能提高打赢信息化战争的各种能力，实现遏制和打赢战争的目标
C. 把建设信息化军队、打赢信息化战争作为重要的战略目标
D. 要贯彻全面建设信息化国防的方针和原则，为遏制和打赢战争奠定最为坚实的基础
答案：ABCD

398. 下列关于信息化战争形态发展说法正确的是： ( ) 。
A. 信息化战争形态的发展经历了一个较为长期的过程
B. 信息化战争与机械化战争不是相互割裂的，在一定时期是相互交织的
C. 当前人类的战争既有信息化战争的特点，也还带有一定的传统战争的特点
D. 信息化战争形态将在不远的将来发展成熟
答案：ABCD

399. 从近几十年具有信息化战争特点的典型战例中，我们可以得出很多启示。下列相关说法正确的是： ( ) 。
A. 占据信息优势的军队更容易获得军事上的主动权
B. 在历次战争中，均反映了美国等发达国家新军事革命的成果
C. 信息化战争形态从萌生到发展，不断实现新的跃进，正在逐步走向成熟
D. 美国等发达国家在战争中获得了军事上的胜利，也获得了政治上的胜利，给地区与世界带来和平与稳定
答案：ABC

400. 作战平台的两个基本功能是 ( ) 。
A. 搭载   
B. 机动   
C. 隐身   
D. 火力杀伤
答案：AB

401. 信息化作战平台与机械化作战平台的区别是 ( ) 。
A. 技术含量不同  
B. 设计观念不同  
C. 使用观念不同
D. 研制时间不同   
E. 性能差异较大
答案：ABCDE

402.  ( ) 等性能的综合叠加，代表了陆军信息化装备的发展趋势。
A. 机动力   
B. 防护力  
C. 火力    
D. 信息力
答案：ABCD

403. 第四代战斗机的４Ｓ标准分别指的是 ( ) 。
A. 隐身(Stealth)         
B. 超音速巡航(supercruise)
C. 超视距攻击(Superior-sensor)  
D. 超机动(Super-agility)
答案：ABCD

404. 美军现役的战略运输机有 ( ) 。
A. C-5    
B. C-17   
C. C-130    
D. C-141
答案：ABD

405. 海军信息化装备按照不同的任务区域可以分为 ( ) 三大类。
A. 水面舰艇  
B. 潜艇   
C. 舰载机  
D. 航空母舰
答案：ABC

406. 当今世界典型的舰载战斗机有 ( ) 等。
A. 美国F-35C   
B. 英国“鹞”式 
C. 法国“阵风” 
D. 俄罗斯“苏-33”
答案：ABCD

407. 当前全世界仅有美国、 ( ) 等五国拥有攻击型核潜艇。
A. 俄罗斯     
B. 英国     
C. 法国     
D. 中国
答案：ABCD

408. 潜艇主要分为 ( ) 三大类。
A. 弹道导弹核潜艇 
B. 攻击型核潜艇 
C. 常规潜艇   
D. 防御型潜艇
答案：ABC

409. 美国“福特”级航母较“尼米兹”级航母的主要区别在于采用了 ( ) 。
A. 电磁弹射器 
B. 先进拦阻装置 
C. 新型核动力推进系统 
D. 新型配电系统
答案：ABCD

410. 中国首艘国产航母属于 ( ) 航母。
A. 常规动力  
B. 核动力  
C. 轻型   
D. 中型
答案：AD

411. .20世纪80年代初，中国国防工业确立了 ( ) 的发展原则。
A. 装备一代  
B. 研制一代 
C. 预研一代 
D. 设计一代
答案：ABC

412. 党的二十大明确，全面建设社会主义现代化国家的战略要求是( )。
A. 如期实现建军一百年奋斗目标
B. 实现国防和军队现代化
C. 建设一支听党指挥、能打胜仗、作风优良的人民军队
D. 加快把人民军队建成世界一流军队
答案：AD

413. 由于台风影响日本关西机场关闭，大量游客滞留，而中国公民却能迅速撤离，其原因是 中国政府派出车辆把中国人接走了
正确 错误
答案：true

414. 某年两个脑残分子在南京紫金山拍摄“假鬼子”照片发朋友圈被拘留，这个事件告诉我们年青人应该有一点政治头脑。
正确 错误
答案：true

415. 撤侨行动中，海军战士们听懂冷馒头加咸菜，可能是军舰伙食保障能力不好。
正确 错误
答案：false

416. 也门撤侨行动中，我海军还帮助巴基斯坦等车撤走了约200名侨民。
正确 错误
答案：true

417. 鸦片战争之后，中国进入了一个没完没了的割地赔款时代，一直持续到民国政府时代。
正确 错误
答案：true

418. 历史事实告诉我们轵有国防强大了，才能保一方平安，我们经济建设的成就才能不被别人抢走。
正确 错误
答案：true

419. 只拥有土地，人口，范围，而不拥有防卫力量，是不可能构成一个完整国家的。
正确 错误
答案：true

420. 国防不仅仅只是军队的事，还与政治、经济、外交、科技及教育有关。
正确 错误
答案：true

421. 当今世界实行扩张型国防，称霸世界的国家是美国。
正确 错误
答案：true

422. 旧中国近百年间向西方世界作出了巨大的经济赔款说明了一点，当国防衰弱时，一个国家将会付出巨大的、沉重的代价。
正确 错误
答案：true

423. 旧中国近百年间向西方世界作出了巨大的经济赔款，仅仅最大的7笔赔款，按复利5%计算100年，就相当于全国每个人大约3万多元，如果多计算一二十年，则相当于全国每人约5万元。
正确 错误
答案：true

424. 盛唐时我国的版图面积有可能是历史上最大的。
正确 错误
答案：true

425. 我们中国实行的自卫型国防，建国几十年来有力地维护了国家和人民的利益。
正确 错误
答案：true

426. 中国人民志愿军入朝参战时的口号是抗美援朝，保家卫国。
正确 错误
答案：true

427. 1995年我将要进行导弹试射的公告发出后，立即导弹台湾地区出现了混乱，其物价迅速爆长。
正确 错误
答案：true

428. 1995年7月我军对台湾岛东北方向试射导弹的目的，是为了打击台独行为。 
正确 错误
答案：true

429. 对越自卫反击作战一战打出了南部边境地区的40多年和平。
正确 错误
答案：true

430. 在珍宝岛保卫战中入侵的苏联军队除了逃跑的全部被我军歼灭。
正确 错误
答案：true

431. “大炮一响，黄金万两”指的是打仗能够挣钱。
正确 错误
答案：false

432. 决定战争胜利的是人而不是物，所以打胜仗有没有先进的武器是无所谓的，只有要人就可以了。
正确 错误
答案：false

433. 《中华人民共和国兵役法》第3条说，中华人民共和国公民，不分民族、种族、职业、家庭出身、宗教信仰和教育程度，都有义务依照本法的规定服兵役。
正确 错误
答案：true

434. 依据国防动员法，当一艘大型货轮正在进行商业活动时，如果国家进入战争状态，需要征用这艘商船，则商船必须立即停止商务活动，完成国防征用，就近改造。 
正确 错误
答案：true

435. 《兵役法》第45条规定，高等院校的学生在就学期间，必须接受基本军事训练。 
正确 错误
答案：true

436. 我军唯一宗旨是全心全意为人民服务。
正确 错误
答案：true

437. 中国人民解放军的使命是捍卫国家的尊严以及领土完整。
正确 错误
答案：true

438. 解放军执行的具体任务是：巩固国防，抵抗侵略，保卫祖国，保卫人民的和平劳动，参加国家建设事业。
正确 错误
答案：true

439. 1985年，陆军发展中一个最重要的标志就是陆军的军改成了集团军。
正确 错误
答案：true

440. 中国人民解放军诞生的时间是1927年8月1日。 
正确 错误
答案：true

441. 炮兵是以火炮、火箭炮、地地战役战术导弹和反坦克导弹为基本装备并主要遂行地面火力突击任务的战斗兵种。
正确 错误
答案：true

442. 99A主战坦克前装甲外面挂的约一张A4纸大小的东西称为反应式装甲，其作用是为了保护坦克防护装甲。
正确 错误
答案：true

443. 火箭炮的炮弹出炮口速度较低，约为50至80米每秒，所以刚刚发射出去的火箭炮弹，肉眼是可以看得到的。而榴弹炮及加农炮的炮弹因为出口速度超过音速，一般肉眼看不到。
正确 错误
答案：true

444. 海军使命有一条是保护己方海上交通线，破袭敌方海上交通线。
正确 错误
答案：true

445. 四代战机的一个最基本的要求是隐身性能。
正确 错误
答案：true

446. 火箭军是中国大国地位的战略支撑，是维护国家安全的重要基石。
正确 错误
答案：true

447. 第二炮兵部队成立的日期是1966年7月1日。
正确 错误
答案：true

448. 联勤保障部队包括仓储、卫勤、运输投送、输油管线、工程建设管理、储备资产管理、采购等力量。
正确 错误
答案：true

449. “战略支援部队就是支援战场作战，保证作战的顺利进行，它是联合作战的重要力量。”
正确 错误
答案：true

450. 这支部队，没有飞机导弹大炮，玩的是纯技术，却拥有无比的威慑力，能时刻维护我们国家的信息安全、网络安全、空间安全，并给决策层和其他各军兵种提供全天候信息情报支援。
正确 错误
答案：true

451. 东风17导弹有弹头可以进行各种不规则的变轨飞机，所以目前的导弹防御系统毫无办法。
正确 错误
答案：true

452. 孙子兵法曰：一曰度，二曰量，三曰数，四曰称，五曰胜。地生度，度生量，量生数，数生称，称生胜。这其中度、量、数、称、胜的转化过程，就是一个战争动员的过程。
正确 错误
答案错误

453. 一对年青人大学毕业后为了在一个大城市安家需要买房，需要向全家长辈借钱的过程就是一全家总动员。
正确 错误
答案：true

454. 国防动员是指国家为准备战争和实施战争，在相应的范围内，由平时状态转入战时状态所采取的统一调动人力、物力和财力的紧急措施。
正确 错误
答案：true

455. 在大办民兵师的过程中，1958年底，中国民兵已发展成为包括5000多个师、4000多个团，总人数达2.2亿的全民性武装组织。
正确 错误
答案：true

456. 预备役部队动员是指，战时预备役部队成建制转服现役的活动，是战时成建制动员的主要形式。
正确 错误
答案：true

457. 国防动员建设的成果可以直接为经济建设服务，比如说目前的人防地下工程，可以用来作停车场，地下商场等。
正确 错误
答案：true

458. 财政金融动员的目的是多渠道筹措战争经费，保证战争需要，保证国家战时经济稳定。
正确 错误
答案：true

459. 自人类社会进入工业时代以来，经济动员能力特别是战时工业动员生产能力的强弱已成为决定战争最后胜负的关键因素。
正确 错误
答案：true

460. 工业动员是指在战时挖掘工业生产能力，迅速扩大工业产品特别是军品生产规模，满足军队作战需要。
正确 错误
答案：true

461. 为了应对战时及平时霸权国家进行的经济制裁，必须大力发展经济，特别是战时的经济。
正确 错误
答案：true

462. 经济动员是保障战争物质需求的基本手段。
正确 错误
答案：true

463. 英国元帅蒙可马利说，战争光靠原子弹解决不了胜负问题，谁要想入侵中国，碰到了中国的民兵，是进得去、出不来的……要把进攻中国作为战争的禁律之一。
正确 错误
答案：true

464. 依法可以缓征的正在全日制高等学校就学的学生，本人自愿应征并且符合条件的，可以批准服现役，原就读学校应当按照有关规定保留其学籍，退伍后准其复学。
正确 错误
答案：true

465. 医疗卫生动员，对于减轻战争对人员的伤害，巩固和恢复部队的战斗力以及鼓舞军心士气作用重大。
正确 错误
答案：true

466. 医药卫生动员是指统一调度和使用医药卫生方面的人力、药品器材、设备和设施，满足战争对医疗卫生保障需求所进行的活动。
正确 错误
答案：true

467. 当过兵的都知道，生命里有了当兵的历史一辈子都不后悔。
正确 错误
答案：true

468. 大学生当兵，可以学到很多东西，如果用孙子兵法的话说，就是将者：智、信、仁、勇、严也，也就是在这五个方面都会有收获。
正确 错误
答案：true

469. 总体国家安全观是国家安全的理论指南和行动指南。
正确 错误
答案：true

470. 贯彻落实总体国家安全观，只需要重视内部安全。
正确 错误
答案：false

471. 习近平总书记在2014年4月15日的中央国家安全委员会第一次会议上首次正式提出了总体国家安全观。
正确 错误
答案：true

472. 安全的基本含义就是客观上不存在威胁，主观上不存在恐惧。
正确 错误
答案：true

473. 国家是阶级统治的工具，同时兼有社会管理的职能。
正确 错误
答案：true

474. 教思政(【2018】1号)文件明确要求要“设立国家安全学一级学科”。
正确 错误
答案：true

475. 大学生国家安全教育有益于大学生科学的国家安全意识的形成。
正确 错误
答案：true

476. 大学生国家安全教育的实质或根本目的是培育大学生的爱国主义精神及民族精神。
正确 错误
答案：true

477. 网络安全不是我国当前面临的最复杂、最现实、最严峻的非传统安全问题之一。
正确 错误
答案：false

478. 社会安全与人民群众切身利益关系最密切，是人民群众安全感的晴雨表，是社会安定的风向标。
正确 错误
答案：true

479. 坚持中国共产党领导，坚持社会主义制度，确保党执政安全，是维护我国政治安全的根本任务。
正确 错误
答案：true

480. 我们的原则是党指挥枪，而决不允许枪指挥党
正确 错误
答案：true

481. 不断实行和实现军队建设指导思想的战略转变，这是我们党的领导集体对军队建设基本规律的一条重要认识
正确 错误
答案：true

482. 中国倡导的新安全观为推动世界和平发展给出了一个理性可行的行动方案
正确 错误
答案：true

483. 中国永远不会称霸
正确 错误
答案：true

484. 霸权主义、强权政治的存在，不是解决和平与发展问题的主要障碍
正确 错误
答案错误

485. 关于战争与和平的理论是党的军事指导理论的重要内容
正确 错误
答案错误

486. 党的军事指导理论是党的中国特色社会主义建设思想的军事篇
正确 错误
答案：true

487. 毛泽东军事思想不包括反侵略战争思想
正确 错误
答案：false

488. 国防活动，既包括军事活动，也包括民事活动
正确 错误
答案错误

489. 可以从军事、军事思想、军事理论和马克思主义军事理论这些概念的定义来认识当代中国军事思想的体系构成问题
正确 错误
答案：true

490. 今天我们还是要继续学习和运用毛泽东军事思想，是因为历史无数次选择了毛泽东。
正确 错误
答案：true

491. 毛泽东同志认为，要着眼特点，着眼发展研究战争。也就是说，要用发展变化的眼光看待战争。 
正确 错误
答案错误

492. 关照全局，局部服从全局，是获取战争胜利的法宝之一 
正确 错误
答案：true

493. 毛泽东军事思想，是以毛泽东为代表的中国共产党人关于中国革命战争和军队问题的科学理论体系，是毛泽东思想的重要组成部分，是中国共产党集体智慧的结晶。  
正确 错误
答案：true

494. 毛泽东同志说过，枪杆子里面出政权，说明我党必须要有一支人民的军队。 
正确 错误
答案：true

495. 自红军时期开始，我军就坚持一个宗旨，这就是全心全意为人民服务 
正确 错误
答案：true

496. 中国革命战争是中国共产党领导的人民战争，是人类战争史上规模最大的一场人民战争。
正确 错误
答案：true

497. 由于战争胜负的决定因素是人不是物，所以人定胜天，战争武器装备就不怎么重要了。
正确 错误
答案：true

498. 毛泽东军事思想既揭示了中国革命战争规律，也反映了现代战争诸多原理，它与时俱进的理论品质，对我国军事理论创新，对指导我军打赢信息化战争，具有重要的理论意义和实践意义。
正确 错误
答案：true

499. 毛泽东创新了马克思主义军事理论，指导了中国革命战争的胜利，缔造了新中国。使中华民族屹立于世界民族之林 。
正确 错误
答案：true

500. 毛泽东同志认为，“积极防御，又叫攻势防御，又叫决战防御。消极防御又叫专守防御，又叫单纯防御。消极防御实际上是假防御，只有积极防御才是真防御，才是为了反攻和进攻的防御。”  
正确 错误
答案：true

501. 习近平强军思想是习近平在领导强军兴军的伟大实践中逐步形成并丰富发展的。
正确 错误
答案：true

502. 2019年5月，为推动全军深入学习贯彻习近平强军思想，经中央军委批准，军委政治工作部组织编印了《习近平强军思想学习纲要》。
正确 错误
答案：true

503. 听党指挥是灵魂，决定军队建设的政治方向。
正确 错误
答案：true

504. 能打胜仗是核心，反映军队的根本职能和军队建设的根本指向。
正确 错误
答案：true

505. 作风优良是保证，关系军队的性质、宗旨、本色。
正确 错误
答案：true

506. 军队能不能打仗、能不能打胜仗，指挥不是一个决定性因素。
正确 错误
答案：false

507. 国防和军队现代化进程不需要同国家现代化进程相适应。
正确 错误
答案：false

508. 科学技术是核心战斗力，是军事发展中最活跃、最具革命性的因素。
正确 错误
答案：true

509. 习近平强军思想是习近平新时代中国特色社会主义思想的重要组成部分。
正确 错误
答案：true

510. 习近平强军思想贯穿的鲜明主题是强军兴军。
正确 错误
答案：true

511. 习近平强军思想是坚持走中国特色强军之路、全面推进国防和军队现代化的行动纲领。
正确 错误
答案：true

512. “召之即来、来之能战、战之能胜”由毛泽东提出，习近平将“战之能胜”改为“战之必胜”，对军队的战斗力提出了更高的要求。
正确 错误
答案：true

513. 在人类历史上，战争活动只有消极作用，没有任何积极作用。
正确 错误
答案：false

514. 中国人民是爱好和平的，因而必须反对一切战争。
正确 错误
答案：false

515. 帝国主义、霸权主义和强权政治是现代战争的总根源。
正确 错误
答案：true

516. 人类社会之所以会有战争，是因为人性中充满着恶。
正确 错误
答案：false

517. 战争不是从来就有的，也不是永远存在的。
正确 错误
答案：true

518. 战争活动只是军人的活动，与普通民众关系并不大。
正确 错误
答案：false

519. 在人类历史上，战争是一种偶然发生的社会活动，而不是一种经常性的社会活动。
正确 错误
答案：false

520. 人类战争发展历程中，在冷兵器战争、热兵器战争之后出现的战争形态是机械化战争。
正确 错误
答案：true

521. 在信息化战争迅速发展的今天，研究机械化战争已经没有意义。
正确 错误
答案：false

522. 21世纪的今天，人类的许多战争活动，仍然带有一定的机械化战争的特征。
正确 错误
答案：true

523. 如果不能在新军事革命中跟上时代潮流，中国未来将会面临极大困难。因此，我们必须加速推进中国特色军事变革。
正确 错误
答案：true

524. 当前，世界新军事革命仍然没有结束，处于动态发展之中。
正确 错误
答案：true

525. 从某种意义上说，人类最早研制成功的计算机也可以说是一种“武器装备”。
正确 错误
答案：true

526. 信息化战争是伴随着计算机技术的产生而产生，伴随着计算机技术的发展而不断发展的。
正确 错误
答案：true

527. 只有军事系统的主导因素均发生质的飞跃，才能称得上完全意义的军事革命。
正确 错误
答案：true

528. 军事革命产生于20世纪中后期。
正确 错误
答案：false

529. 军事革命是指军事领域内发生的全局性、系统性、根本性的改变和革新。
正确 错误
答案：true

530. 自20世纪中后期起，随着科学技术的发展，一场新的军事革命在世界范围内兴起，推动着热兵器战争形态向机械化战争形态转变。
正确 错误
答案：false

531. 遏制和打赢战争都是军人的任务。大学生并不是军人，没有必要学习信息化战争知识。
正确 错误
答案：false

532. 中国未来可能面对的信息化战争，一定是人民战争基础上的信息化战争。
正确 错误
答案：true

533. 当前，人工智能和军用机器人等先进技术，增强了武器装备的智能性，促进了战争形态的进一步发展。
正确 错误
答案：true

534. 机械化战争是以平台为中心，信息化战争则是以体系为中心。
正确 错误
答案：true

535. 在21世纪初期，要想遏制和打赢未来战争，就必须适应时代特点，做好应对信息化战争的准备。在此方面，中国也不例外。
正确 错误
答案：true

536. 随着世界新军事革命的发展，核战争将逐步取代机械化战争，成为信息时代战争的基本形态。
正确 错误
答案：false

537. 信息化战争是信息时代经济、技术、生产力水平和生产方式在战争领域的客观反映。
正确 错误
答案：true

538. 信息化战争是人类社会由工业社会步入信息社会的产物。
正确 错误
答案：true

539. 作战平台就是武器系统的运行载体。
正确 错误
答案：true

540. 武器装备就是作战平台。
正确 错误
答案：false

541. 武装直升机具有优越的反坦克性能，被称为“坦克杀手”。
正确 错误
答案：true

542. 坦克首次运用于实战是在第二次世界大战中的索姆河战役。
正确 错误
答案：false

543. 海军是以舰艇部队为主体、遂行海上作战任务的战略军种。
正确 错误
答案：true

544. 海军陆战队是海军的主力兵种。
正确 错误
答案：false

545. 根据欧美标准，当前战斗机已经发展了四代。
正确 错误
答案：true

546. 超音速巡航，要求飞机在发动机不开加力的情况下，能够保持1.5马赫以上时速飞行超过30分钟。
正确 错误
答案：true

547. 超机动，是指飞机在飞行过程中不改变飞行轨迹而改变机头指向的能力。
正确 错误
答案：true

548. F-35C是世界上第一款可垂直/短距起降的第四代隐身舰载战斗机。
正确 错误
答案：true

549. 当今世界先进的预警机有美国E-3、俄罗斯A-50、以色列费尔康，中国空警-2000。
正确 错误
答案：true

550. 主战装备系列化，作战平台通用化，是信息化装备的一个重要发展趋势。
正确 错误
答案：true

551. 二战之后，世界武器装备生产国集中在美国、日本、欧洲三大版块。
正确 错误
答案：false

552. 开创国防和军队现代化新局面，必须贯彻新时代党的强军思想和新时代军事战略方针。
正确 错误
答案：true

553. 繁体字“國”从象形上分析是由(      )和(      )组成的。 
答案：城池士兵

554. 《孙子兵法》是人类历史上(      )最全面论述战争的军事著作。 
答案：第一部

555. 按照社会形态可划分为奴隶制、封建制、(      )和社会主义国防。 
答案：资本主义

556. 按照国防力量的构成方式可分为(      )国防、独立自主型国防和中立型国防。 
答案：联盟型

557. 中国最早的国家是在4000年前的(      )朝建立起来的。 
答案：夏

558. 清代中国的经济已经落后于西方，还停留在农耕时代的而西方已经进入(      )时代。 
答案：工业

559. 19世纪70年代清代开辟了洋务新政建立了(      )海军。 
答案：北洋

560. 国防的基本职能是(     )与领土完整，防止外来侵略与颠覆。 
答案：捍卫国家主权

561. 中国古代国防始于公元前(     )世纪止于1840年。 
答案：21

562. 鸦片战争之后，我国沦为了(     )和半殖民地的处境。 
答案：半封建

563.  (     )年阅兵武器装备已经达到或接近世界先进水平。 
答案：2009

564. 世界的主题是(     )与发展。 
答案：和平

565. 鸦片战争之后，我国沦为了(     )和半殖民地的处境。 
答案：半封建

566. 世界的主题是(     )与发展。 
答案：和平

567. 南海是世界上第(     )大海域，总面积350万千米，我国海域占200万千米。 
答案：三

568. 我国国家安全面临的挑战是(     )问题、藏疆独立问题、中国经济发展问题。 
答案：台湾

569. 世界的主题是(     )与发展。 
答案：和平

570. 南海是世界上第(     )大海域，总面积350万千米，我国海域占200万千米。 
答案：三

571. 岛屿归属原则是(     )、最早经营、最早管辖。 
答案：最早发现

572. 习近平主席在一次重要会议提出：“建设一支听党指挥、能打胜仗、作风优良的人民军队、是党在新形势下的 ( )。 
答案：强军目标

573.  (      )年11月在党的十八大上，习近平同志担任了中共中央军委主席。 
答案：2012

574. 《七年的知青岁月》一书中讲述的是习近平主席是在( )兰牙河村插队的故事。 
答案：陕北

575. 习近平指出：“人民有信仰，国家有前途，(      ) 有希望。 
答案：民族

576. 用数据去支撑我们的行为，这个是培养 (     ) 思维的行为习惯。 
答案：信息化

577. 2020基本实现机械化，信息化建设取得重大进展，战略能力有大的提升。这一句话是习总书记在2017年10月18日 (     ) 所提出的。 
答案：十九大报告中

578. 信息化战争的产生是公元前490年9月12日，希腊士兵菲迪皮茨跑回首都雅典传递胜利喜讯。为纪念这个士兵的职业精神至今有一种体育项目叫 (     ) 。 
答案：马拉松


`;
import { pinyin } from "pinyin";
let list = text.split(/\d+(、|\.)/g);
let firstLetter = "";
let count = 0;

import fileSave from "file-save";

let file = fileSave("./data.js").write(`var a = [`, "utf8");

for (let index = 0; index < list.length; index++) {
  const i = list[index];

  console.log(count);
  count++;
  // if (count > 266) continue;
  var items = i.split(/答案：/g);
  let str = pinyin(
    items[0]
      .split("A")[0]
      .trim()
      .slice(0, i.length > 30 ? 20 : i.length),
    {
      style: "first_letter",
      compact: true,
      heteronym: true,
    }
  );
  firstLetter = "";
  for (let i = 0; i < str.length; i++) {
    for (let j = 0; j < str[i].length; j++) {
      firstLetter += str[i][j];
    }
    firstLetter += "/";
  }
  let ans = items[0].split(/A|B|C|D|E|F|G|H/g);
  console.log(items[1]);
  let composeAnswer = "";
  if (items.length > 1) {
    // 如果答案不是ABCD，是文字的话
    if (ans.length == 1) {
      items = i.split(/答案：/g);
      // 如果是true或false
      file.write(
        JSON.stringify({
          topic: items[0],
          answer: items[1].replace(/true/g, "正确").replace(/false/g, "错误"),
          pinyin: firstLetter,
        }) + ","
      );
    } else {
      const reals = items[1]
        .replace(/\n/g, "")
        .trim()
        .replace(/,/g, "")
        .split("");
      if (reals.length == ans.length - 1 && reals.length != 1) {
        composeAnswer = "全选";
      } else {
        for (let index = 1; index < ans.length; index++) {
          const e = ans[index];
          const pre = ["A", "B", "C", "D", "E", "F", "G"][index - 1];
          for (let realIndex = 0; realIndex < reals.length; realIndex++) {
            const real = reals[realIndex];
            if (pre == real) {
              composeAnswer += pre + e;
            }
          }
        }
      }
      file.write(
        JSON.stringify({
          topic: items[0],
          answer: composeAnswer,
          pinyin: firstLetter,
        }) + ","
      );
    }
  }
}
file.end("]\n").finish(() => {
  console.log("写入完成");
});
